
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.0   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user Stata perpetual license:
       Serial number:  401606204723
         Licensed to:  Nik Lomax
                       The University of Leeds

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do "ELSA_transition.do" 

.  /* Estimate transition models using the ELSA dataset */
. 
. quietly include ../../fem_env.do

. 
. local in_file : env INPUT

. 
. local out_file : env OUTPUT

. 
. local ster "$local_path/Estimates/ELSA" /* ster file for storing estimates */

. *local ster "../Estimates/ELSA" /* ster file for storing estimates */
. 
. 
. use $outdata/ELSA_transition.dta

. *use ../../input_data/ELSA_transition.dta
. 
. 
. * Globals for dependant variables
. global bin_hlth cancre diabe hearte hibpe lunge stroke arthre psyche died ast
> hmae parkine drink smoke_start smoke_stop smoken smokev

. global bin_econ work hlthlm retemp

. global ols logbmi retage ipubpen atotf itearn

. global order adlstat iadlstat drinkd_e vgactx_e mdactx_e ltactx_e smkstat

. 
. global allvars_died male hsless college l2age65l l2age6574 l2age75p l2cancre 
> l2diabe l2hearte l2hibpe l2lunge l2stroke l2adl1 l2adl2 l2adl3p l2iadl1 l2iad
> l2p l2logbmi l2smokev l2smoken l2drink l2drinkd_e l2modex_reg

. global allvars_cancre male hsless college l2age65l l2age6574 l2age75p l2logbm
> i l2smokev l2smoken l2drink l2drinkd_e smokev

. global allvars_diabe male hsless college l2age65l l2age6574 l2age75p l2logbmi
>  l2smokev l2smoken l2drink l2drinkd_e l2modex_reg

. global allvars_hearte male hsless college l2age65l l2age6574 l2age75p l2hibpe
>  l2diabe l2logbmi l2smokev l2smoken l2drink l2drinkd_e l2modex_reg

. global allvars_hibpe male hsless college l2age65l l2age6574 l2age75p l2diabe 
> l2logbmi l2smokev l2smoken l2hearte l2drink l2drinkd_e

. global allvars_lunge male hsless college l2age65l l2age6574 l2age75p l2logbmi
>  l2smokev l2smoken 

. global allvars_stroke male hsless college l2age65l l2age6574 l2age75p l2heart
> e l2cancre l2hibpe l2diabe l2logbmi l2smokev l2smoken l2drink l2drinkd_e

. global allvars_anyadl male hsless college l2age65l l2age6574 l2age75p l2heart
> e l2cancre l2hibpe l2diabe l2logbmi l2smokev l2smoken l2psyche l2arthre l2dri
> nk l2drinkd_e

. global allvars_anyiadl male hsless college l2age65l l2age6574 l2age75p l2hear
> te l2cancre l2hibpe l2diabe l2logbmi l2smokev l2smoken l2psyche l2arthre l2dr
> ink l2drinkd_e

. global allvars_arthre male hsless college l2age65l l2age6574 l2age75p l2heart
> e l2stroke l2cancre l2hibpe l2diabe l2logbmi l2smokev l2smoken l2work

. global allvars_psyche male hsless college l2age65l l2age6574 l2age75p l2heart
> e l2stroke l2cancre l2hibpe l2diabe l2logbmi l2smokev l2smoken l2work l2drink
>  l2drinkd_e

. global allvars_asthmae male hsless college l2age65l l2age6574 l2age75p l2lung
> e l2logbmi l2smokev l2smoken

. global allvars_parkine male hsless college l2age65l l2age6574 l2age75p l2diab
> e  l2stroke l2logbmi l2smokev l2smoken l2drink l2drinkd_e

. 
. global allvars_smoke_start male hsless college l2age65l l2age6574 l2age75p l2
> hearte l2stroke l2cancre l2hibpe l2diabe l2logbmi l2drink l2drinkd_e

. global allvars_smoke_stop male hsless college l2age65l l2age6574 l2age75p l2h
> earte l2stroke l2cancre l2hibpe l2diabe l2logbmi l2drink l2drinkd_e

. global allvars_drink male hsless college l2age65l l2age6574 l2age75p logbmi s
> moken smokef

. * Look at Hymovitz et. al (1997) for justification for some of the vars as sm
> oking predictors (like drinkd_e. Need to add smokef to this??)(Could also add
>  var for self-reported health measures as paper says its important)
. global allvars_smoken male hsless college l2age65l l2age6574 l2age75p l2heart
> e l2stroke l2cancre l2hibpe l2diabe l2lunge l2logbmi l2drink l2drinkd_e atotf
>  itearn /*What are these again? Should they be lag??*/

. global allvars_smokev male hsless college l2age65l l2age6574 l2age75p l2heart
> e l2stroke l2cancre l2hibpe l2diabe l2lunge l2logbmi l2drink l2drinkd_e atotf
>  itearn

. 
. global allvars_work male hsless college l2age65l l2age6574 l2age75p l2hearte 
> l2stroke l2cancre l2hibpe l2diabe l2lunge l2logbmi l2work l2adl1 l2adl2 l2adl
> 3p l2iadl1 l2iadl2p l2psyche l2arthre l2asthmae l2parkine l2drink l2drinkd_e

. global allvars_hlthlm male hsless college l2age65l l2age6574 l2age75p hearte 
> stroke cancre hibpe diabe lunge logbmi adl1 adl2 adl3p iadl1 iadl2p smokev sm
> oken arthre psyche asthmae parkine drink drinkd_e

. global allvars_retemp male hsless college l2age65l l2age6574 l2age75p l2heart
> e l2stroke l2cancre l2hibpe l2diabe l2lunge l2logbmi l2work l2adl1 l2adl2 l2a
> dl3p l2iadl1 l2iadl2p l2psyche l2arthre l2asthmae l2parkine l2hlthlm 

. 
. global allvars_logbmi male hsless college l2age65l l2age6574 l2age75p l2cancr
> e l2diabe l2hearte l2hibpe l2lunge l2stroke l2adl1 l2adl2 l2adl3p l2iadl1 l2i
> adl2p l2logbmi l2smokev l2smoken l2psyche l2arthre l2asthmae l2parkine drink 
> drinkd_e l2modex_reg

. global allvars_retage male hsless college l2age65l l2age6574 l2age75p l2cancr
> e l2diabe l2hearte l2hibpe l2lunge l2stroke l2adl1 l2adl2 l2adl3p l2iadl1 l2i
> adl2p l2logbmi l2smokev l2smoken l2work hlthlm l2arthre l2psyche l2asthmae l2
> parkine

. global allvars_ipubpen male hsless college l2age65l l2age6574 l2age75p l2canc
> re l2diabe l2hearte l2hibpe l2lunge l2stroke l2adl1 l2adl2 l2adl3p l2iadl1 l2
> iadl2p l2logbmi l2smokev l2smoken l2itearn l2work hlthlm l2arthre l2psyche l2
> asthmae l2parkine

. global allvars_atotf male hsless college l2age65l l2age6574 l2age75p l2cancre
>  l2diabe l2hearte l2hibpe l2lunge l2stroke l2adl1 l2adl2 l2adl3p l2iadl1 l2ia
> dl2p l2logbmi l2smokev l2smoken l2itearn work l2work hlthlm l2arthre l2psyche
>  l2asthmae l2parkine

. global allvars_itearn male hsless college l2age65l l2age6574 l2age75p l2cancr
> e l2diabe l2hearte l2hibpe l2lunge l2stroke l2adl1 l2adl2 l2adl3p l2iadl1 l2i
> adl2p l2logbmi l2smokev l2smoken l2itearn work l2work hlthlm l2arthre l2psych
> e l2asthmae l2parkine l2drink l2drinkd_e

. 
. global allvars_adlstat male hsless college l2age65l l2age6574 l2age75p l2canc
> re l2diabe l2hearte l2hibpe l2lunge l2stroke l2adl1 l2adl2 l2adl3p l2iadl1 l2
> iadl2p l2logbmi l2psyche l2arthre l2asthmae l2parkine l2drink l2drinkd_e

. global allvars_iadlstat male hsless college l2age65l l2age6574 l2age75p l2can
> cre l2diabe l2hearte l2hibpe l2lunge l2stroke l2adl1 l2adl2 l2adl3p l2iadl1 l
> 2iadl2p l2logbmi l2psyche l2arthre l2asthmae l2parkine l2drink l2drinkd_e

. global allvars_drinkd_e male hsless college l2age65l l2age6574 l2age75p l2hea
> rte l2stroke l2cancre l2hibpe l2diabe l2logbmi l2psyche l2modex_reg

. global allvars_vgactx_e male hsless college l2age65l l2age6574 l2age75p l2can
> cre l2diabe l2hearte l2hibpe l2lunge l2stroke l2adl1 l2adl2 l2adl3p l2iadl1 l
> 2iadl2p l2logbmi l2psyche l2arthre l2asthmae l2parkine l2smokev l2smoken

. global allvars_mdactx_e male hsless college l2age65l l2age6574 l2age75p l2can
> cre l2diabe l2hearte l2hibpe l2lunge l2stroke l2adl1 l2adl2 l2adl3p l2iadl1 l
> 2iadl2p l2logbmi l2psyche l2arthre l2asthmae l2parkine l2smokev l2smoken

. global allvars_ltactx_e male hsless college l2age65l l2age6574 l2age75p l2can
> cre l2diabe l2hearte l2hibpe l2lunge l2stroke l2adl1 l2adl2 l2adl3p l2iadl1 l
> 2iadl2p l2logbmi l2psyche l2arthre l2asthmae l2parkine l2smokev l2smoken

. global allvars_smkstat male hsless college l2age65l l2age6574 l2age75p l2hear
> te l2stroke l2cancre l2hibpe l2diabe l2lunge l2logbmi l2drink l2drinkd_e atot
> f itearn

. 
. 
. * selection criteria for models that only rely on lag value and not being dea
> d
. local select_died !l2died 

. foreach var in cancre diabe hearte hibpe lunge stroke arthre psyche asthmae p
> arkine anyadl anyiadl {
  2.         local select_`var' !l2`var' & !died 
  3. }

. 
. * Selection criteria for models that only rely on not being dead
. foreach var in logbmi adlstat iadlstat smkstat work retemp atotf drink vgactx
> _e mdactx_e ltactx_e smoken smokev {
  2.         local select_`var' !died
  3. }

. 
. 
. * Selection criteria for models with specific requirements
. local select_smoke_start !died & l2smoken == 0

. local select_smoke_stop !died & l2smoken == 1

. local select_hlthlm !died & wave > 1

. local select_itearn !died

. local select_ipubpen !died & work == 0

. local select_retage !died & retemp == 1

. local select_drinkd_e !died & wave > 1

. 
. 
. /*********************************************************************/
. * ESTIMATE BINARY OUTCOMES
. /*********************************************************************/
. 
. foreach n of varlist $bin_hlth $bin_econ {
  2.         local x = "allvars_`n'"
  3.         probit `n' $`x' if `select_`n''
  4.   mfx2, stub(b_`n') se
  5.   est save "`ster'/`n'.ster", replace
  6. }

Iteration 0:   log likelihood = -4125.8861  
Iteration 1:   log likelihood =  -4046.951  
Iteration 2:   log likelihood = -4043.6649  
Iteration 3:   log likelihood = -4043.6587  
Iteration 4:   log likelihood = -4043.6587  

Probit regression                               Number of obs     =     42,803
                                                LR chi2(12)       =     164.45
                                                Prob > chi2       =     0.0000
Log likelihood = -4043.6587                     Pseudo R2         =     0.0199

------------------------------------------------------------------------------
      cancre |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0688769   .0295971     2.33   0.020     .0108676    .1268861
      hsless |  -.0020481   .0324799    -0.06   0.950    -.0657076    .0616113
     college |   .1020853   .0406499     2.51   0.012      .022413    .1817576
    l2age65l |   .0333341   .0050546     6.59   0.000     .0234273    .0432409
   l2age6574 |   .0151347   .0048768     3.10   0.002     .0055763    .0246932
    l2age75p |  -.0052458   .0051353    -1.02   0.307    -.0153109    .0048193
    l2logbmi |   .0497726   .0901355     0.55   0.581    -.1268898    .2264349
    l2smokev |  -.0463547   .1450952    -0.32   0.749    -.3307362    .2380267
    l2smoken |   .0549241   .0444759     1.23   0.217    -.0322471    .1420952
     l2drink |   .0594058   .0474133     1.25   0.210    -.0335226    .1523341
  l2drinkd_e |  -.0213591   .0063461    -3.37   0.001    -.0337972   -.0089209
      smokev |   .0985042   .1457104     0.68   0.499    -.1870829    .3840913
       _cons |  -4.392768   .4270716   -10.29   0.000    -5.229813   -3.555723
------------------------------------------------------------------------------

Computing marginal effects after probit for cancre...


Marginal effects after probit
      y  = Pr(cancre) (predict)
         =  .01780208
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0030485      .00132    2.31   0.021   .000458  .005639    .44074
  hsless*|  -.0000898      .00142   -0.06   0.950  -.002878  .002698   .358012
 college*|   .0048126      .00205    2.34   0.019   .000789  .008836   .166647
l2age65l |   .0014618      .00021    6.81   0.000   .001041  .001882   59.7261
l2a~6574 |   .0006637      .00021    3.10   0.002   .000244  .001084   3.51653
l2age75p |    -.00023      .00023   -1.02   0.307  -.000672  .000211   1.24977
l2logbmi |   .0021827      .00395    0.55   0.581  -.005563  .009929    3.3216
l2smokev*|  -.0020559      .00651   -0.32   0.752  -.014815  .010703   .613088
l2smoken*|   .0025114      .00212    1.19   0.236  -.001639  .006662   .139523
 l2drink*|   .0024821      .00189    1.32   0.188  -.001213  .006177    .88947
l2dr~d_e |  -.0009367      .00028   -3.37   0.001  -.001481 -.000393    2.4113
  smokev*|   .0042179       .0061    0.69   0.489  -.007735  .016171   .621569
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_cancre_mfx.

-------------------------------------------------------------------------------
Model b_cancre_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
      cancre |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0030485   .0013216     2.31   0.021     .0004583    .0056387
      hsless |  -.0000898   .0014226    -0.06   0.950     -.002878    .0026985
     college |   .0048126    .002053     2.34   0.019     .0007889    .0088364
    l2age65l |   .0014618   .0002146     6.81   0.000     .0010412    .0018823
   l2age6574 |   .0006637   .0002143     3.10   0.002     .0002436    .0010837
    l2age75p |    -.00023   .0002252    -1.02   0.307    -.0006715    .0002114
    l2logbmi |   .0021827   .0039521     0.55   0.581    -.0055633    .0099286
    l2smokev |  -.0020559   .0065098    -0.32   0.752    -.0148149    .0107031
    l2smoken |   .0025114   .0021179     1.19   0.236    -.0016395    .0066624
     l2drink |   .0024821   .0018853     1.32   0.188    -.0012131    .0061773
  l2drinkd_e |  -.0009367   .0002776    -3.37   0.001    -.0014807   -.0003926
      smokev |   .0042179   .0060988     0.69   0.489    -.0077355    .0161713
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/cancre.ster
>  saved

Iteration 0:   log likelihood = -3810.9619  
Iteration 1:   log likelihood = -3578.5596  
Iteration 2:   log likelihood = -3565.7997  
Iteration 3:   log likelihood = -3565.7632  
Iteration 4:   log likelihood = -3565.7632  

Probit regression                               Number of obs     =     42,478
                                                LR chi2(12)       =     490.40
                                                Prob > chi2       =     0.0000
Log likelihood = -3565.7632                     Pseudo R2         =     0.0643

------------------------------------------------------------------------------
       diabe |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .2088775   .0319682     6.53   0.000     .1462209    .2715341
      hsless |    .033966   .0337846     1.01   0.315    -.0322506    .1001826
     college |  -.0707492   .0485978    -1.46   0.145    -.1659991    .0245007
    l2age65l |   .0122967   .0045797     2.69   0.007     .0033207    .0212726
   l2age6574 |   .0070568   .0053069     1.33   0.184    -.0033445     .017458
    l2age75p |  -.0138392   .0062584    -2.21   0.027    -.0261054   -.0015729
    l2logbmi |   1.555851    .093594    16.62   0.000      1.37241    1.739291
    l2smokev |    .060685    .034676     1.75   0.080    -.0072787    .1286487
    l2smoken |   .1077919   .0454566     2.37   0.018     .0186987    .1968852
     l2drink |  -.1142308   .0457928    -2.49   0.013    -.2039831   -.0244785
  l2drinkd_e |  -.0364598   .0071122    -5.13   0.000    -.0503994   -.0225201
 l2modex_reg |  -.1808657   .0350382    -5.16   0.000    -.2495394    -.112192
       _cons |    -7.9143    .421077   -18.80   0.000    -8.739595   -7.089004
------------------------------------------------------------------------------

Computing marginal effects after probit for diabe...


Marginal effects after probit
      y  = Pr(diabe) (predict)
         =  .01348564
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0075174      .00118    6.35   0.000   .005196  .009839   .426574
  hsless*|   .0011869      .00119    0.99   0.320  -.001153  .003527   .352182
 college*|  -.0023233      .00151   -1.54   0.125   -.00529  .000643   .171124
l2age65l |   .0004249      .00016    2.69   0.007   .000115  .000734   59.7349
l2a~6574 |   .0002438      .00018    1.33   0.183  -.000115  .000603   3.52382
l2age75p |  -.0004782      .00022   -2.21   0.027  -.000902 -.000055   1.26362
l2logbmi |   .0537592      .00313   17.18   0.000   .047627  .059891   3.31416
l2smokev*|   .0020677      .00117    1.77   0.076  -.000216  .004352   .608621
l2smoken*|   .0040643      .00186    2.18   0.029   .000413  .007716   .138189
 l2drink*|  -.0043679      .00193   -2.26   0.024   -.00815 -.000586    .89717
l2dr~d_e |  -.0012598      .00024   -5.16   0.000  -.001738 -.000782   2.47373
l2mode~g*|  -.0070607      .00153   -4.60   0.000  -.010069 -.004052   .796224
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_diabe_mfx.

-------------------------------------------------------------------------------
Model b_diabe_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
       diabe |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0075174   .0011846     6.35   0.000     .0051957    .0098391
      hsless |   .0011869   .0011938     0.99   0.320    -.0011528    .0035267
     college |  -.0023233   .0015134    -1.54   0.125    -.0052895     .000643
    l2age65l |   .0004249   .0001579     2.69   0.007     .0001155    .0007343
   l2age6574 |   .0002438   .0001832     1.33   0.183    -.0001153    .0006029
    l2age75p |  -.0004782   .0002162    -2.21   0.027    -.0009019   -.0000545
    l2logbmi |   .0537592   .0031286    17.18   0.000     .0476272    .0598913
    l2smokev |   .0020677   .0011652     1.77   0.076    -.0002161    .0043515
    l2smoken |   .0040643    .001863     2.18   0.029     .0004129    .0077157
     l2drink |  -.0043679   .0019298    -2.26   0.024    -.0081502   -.0005856
  l2drinkd_e |  -.0012598   .0002439    -5.16   0.000    -.0017379   -.0007817
 l2modex_reg |  -.0070607   .0015349    -4.60   0.000     -.010069   -.0040523
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/diabe.ster 
> saved

Iteration 0:   log likelihood = -6133.3593  
Iteration 1:   log likelihood =    -5930.3  
Iteration 2:   log likelihood = -5924.5414  
Iteration 3:   log likelihood = -5924.5332  
Iteration 4:   log likelihood = -5924.5332  

Probit regression                               Number of obs     =     38,805
                                                LR chi2(14)       =     417.65
                                                Prob > chi2       =     0.0000
Log likelihood = -5924.5332                     Pseudo R2         =     0.0340

------------------------------------------------------------------------------
      hearte |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0747484   .0254227     2.94   0.003     .0249207     .124576
      hsless |  -.0144302   .0274504    -0.53   0.599    -.0682319    .0393715
     college |   -.001992    .035935    -0.06   0.956    -.0724233    .0684394
    l2age65l |   .0168888   .0039117     4.32   0.000      .009222    .0245556
   l2age6574 |    .024428   .0041974     5.82   0.000     .0162013    .0326546
    l2age75p |   .0120203   .0042442     2.83   0.005     .0037017    .0203388
     l2hibpe |     .17799     .02538     7.01   0.000      .128246     .227734
     l2diabe |   .0510316   .0422545     1.21   0.227    -.0317857    .1338489
    l2logbmi |   .1290146   .0790943     1.63   0.103    -.0260074    .2840366
    l2smokev |  -.0030653   .0269993    -0.11   0.910     -.055983    .0498525
    l2smoken |   .0655511   .0383892     1.71   0.088    -.0096903    .1407926
     l2drink |  -.0785003   .0386747    -2.03   0.042    -.1543013   -.0026993
  l2drinkd_e |    -.00328   .0053121    -0.62   0.537    -.0136916    .0071315
 l2modex_reg |  -.1390279   .0292625    -4.75   0.000    -.1963813   -.0816746
       _cons |  -3.282204   .3547176    -9.25   0.000    -3.977438    -2.58697
------------------------------------------------------------------------------

Computing marginal effects after probit for hearte...


Marginal effects after probit
      y  = Pr(hearte) (predict)
         =  .03287042
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0055417       .0019    2.91   0.004   .001813  .009271   .429326
  hsless*|  -.0010547        .002   -0.53   0.598  -.004971  .002862   .349568
 college*|   -.000146      .00263   -0.06   0.956  -.005302   .00501   .171602
l2age65l |   .0012393      .00028    4.35   0.000   .000681  .001798   59.5954
l2a~6574 |   .0017926      .00031    5.83   0.000    .00119  .002395   3.30066
l2age75p |   .0008821      .00031    2.83   0.005   .000271  .001493    1.0845
 l2hibpe*|   .0136694      .00203    6.73   0.000   .009689  .017649   .369463
 l2diabe*|   .0038977      .00336    1.16   0.246  -.002681  .010476   .074063
l2logbmi |   .0094673       .0058    1.63   0.103  -.001902  .020837   3.31993
l2smokev*|  -.0002251      .00198   -0.11   0.910  -.004113  .003663   .605025
l2smoken*|   .0050247      .00307    1.64   0.102  -.000992  .011041    .13957
 l2drink*|  -.0061018      .00318   -1.92   0.055  -.012332  .000128   .897874
l2dr~d_e |  -.0002407      .00039   -0.62   0.537  -.001005  .000523    2.4534
l2mode~g*|  -.0110311       .0025   -4.41   0.000  -.015932  -.00613   .801778
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_hearte_mfx.

-------------------------------------------------------------------------------
Model b_hearte_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
      hearte |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0055417   .0019025     2.91   0.004     .0018129    .0092706
      hsless |  -.0010547   .0019984    -0.53   0.598    -.0049714     .002862
     college |   -.000146   .0026306    -0.06   0.956    -.0053019    .0050099
    l2age65l |   .0012393   .0002849     4.35   0.000     .0006809    .0017977
   l2age6574 |   .0017926   .0003076     5.83   0.000     .0011897    .0023954
    l2age75p |   .0008821   .0003117     2.83   0.005     .0002712    .0014929
     l2hibpe |   .0136694   .0020306     6.73   0.000     .0096894    .0176494
     l2diabe |   .0038977   .0033565     1.16   0.246     -.002681    .0104763
    l2logbmi |   .0094673    .005801     1.63   0.103    -.0019025    .0208371
    l2smokev |  -.0002251   .0019836    -0.11   0.910    -.0041129    .0036627
    l2smoken |   .0050247   .0030696     1.64   0.102    -.0009915    .0110409
     l2drink |  -.0061018   .0031788    -1.92   0.055    -.0123321    .0001284
  l2drinkd_e |  -.0002407   .0003898    -0.62   0.537    -.0010046    .0005232
 l2modex_reg |  -.0110311   .0025005    -4.41   0.000     -.015932   -.0061301
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/hearte.ster
>  saved

Iteration 0:   log likelihood = -6776.9582  
Iteration 1:   log likelihood = -6653.6441  
Iteration 2:   log likelihood = -6652.7216  
Iteration 3:   log likelihood = -6652.7215  

Probit regression                               Number of obs     =     28,041
                                                LR chi2(13)       =     248.47
                                                Prob > chi2       =     0.0000
Log likelihood = -6652.7215                     Pseudo R2         =     0.0183

------------------------------------------------------------------------------
       hibpe |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0663133   .0244051     2.72   0.007     .0184803    .1141463
      hsless |   .1310806   .0264808     4.95   0.000     .0791791     .182982
     college |  -.0011502   .0341719    -0.03   0.973    -.0681259    .0658256
    l2age65l |   .0073451   .0031881     2.30   0.021     .0010966    .0135936
   l2age6574 |   .0172193   .0042252     4.08   0.000     .0089382    .0255005
    l2age75p |  -.0045426   .0049628    -0.92   0.360    -.0142695    .0051843
     l2diabe |   .0531672   .0537045     0.99   0.322    -.0520917     .158426
    l2logbmi |   .8521799   .0761211    11.20   0.000     .7029853    1.001375
    l2smokev |   .0298453   .0263666     1.13   0.258    -.0218323    .0815229
    l2smoken |   .0687106   .0350768     1.96   0.050    -.0000387    .1374599
    l2hearte |  -.0770616   .0363024    -2.12   0.034    -.1482129   -.0059102
     l2drink |  -.0169766   .0400335    -0.42   0.672    -.0954408    .0614876
  l2drinkd_e |   .0037352   .0051143     0.73   0.465    -.0062887     .013759
       _cons |  -4.914955   .3202129   -15.35   0.000    -5.542561   -4.287349
------------------------------------------------------------------------------

Computing marginal effects after probit for hibpe...


Marginal effects after probit
      y  = Pr(hibpe) (predict)
         =  .06224566
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0081907      .00303    2.70   0.007   .002243  .014139   .428765
  hsless*|   .0166345      .00347    4.79   0.000   .009828  .023441     .3318
 college*|  -.0001409      .00418   -0.03   0.973  -.008342  .008061   .181377
l2age65l |   .0009005      .00039    2.31   0.021   .000135  .001666   59.2038
l2a~6574 |    .002111      .00052    4.08   0.000   .001097  .003125   3.01305
l2age75p |  -.0005569      .00061   -0.92   0.360  -.001749  .000636   .988053
 l2diabe*|   .0067647      .00709    0.95   0.340  -.007123  .020652   .043329
l2logbmi |   .1044717      .00923   11.32   0.000   .086381  .122563   3.29721
l2smokev*|   .0036409       .0032    1.14   0.255  -.002632  .009914   .608181
l2smoken*|   .0087395      .00462    1.89   0.059  -.000323  .017802   .150744
l2hearte*|   -.009039      .00407   -2.22   0.026  -.017012 -.001066   .127278
 l2drink*|  -.0021031      .00501   -0.42   0.675  -.011925  .007718   .900681
l2dr~d_e |   .0004579      .00063    0.73   0.465  -.000771  .001687   2.47983
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_hibpe_mfx.

-------------------------------------------------------------------------------
Model b_hibpe_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
       hibpe |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0081907   .0030348     2.70   0.007     .0022427    .0141387
      hsless |   .0166345   .0034725     4.79   0.000     .0098285    .0234406
     college |  -.0001409   .0041845    -0.03   0.973    -.0083424    .0080606
    l2age65l |   .0009005   .0003905     2.31   0.021      .000135    .0016659
   l2age6574 |    .002111   .0005174     4.08   0.000     .0010969     .003125
    l2age75p |  -.0005569   .0006084    -0.92   0.360    -.0017493    .0006356
     l2diabe |   .0067647   .0070857     0.95   0.340     -.007123    .0206524
    l2logbmi |   .1044717   .0092303    11.32   0.000     .0863806    .1225628
    l2smokev |   .0036409   .0032004     1.14   0.255    -.0026318    .0099136
    l2smoken |   .0087395   .0046238     1.89   0.059     -.000323     .017802
    l2hearte |   -.009039   .0040681    -2.22   0.026    -.0170123   -.0010657
     l2drink |  -.0021031   .0050111    -0.42   0.675    -.0119246    .0077185
  l2drinkd_e |   .0004579    .000627     0.73   0.465    -.0007709    .0016867
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/hibpe.ster 
> saved

Iteration 0:   log likelihood = -3054.7898  
Iteration 1:   log likelihood = -2913.1269  
Iteration 2:   log likelihood = -2898.6429  
Iteration 3:   log likelihood =  -2898.623  
Iteration 4:   log likelihood =  -2898.623  

Probit regression                               Number of obs     =     48,856
                                                LR chi2(9)        =     312.33
                                                Prob > chi2       =     0.0000
Log likelihood =  -2898.623                     Pseudo R2         =     0.0511

------------------------------------------------------------------------------
       lunge |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0536239    .033968     1.58   0.114    -.0129522    .1201999
      hsless |   .0582136   .0361996     1.61   0.108    -.0127364    .1291636
     college |  -.1106107    .055117    -2.01   0.045     -.218638   -.0025834
    l2age65l |   .0260333   .0055902     4.66   0.000     .0150767      .03699
   l2age6574 |      .0087   .0057432     1.51   0.130    -.0025565    .0199565
    l2age75p |   .0008219   .0056607     0.15   0.885     -.010273    .0119168
    l2logbmi |  -.1498187   .1047254    -1.43   0.153    -.3550767    .0554394
    l2smokev |   .2820129   .0435058     6.48   0.000     .1967432    .3672827
    l2smoken |    .442665   .0413385    10.71   0.000     .3616431     .523687
       _cons |   -3.71919    .481426    -7.73   0.000    -4.662768   -2.775613
------------------------------------------------------------------------------

Computing marginal effects after probit for lunge...


Marginal effects after probit
      y  = Pr(lunge) (predict)
         =  .00887748
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|    .001299      .00083    1.57   0.118  -.000328  .002926   .436732
  hsless*|   .0014254       .0009    1.58   0.115  -.000346  .003197   .364234
 college*|  -.0024393      .00111   -2.20   0.028  -.004616 -.000263   .168065
l2age65l |   .0006252      .00013    4.75   0.000   .000367  .000883   59.7769
l2a~6574 |   .0002089      .00014    1.51   0.130  -.000062   .00048   3.65087
l2age75p |   .0000197      .00014    0.15   0.885  -.000247  .000286   1.41671
l2logbmi |  -.0035981      .00252   -1.43   0.153  -.008528  .001332    3.3224
l2smokev*|    .006398      .00091    7.03   0.000   .004613  .008183   .607929
l2smoken*|    .015881      .00206    7.71   0.000   .011845  .019917   .134784
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_lunge_mfx.

-------------------------------------------------------------------------------
Model b_lunge_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
       lunge |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |    .001299     .00083     1.57   0.118    -.0003278    .0029257
      hsless |   .0014254   .0009039     1.58   0.115    -.0003462    .0031969
     college |  -.0024393   .0011105    -2.20   0.028    -.0046158   -.0002628
    l2age65l |   .0006252   .0001317     4.75   0.000     .0003671    .0008833
   l2age6574 |   .0002089    .000138     1.51   0.130    -.0000616    .0004795
    l2age75p |   .0000197   .0001359     0.15   0.885    -.0002467    .0002862
    l2logbmi |  -.0035981   .0025155    -1.43   0.153    -.0085285    .0013323
    l2smokev |    .006398   .0009105     7.03   0.000     .0046134    .0081826
    l2smoken |    .015881   .0020592     7.71   0.000     .0118451    .0199169
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/lunge.ster 
> saved

Iteration 0:   log likelihood = -2531.3892  
Iteration 1:   log likelihood = -2376.5026  
Iteration 2:   log likelihood = -2355.2823  
Iteration 3:   log likelihood = -2355.1748  
Iteration 4:   log likelihood = -2355.1748  

Probit regression                               Number of obs     =     44,758
                                                LR chi2(15)       =     352.43
                                                Prob > chi2       =     0.0000
Log likelihood = -2355.1748                     Pseudo R2         =     0.0696

------------------------------------------------------------------------------
      stroke |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0403497    .038635     1.04   0.296    -.0353735    .1160728
      hsless |   .0702757   .0406034     1.73   0.083    -.0093055    .1498569
     college |   -.022275   .0593823    -0.38   0.708    -.1386623    .0941122
    l2age65l |   .0278497   .0079362     3.51   0.000     .0122951    .0434043
   l2age6574 |   .0352048   .0065022     5.41   0.000     .0224607    .0479489
    l2age75p |   .0221927   .0052044     4.26   0.000     .0119922    .0323932
    l2hearte |   .1201496   .0438992     2.74   0.006     .0341087    .2061905
    l2cancre |  -.0201071   .0646265    -0.31   0.756    -.1467728    .1065585
     l2hibpe |   .1393616    .038309     3.64   0.000     .0642774    .2144458
     l2diabe |   .1933463   .0548978     3.52   0.000     .0857486     .300944
    l2logbmi |   .1145589   .1205927     0.95   0.342    -.1217984    .3509162
    l2smokev |   .0437914   .0422453     1.04   0.300    -.0390078    .1265907
    l2smoken |   .2101772    .055274     3.80   0.000     .1018422    .3185122
     l2drink |  -.0358513   .0554587    -0.65   0.518    -.1445483    .0728458
  l2drinkd_e |   .0068653   .0078048     0.88   0.379    -.0084318    .0221623
       _cons |  -4.821543   .6276897    -7.68   0.000    -6.051793   -3.591294
------------------------------------------------------------------------------

Computing marginal effects after probit for stroke...


Marginal effects after probit
      y  = Pr(stroke) (predict)
         =  .00695379
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0007871      .00076    1.04   0.300    -.0007  .002274    .43476
  hsless*|   .0013979      .00083    1.68   0.092  -.000229  .003025   .353099
 college*|  -.0004238      .00111   -0.38   0.702  -.002598   .00175   .169824
l2age65l |   .0005395      .00015    3.66   0.000    .00025  .000829   59.7776
l2a~6574 |    .000682      .00013    5.36   0.000   .000433  .000932    3.5345
l2age75p |   .0004299       .0001    4.20   0.000   .000229  .000631   1.22796
l2hearte*|   .0025817      .00104    2.47   0.013   .000535  .004629   .156508
l2cancre*|  -.0003815       .0012   -0.32   0.751  -.002734  .001971    .07507
 l2hibpe*|   .0028203      .00081    3.49   0.000   .001236  .004405   .384043
 l2diabe*|   .0045931      .00158    2.91   0.004   .001504  .007682   .079427
l2logbmi |   .0022194      .00233    0.95   0.342  -.002355  .006794    3.3211
l2smokev*|   .0008387       .0008    1.05   0.294  -.000728  .002406    .61055
l2smoken*|   .0049399      .00154    3.20   0.001   .001913  .007966    .13716
 l2drink*|  -.0007191      .00115   -0.62   0.532  -.002975  .001537   .892086
l2dr~d_e |    .000133      .00015    0.88   0.379  -.000163  .000429   2.42354
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_stroke_mfx.

-------------------------------------------------------------------------------
Model b_stroke_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
      stroke |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0007871   .0007586     1.04   0.300    -.0006998    .0022739
      hsless |   .0013979     .00083     1.68   0.092     -.000229    .0030247
     college |  -.0004238   .0011093    -0.38   0.702     -.002598    .0017503
    l2age65l |   .0005395   .0001475     3.66   0.000     .0002504    .0008287
   l2age6574 |    .000682   .0001273     5.36   0.000     .0004326    .0009315
    l2age75p |   .0004299   .0001024     4.20   0.000     .0002293    .0006306
    l2hearte |   .0025817   .0010443     2.47   0.013     .0005348    .0046286
    l2cancre |  -.0003815   .0012005    -0.32   0.751    -.0027343    .0019714
     l2hibpe |   .0028203   .0008085     3.49   0.000     .0012357     .004405
     l2diabe |   .0045931    .001576     2.91   0.004     .0015041    .0076821
    l2logbmi |   .0022194   .0023338     0.95   0.342    -.0023547    .0067935
    l2smokev |   .0008387   .0007995     1.05   0.294    -.0007284    .0024057
    l2smoken |   .0049399   .0015441     3.20   0.001     .0019135    .0079663
     l2drink |  -.0007191   .0011512    -0.62   0.532    -.0029754    .0015372
  l2drinkd_e |    .000133   .0001512     0.88   0.379    -.0001634    .0004294
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/stroke.ster
>  saved

Iteration 0:   log likelihood = -7678.6759  
Iteration 1:   log likelihood = -7528.5786  
Iteration 2:   log likelihood = -7527.2983  
Iteration 3:   log likelihood = -7527.2982  

Probit regression                               Number of obs     =     33,827
                                                LR chi2(15)       =     302.76
                                                Prob > chi2       =     0.0000
Log likelihood = -7527.2982                     Pseudo R2         =     0.0197

------------------------------------------------------------------------------
      arthre |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |  -.2166624   .0230971    -9.38   0.000    -.2619319   -.1713929
      hsless |   .0607637   .0247906     2.45   0.014      .012175    .1093524
     college |   -.024759   .0317724    -0.78   0.436    -.0870318    .0375138
    l2age65l |   .0139372   .0031804     4.38   0.000     .0077038    .0201706
   l2age6574 |  -.0043291   .0041561    -1.04   0.298    -.0124749    .0038167
    l2age75p |   .0039835   .0043264     0.92   0.357    -.0044961    .0124631
    l2hearte |   .1088518   .0308795     3.53   0.000     .0483291    .1693745
    l2stroke |   .0664952   .0595316     1.12   0.264    -.0501847    .1831751
    l2cancre |  -.0017823   .0420604    -0.04   0.966    -.0842192    .0806546
     l2hibpe |   .0928637   .0235105     3.95   0.000      .046784    .1389435
     l2diabe |  -.0438103     .04168    -1.05   0.293    -.1255016    .0378811
    l2logbmi |   .6193005    .072237     8.57   0.000     .4777185    .7608824
    l2smokev |   .0661933   .0243116     2.72   0.006     .0185434    .1138432
    l2smoken |  -.0398577   .0342967    -1.16   0.245     -.107078    .0273625
      l2work |  -.0733949    .028544    -2.57   0.010    -.1293401   -.0174497
       _cons |  -4.403561    .308731   -14.26   0.000    -5.008663    -3.79846
------------------------------------------------------------------------------

Computing marginal effects after probit for arthre...


Marginal effects after probit
      y  = Pr(arthre) (predict)
         =  .05676078
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|  -.0246467      .00261   -9.45   0.000  -.029761 -.019533   .484081
  hsless*|   .0070429      .00292    2.41   0.016   .001321  .012765   .333255
 college*|  -.0027889      .00353   -0.79   0.430  -.009716  .004138   .184941
l2age65l |   .0015894      .00036    4.39   0.000    .00088  .002299   59.2158
l2a~6574 |  -.0004937      .00047   -1.04   0.298  -.001423  .000435   3.15792
l2age75p |   .0004543      .00049    0.92   0.357  -.000513  .001421   1.11186
l2hearte*|   .0132172      .00398    3.32   0.001   .005415  .021019   .135306
l2stroke*|   .0079652      .00748    1.06   0.287  -.006694  .022624   .030833
l2cancre*|   -.000203      .00479   -0.04   0.966  -.009581  .009175   .069974
 l2hibpe*|   .0108293       .0028    3.87   0.000   .005341  .016318    .35111
 l2diabe*|  -.0048508      .00448   -1.08   0.279  -.013628  .003926   .074704
l2logbmi |   .0706263       .0082    8.61   0.000   .054558  .086695   3.30613
l2smokev*|   .0074687      .00271    2.75   0.006   .002152  .012785    .60434
l2smoken*|  -.0044452      .00374   -1.19   0.235  -.011774  .002884   .146333
  l2work*|  -.0083306      .00322   -2.58   0.010  -.014649 -.002012   .456381
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_arthre_mfx.

-------------------------------------------------------------------------------
Model b_arthre_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
      arthre |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |  -.0246467   .0026092    -9.45   0.000    -.0297607   -.0195326
      hsless |   .0070429   .0029196     2.41   0.016     .0013206    .0127651
     college |  -.0027889   .0035344    -0.79   0.430    -.0097163    .0041384
    l2age65l |   .0015894   .0003618     4.39   0.000     .0008802    .0022986
   l2age6574 |  -.0004937   .0004739    -1.04   0.298    -.0014225    .0004351
    l2age75p |   .0004543   .0004934     0.92   0.357    -.0005127    .0014213
    l2hearte |   .0132172   .0039808     3.32   0.001     .0054149    .0210194
    l2stroke |   .0079652   .0074793     1.06   0.287    -.0066939    .0226243
    l2cancre |   -.000203    .004785    -0.04   0.966    -.0095815    .0091755
     l2hibpe |   .0108293   .0028004     3.87   0.000     .0053406     .016318
     l2diabe |  -.0048508   .0044781    -1.08   0.279    -.0136277    .0039261
    l2logbmi |   .0706263   .0081984     8.61   0.000     .0545577    .0866949
    l2smokev |   .0074687   .0027126     2.75   0.006      .002152    .0127853
    l2smoken |  -.0044452   .0037392    -1.19   0.235    -.0117739    .0028835
      l2work |  -.0083306    .003224    -2.58   0.010    -.0146494   -.0020118
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/arthre.ster
>  saved

Iteration 0:   log likelihood = -2655.7816  
Iteration 1:   log likelihood = -2591.5744  
Iteration 2:   log likelihood = -2588.6034  
Iteration 3:   log likelihood =  -2588.597  
Iteration 4:   log likelihood =  -2588.597  

Probit regression                               Number of obs     =     42,084
                                                LR chi2(17)       =     134.37
                                                Prob > chi2       =     0.0000
Log likelihood =  -2588.597                     Pseudo R2         =     0.0253

------------------------------------------------------------------------------
      psyche |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |  -.1259477   .0379326    -3.32   0.001    -.2002943   -.0516011
      hsless |   .0040308    .040324     0.10   0.920    -.0750027    .0830643
     college |   .0351313   .0501361     0.70   0.483    -.0631336    .1333962
    l2age65l |  -.0252755    .004308    -5.87   0.000    -.0337191    -.016832
   l2age6574 |  -.0252946   .0069667    -3.63   0.000    -.0389491   -.0116401
    l2age75p |   .0004667   .0078957     0.06   0.953    -.0150086    .0159421
    l2hearte |   .0663833   .0490443     1.35   0.176    -.0297417    .1625084
    l2stroke |   .0113321   .1055092     0.11   0.914    -.1954622    .2181264
    l2cancre |   .0942828   .0651059     1.45   0.148    -.0333224    .2218879
     l2hibpe |   .0246581   .0386759     0.64   0.524    -.0511453    .1004615
     l2diabe |  -.0038349   .0683239    -0.06   0.955    -.1377474    .1300775
    l2logbmi |  -.1644017   .1124196    -1.46   0.144    -.3847401    .0559368
    l2smokev |   .0928087   .0396956     2.34   0.019     .0150068    .1706107
    l2smoken |   .0472756   .0512242     0.92   0.356     -.053122    .1476732
      l2work |  -.1516666   .0446723    -3.40   0.001    -.2392227   -.0641106
     l2drink |  -.0913658   .0549476    -1.66   0.096    -.1990612    .0163296
  l2drinkd_e |  -.0167933   .0079692    -2.11   0.035    -.0324127    -.001174
       _cons |   -.019122   .4599897    -0.04   0.967    -.9206852    .8824413
------------------------------------------------------------------------------

Computing marginal effects after probit for psyche...


Marginal effects after probit
      y  = Pr(psyche) (predict)
         =  .01032519
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|  -.0034075      .00101   -3.38   0.001  -.005386 -.001429   .445823
  hsless*|   .0001106      .00111    0.10   0.920  -.002061  .002282   .360755
 college*|   .0009896      .00145    0.68   0.495  -.001854  .003833   .165146
l2age65l |  -.0006927      .00012   -5.87   0.000  -.000924 -.000461    59.934
l2a~6574 |  -.0006932      .00019   -3.67   0.000  -.001064 -.000323   3.77093
l2age75p |   .0000128      .00022    0.06   0.953  -.000411  .000437   1.37447
l2hearte*|   .0019181      .00149    1.29   0.198  -.001004  .004841   .159395
l2stroke*|   .0003144      .00296    0.11   0.916  -.005494  .006122   .032506
l2cancre*|   .0028375      .00214    1.32   0.185  -.001361  .007036   .074518
 l2hibpe*|   .0006801      .00107    0.63   0.526  -.001424  .002784   .390386
 l2diabe*|  -.0001047      .00186   -0.06   0.955  -.003748  .003538   .082739
l2logbmi |  -.0045057      .00308   -1.46   0.143  -.010539  .001528   3.32065
l2smokev*|   .0024884      .00104    2.39   0.017    .00045  .004527   .609139
l2smoken*|   .0013492      .00152    0.89   0.375  -.001633  .004331   .131927
  l2work*|  -.0040109      .00114   -3.51   0.000   -.00625 -.001772   .386655
 l2drink*|  -.0027222      .00177   -1.53   0.125  -.006198  .000754   .891146
l2dr~d_e |  -.0004602      .00022   -2.11   0.035  -.000887 -.000033   2.42745
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_psyche_mfx.

-------------------------------------------------------------------------------
Model b_psyche_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
      psyche |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |  -.0034075   .0010096    -3.38   0.001    -.0053863   -.0014287
      hsless |   .0001106    .001108     0.10   0.920    -.0020611    .0022823
     college |   .0009896   .0014506     0.68   0.495    -.0018536    .0038328
    l2age65l |  -.0006927    .000118    -5.87   0.000    -.0009241   -.0004614
   l2age6574 |  -.0006932    .000189    -3.67   0.000    -.0010636   -.0003229
    l2age75p |   .0000128   .0002164     0.06   0.953    -.0004113    .0004369
    l2hearte |   .0019181   .0014911     1.29   0.198    -.0010044    .0048405
    l2stroke |   .0003144   .0029633     0.11   0.916    -.0054935    .0061224
    l2cancre |   .0028375   .0021419     1.32   0.185    -.0013606    .0070355
     l2hibpe |   .0006801   .0010734     0.63   0.526    -.0014238     .002784
     l2diabe |  -.0001047   .0018587    -0.06   0.955    -.0037478    .0035383
    l2logbmi |  -.0045057   .0030783    -1.46   0.143    -.0105391    .0015277
    l2smokev |   .0024884   .0010403     2.39   0.017     .0004495    .0045273
    l2smoken |   .0013492   .0015214     0.89   0.375    -.0016327    .0043312
      l2work |  -.0040109   .0011425    -3.51   0.000    -.0062502   -.0017717
     l2drink |  -.0027222   .0017734    -1.53   0.125     -.006198    .0007536
  l2drinkd_e |  -.0004602   .0002179    -2.11   0.035    -.0008874   -.0000331
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/psyche.ster
>  saved

Iteration 0:   log likelihood = -5959.1398  
Iteration 1:   log likelihood = -4877.5195  
Iteration 2:   log likelihood = -4744.8808  
Iteration 3:   log likelihood =  -4743.232  
Iteration 4:   log likelihood = -4743.2264  
Iteration 5:   log likelihood = -4743.2264  

Probit regression                               Number of obs     =     48,653
                                                LR chi2(23)       =    2431.83
                                                Prob > chi2       =     0.0000
Log likelihood = -4743.2264                     Pseudo R2         =     0.2040

------------------------------------------------------------------------------
        died |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .3114024   .0290862    10.71   0.000     .2543945    .3684104
      hsless |   .1377597   .0304132     4.53   0.000     .0781509    .1973684
     college |   .0131912    .046353     0.28   0.776     -.077659    .1040415
    l2age65l |   .0163529   .0061432     2.66   0.008     .0043124    .0283934
   l2age6574 |   .0329218   .0051095     6.44   0.000     .0229074    .0429362
    l2age75p |   .0451535   .0034092    13.24   0.000     .0384716    .0518353
    l2cancre |   .4574518    .036743    12.45   0.000     .3854369    .5294667
     l2diabe |   .0648362   .0414917     1.56   0.118    -.0164859    .1461584
    l2hearte |   .2307067   .0301661     7.65   0.000     .1715822    .2898311
     l2hibpe |  -.0011076   .0283471    -0.04   0.969    -.0566668    .0544516
     l2lunge |   .2623499   .0425745     6.16   0.000     .1789053    .3457944
    l2stroke |    .160097   .0489007     3.27   0.001     .0642533    .2559407
      l2adl1 |   .0615238   .0409492     1.50   0.133    -.0187351    .1417827
      l2adl2 |   .0700039   .0544958     1.28   0.199    -.0368059    .1768138
     l2adl3p |   .0128319   .0570848     0.22   0.822    -.0990522     .124716
     l2iadl1 |   .2096924    .040239     5.21   0.000     .1308254    .2885594
    l2iadl2p |   .3650527   .0451493     8.09   0.000     .2765616    .4535438
    l2logbmi |  -.2422728   .0960297    -2.52   0.012    -.4304875   -.0540581
    l2smokev |   .0779363   .0326242     2.39   0.017      .013994    .1418786
    l2smoken |   .2408403   .0395612     6.09   0.000     .1633018    .3183787
     l2drink |  -.1018223   .0370915    -2.75   0.006    -.1745203   -.0291243
  l2drinkd_e |   .0049252   .0056935     0.87   0.387    -.0062339    .0160842
 l2modex_reg |  -.3138298   .0316774    -9.91   0.000    -.3759164   -.2517431
       _cons |  -2.759716   .4883983    -5.65   0.000    -3.716959   -1.802473
------------------------------------------------------------------------------

Computing marginal effects after probit for died...


Marginal effects after probit
      y  = Pr(died) (predict)
         =  .01148784
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0099285        .001    9.93   0.000   .007968  .011889   .440343
  hsless*|   .0043298        .001    4.32   0.000   .002365  .006294   .368939
 college*|   .0004007      .00142    0.28   0.778  -.002387  .003189   .163875
l2age65l |   .0004918      .00018    2.70   0.007   .000135  .000848   59.9605
l2a~6574 |   .0009901      .00015    6.45   0.000   .000689  .001291   3.81666
l2age75p |   .0013579      .00012   11.81   0.000   .001133  .001583   1.48651
l2cancre*|   .0215109      .00251    8.57   0.000   .016589  .026433   .079975
 l2diabe*|   .0020735      .00141    1.47   0.141   -.00069  .004837   .085277
l2hearte*|   .0082901       .0013    6.39   0.000   .005746  .010834   .171274
 l2hibpe*|  -.0000333      .00085   -0.04   0.969  -.001703  .001637   .399626
 l2lunge*|    .010318      .00215    4.80   0.000   .006105  .014531   .056317
l2stroke*|   .0057055      .00205    2.78   0.005   .001683  .009728   .037387
  l2adl1*|    .001959      .00138    1.42   0.156  -.000744  .004662   .093972
  l2adl2*|   .0022659       .0019    1.20   0.232  -.001448   .00598   .040039
 l2adl3p*|   .0003911      .00176    0.22   0.824  -.003064  .003846   .043677
 l2iadl1*|   .0076571      .00176    4.35   0.000   .004204   .01111   .100055
l2iadl2p*|   .0155891      .00263    5.92   0.000   .010427  .020752   .087086
l2logbmi |   -.007286      .00289   -2.52   0.012  -.012957 -.001615   3.32086
l2smokev*|   .0022972      .00094    2.44   0.015   .000451  .004144   .619078
l2smoken*|   .0088707      .00175    5.08   0.000   .005446  .012296   .139539
 l2drink*|  -.0033496      .00133   -2.51   0.012  -.005961 -.000738   .883317
l2dr~d_e |   .0001481      .00017    0.86   0.388  -.000188  .000484   2.40836
l2mode~g*|  -.0115538      .00143   -8.10   0.000  -.014348  -.00876   .766715
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_died_mfx.

-------------------------------------------------------------------------------
Model b_died_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
        died |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0099285   .0010003     9.93   0.000     .0079679    .0118892
      hsless |   .0043298   .0010022     4.32   0.000     .0023654    .0062942
     college |   .0004007   .0014225     0.28   0.778    -.0023874    .0031889
    l2age65l |   .0004918    .000182     2.70   0.007     .0001351    .0008485
   l2age6574 |   .0009901   .0001534     6.45   0.000     .0006894    .0012907
    l2age75p |   .0013579    .000115    11.81   0.000     .0011325    .0015833
    l2cancre |   .0215109   .0025114     8.57   0.000     .0165887     .026433
     l2diabe |   .0020735   .0014099     1.47   0.141    -.0006898    .0048368
    l2hearte |   .0082901   .0012981     6.39   0.000     .0057459    .0108344
     l2hibpe |  -.0000333   .0008521    -0.04   0.969    -.0017034    .0016368
     l2lunge |    .010318   .0021493     4.80   0.000     .0061054    .0145305
    l2stroke |   .0057055   .0020523     2.78   0.005      .001683     .009728
      l2adl1 |    .001959   .0013793     1.42   0.156    -.0007444    .0046624
      l2adl2 |   .0022659    .001895     1.20   0.232    -.0014483      .00598
     l2adl3p |   .0003911   .0017629     0.22   0.824    -.0030641    .0038462
     l2iadl1 |   .0076571   .0017617     4.35   0.000     .0042044    .0111099
    l2iadl2p |   .0155891    .002634     5.92   0.000     .0104266    .0207517
    l2logbmi |   -.007286   .0028937    -2.52   0.012    -.0129575   -.0016145
    l2smokev |   .0022972   .0009422     2.44   0.015     .0004505    .0041439
    l2smoken |   .0088707   .0017475     5.08   0.000     .0054457    .0122957
     l2drink |  -.0033496   .0013322    -2.51   0.012    -.0059606   -.0007385
  l2drinkd_e |   .0001481   .0001714     0.86   0.388    -.0001878    .0004841
 l2modex_reg |  -.0115538   .0014255    -8.10   0.000    -.0143478   -.0087598
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/died.ster s
> aved

Iteration 0:   log likelihood = -2340.7495  
Iteration 1:   log likelihood = -2302.1946  
Iteration 2:   log likelihood =  -2298.309  
Iteration 3:   log likelihood = -2298.3038  
Iteration 4:   log likelihood = -2298.3038  

Probit regression                               Number of obs     =     45,180
                                                LR chi2(10)       =      84.89
                                                Prob > chi2       =     0.0000
Log likelihood = -2298.3038                     Pseudo R2         =     0.0181

------------------------------------------------------------------------------
     asthmae |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0102843   .0378158     0.27   0.786    -.0638333    .0844018
      hsless |   .0723571   .0414944     1.74   0.081    -.0089704    .1536846
     college |   .0955811   .0532707     1.79   0.073    -.0088276    .1999897
    l2age65l |  -.0040869   .0049605    -0.82   0.410    -.0138092    .0056354
   l2age6574 |    -.00507     .00666    -0.76   0.446    -.0181233    .0079833
    l2age75p |   .0051112   .0068184     0.75   0.453    -.0082527     .018475
     l2lunge |   .4271688   .0655733     6.51   0.000     .2986476    .5556901
    l2logbmi |   .4411414   .1142502     3.86   0.000      .217215    .6650677
    l2smokev |   .0780069   .0430281     1.81   0.070    -.0063266    .1623404
    l2smoken |   .1767036   .0506016     3.49   0.000     .0775263    .2758808
       _cons |   -3.73618   .4755235    -7.86   0.000    -4.668189   -2.804171
------------------------------------------------------------------------------

Computing marginal effects after probit for asthmae...


Marginal effects after probit
      y  = Pr(asthmae) (predict)
         =  .00841204
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0002359      .00087    0.27   0.786  -.001466  .001938    .44803
  hsless*|   .0016972        .001    1.71   0.088  -.000253  .003648   .368969
 college*|   .0023676      .00142    1.67   0.096  -.000417  .005152   .163347
l2age65l |  -.0000936      .00011   -0.82   0.410  -.000316  .000129   59.8523
l2a~6574 |  -.0001161      .00015   -0.76   0.446  -.000415  .000183   3.73342
l2age75p |   .0001171      .00016    0.75   0.453  -.000189  .000423   1.47306
 l2lunge*|   .0157875      .00355    4.45   0.000   .008834  .022741   .040726
l2logbmi |   .0101058       .0026    3.89   0.000   .005019  .015192   3.31927
l2smokev*|   .0017517      .00095    1.85   0.064  -.000101  .003604   .613391
l2smoken*|    .004725      .00156    3.03   0.002   .001669  .007781   .142762
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_asthmae_mfx.

-------------------------------------------------------------------------------
Model b_asthmae_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
     asthmae |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0002359   .0008685     0.27   0.786    -.0014663    .0019381
      hsless |   .0016972   .0009952     1.71   0.088    -.0002532    .0036477
     college |   .0023676   .0014209     1.67   0.096    -.0004174    .0051525
    l2age65l |  -.0000936   .0001136    -0.82   0.410    -.0003162     .000129
   l2age6574 |  -.0001161   .0001525    -0.76   0.446    -.0004151    .0001828
    l2age75p |   .0001171   .0001561     0.75   0.453    -.0001889    .0004231
     l2lunge |   .0157875   .0035476     4.45   0.000     .0088343    .0227407
    l2logbmi |   .0101058   .0025951     3.89   0.000     .0050195    .0151921
    l2smokev |   .0017517   .0009453     1.85   0.064    -.0001011    .0036044
    l2smoken |    .004725    .001559     3.03   0.002     .0016693    .0077806
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/asthmae.ste
> r saved

Iteration 0:   log likelihood =  -632.6185  
Iteration 1:   log likelihood = -596.68506  
Iteration 2:   log likelihood = -589.96715  
Iteration 3:   log likelihood = -589.73917  
Iteration 4:   log likelihood = -589.73871  
Iteration 5:   log likelihood = -589.73871  

Probit regression                               Number of obs     =     46,089
                                                LR chi2(13)       =      85.76
                                                Prob > chi2       =     0.0000
Log likelihood = -589.73871                     Pseudo R2         =     0.0678

------------------------------------------------------------------------------
     parkine |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .3842042   .0775286     4.96   0.000     .2322509    .5361574
      hsless |   .0106203   .0771034     0.14   0.890    -.1404995    .1617401
     college |   -.121414   .1176127    -1.03   0.302    -.3519308    .1091027
    l2age65l |   .0535712   .0189469     2.83   0.005      .016436    .0907064
   l2age6574 |   .0207754    .012046     1.72   0.085    -.0028343    .0443852
    l2age75p |  -.0016713   .0109105    -0.15   0.878    -.0230554    .0197129
     l2diabe |  -.1783025     .13028    -1.37   0.171    -.4336465    .0770416
    l2stroke |  -.0260688   .1673835    -0.16   0.876    -.3541344    .3019968
    l2logbmi |   .1434477   .2344427     0.61   0.541    -.3160517     .602947
    l2smokev |    .094596   .0804534     1.18   0.240    -.0630897    .2522817
    l2smoken |  -.1246792   .1259676    -0.99   0.322    -.3715712    .1222129
     l2drink |  -.2614578   .0954558    -2.74   0.006    -.4485477   -.0743679
  l2drinkd_e |  -.0209936   .0160827    -1.31   0.192    -.0525151    .0105279
       _cons |  -6.728432    1.39498    -4.82   0.000    -9.462542   -3.994322
------------------------------------------------------------------------------

Computing marginal effects after probit for parkine...


Marginal effects after probit
      y  = Pr(parkine) (predict)
         =  .00103508
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0015152      .00036    4.18   0.000   .000804  .002226    .43544
  hsless*|   .0000371      .00027    0.14   0.891  -.000493  .000567   .358046
 college*|  -.0003743      .00032   -1.16   0.245  -.001006  .000257   .167676
l2age65l |   .0001862      .00006    3.36   0.001   .000077  .000295   59.8442
l2a~6574 |   .0000722      .00004    1.65   0.099  -.000014  .000158   3.62607
l2age75p |  -5.81e-06      .00004   -0.15   0.878   -.00008  .000069   1.29758
 l2diabe*|  -.0004973      .00029   -1.70   0.089  -.001071  .000077   .082927
l2stroke*|  -.0000873      .00054   -0.16   0.872  -.001145  .000971    .03337
l2logbmi |   .0004985      .00081    0.61   0.541  -.001098  .002095   3.32139
l2smokev*|   .0003191      .00027    1.20   0.230  -.000202  .000841    .61353
l2smoken*|  -.0003788      .00034   -1.13   0.258  -.001035  .000278   .137538
 l2drink*|  -.0012643      .00063   -2.02   0.043   -.00249 -.000039   .888954
l2dr~d_e |   -.000073      .00006   -1.30   0.195  -.000183  .000037    2.4117
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_parkine_mfx.

-------------------------------------------------------------------------------
Model b_parkine_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
     parkine |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0015152   .0003629     4.18   0.000      .000804    .0022264
      hsless |   .0000371   .0002705     0.14   0.891     -.000493    .0005672
     college |  -.0003743   .0003223    -1.16   0.245    -.0010061    .0002574
    l2age65l |   .0001862   .0000555     3.36   0.001     .0000774    .0002949
   l2age6574 |   .0000722   .0000438     1.65   0.099    -.0000136     .000158
    l2age75p |  -5.81e-06   .0000379    -0.15   0.878    -.0000802    .0000686
     l2diabe |  -.0004973   .0002928    -1.70   0.089    -.0010711    .0000766
    l2stroke |  -.0000873   .0005398    -0.16   0.872    -.0011453    .0009708
    l2logbmi |   .0004985   .0008146     0.61   0.541    -.0010981    .0020951
    l2smokev |   .0003191   .0002661     1.20   0.230    -.0002024    .0008405
    l2smoken |  -.0003788   .0003351    -1.13   0.258    -.0010355    .0002779
     l2drink |  -.0012643   .0006252    -2.02   0.043    -.0024895    -.000039
  l2drinkd_e |   -.000073   .0000563    -1.30   0.195    -.0001834    .0000374
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/parkine.ste
> r saved

Iteration 0:   log likelihood = -16523.777  
Iteration 1:   log likelihood = -15612.653  
Iteration 2:   log likelihood = -15601.938  
Iteration 3:   log likelihood = -15601.933  
Iteration 4:   log likelihood = -15601.933  

Probit regression                               Number of obs     =     44,556
                                                LR chi2(9)        =    1843.69
                                                Prob > chi2       =     0.0000
Log likelihood = -15601.933                     Pseudo R2         =     0.0558

------------------------------------------------------------------------------
       drink |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |    .324787   .0166276    19.53   0.000     .2921975    .3573764
      hsless |  -.3039548    .017297   -17.57   0.000    -.3378563   -.2700534
     college |   .1021366   .0252629     4.04   0.000     .0526223    .1516509
    l2age65l |  -.0026352   .0022887    -1.15   0.250    -.0071209    .0018505
   l2age6574 |  -.0291736    .002745   -10.63   0.000    -.0345537   -.0237935
    l2age75p |   -.022586   .0028337    -7.97   0.000      -.02814    -.017032
      logbmi |  -.4055273    .046581    -8.71   0.000    -.4968243   -.3142302
      smoken |   -.223053   .0325377    -6.86   0.000    -.2868257   -.1592804
      smokef |   .0003759   .0022109     0.17   0.865    -.0039574    .0047092
       _cons |   2.835991   .2045829    13.86   0.000     2.435016    3.236966
------------------------------------------------------------------------------

Computing marginal effects after probit for drink...


Marginal effects after probit
      y  = Pr(drink) (predict)
         =  .89026935
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0595841      .00296   20.13   0.000   .053783  .065386   .437023
  hsless*|  -.0603779      .00362  -16.70   0.000  -.067464 -.053292   .349538
 college*|   .0183928      .00435    4.22   0.000   .009859  .026927   .171806
l2age65l |  -.0004946      .00043   -1.15   0.250  -.001337  .000347   59.7966
l2a~6574 |   -.005476      .00051  -10.65   0.000  -.006483 -.004469   3.52098
l2age75p |  -.0042395      .00053   -7.96   0.000  -.005283 -.003196   1.18393
  logbmi |  -.0761195      .00874   -8.71   0.000  -.093241 -.058998   3.32262
  smoken*|  -.0462959       .0074   -6.25   0.000  -.060804 -.031788    .12234
  smokef |   .0000706      .00041    0.17   0.865  -.000743  .000884   1.24341
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_drink_mfx.

-------------------------------------------------------------------------------
Model b_drink_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
       drink |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0595841     .00296    20.13   0.000     .0537826    .0653856
      hsless |  -.0603779   .0036154   -16.70   0.000    -.0674639   -.0532919
     college |   .0183928   .0043543     4.22   0.000     .0098586    .0269271
    l2age65l |  -.0004946   .0004296    -1.15   0.250    -.0013366    .0003473
   l2age6574 |   -.005476   .0005139   -10.65   0.000    -.0064833   -.0044687
    l2age75p |  -.0042395   .0005324    -7.96   0.000     -.005283    -.003196
      logbmi |  -.0761195   .0087357    -8.71   0.000    -.0932411   -.0589979
      smoken |  -.0462959   .0074021    -6.25   0.000    -.0608038   -.0317881
      smokef |   .0000706    .000415     0.17   0.865    -.0007428    .0008839
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/drink.ster 
> saved

Iteration 0:   log likelihood =  -2370.781  
Iteration 1:   log likelihood = -2320.9477  
Iteration 2:   log likelihood = -2318.6034  
Iteration 3:   log likelihood = -2318.5947  
Iteration 4:   log likelihood = -2318.5947  

Probit regression                               Number of obs     =     39,861
                                                LR chi2(14)       =     104.37
                                                Prob > chi2       =     0.0000
Log likelihood = -2318.5947                     Pseudo R2         =     0.0220

------------------------------------------------------------------------------
 smoke_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .1312412   .0380771     3.45   0.001     .0566115    .2058708
      hsless |   .1179011   .0414483     2.84   0.004      .036664    .1991382
     college |  -.1651393   .0561371    -2.94   0.003     -.275166   -.0551127
    l2age65l |  -.0117795   .0046722    -2.52   0.012    -.0209368   -.0026222
   l2age6574 |  -.0188458   .0068901    -2.74   0.006    -.0323503   -.0053414
    l2age75p |  -.0334124   .0100851    -3.31   0.001    -.0531788   -.0136459
    l2hearte |   .0701756   .0508845     1.38   0.168    -.0295563    .1699074
    l2stroke |   .0841177   .1050527     0.80   0.423    -.1217818    .2900172
    l2cancre |   .0687079   .0693888     0.99   0.322    -.0672918    .2047075
     l2hibpe |   .0299286   .0399906     0.75   0.454    -.0484516    .1083088
     l2diabe |   .0854638   .0656814     1.30   0.193    -.0432694     .214197
    l2logbmi |  -.1902745   .1202236    -1.58   0.113    -.4259085    .0453595
     l2drink |  -.1379915   .0603719    -2.29   0.022    -.2563182   -.0196648
  l2drinkd_e |   .0130732   .0080246     1.63   0.103    -.0026547    .0288011
       _cons |  -.8991341   .4881056    -1.84   0.065    -1.855804    .0575352
------------------------------------------------------------------------------

Computing marginal effects after probit for smoke_start...


Marginal effects after probit
      y  = Pr(smoke_start) (predict)
         =  .00953443
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0034314      .00102    3.38   0.001   .001441  .005422   .437244
  hsless*|   .0031565      .00116    2.72   0.006   .000885  .005428   .341612
 college*|  -.0037447      .00112   -3.34   0.001  -.005941 -.001549   .179925
l2age65l |  -.0003011      .00012   -2.53   0.012  -.000535 -.000067   60.0599
l2a~6574 |  -.0004818      .00018   -2.74   0.006  -.000826 -.000137   3.84893
l2age75p |  -.0008542      .00025   -3.39   0.001  -.001348  -.00036   1.42947
l2hearte*|   .0018971      .00145    1.31   0.191  -.000948  .004742   .164196
l2stroke*|   .0023589      .00322    0.73   0.464   -.00395  .008667   .033391
l2cancre*|   .0018808      .00203    0.93   0.354  -.002096  .005857   .078322
 l2hibpe*|   .0007704      .00104    0.74   0.457  -.001261  .002802   .403929
 l2diabe*|   .0023765      .00198    1.20   0.230  -.001503  .006256   .083716
l2logbmi |  -.0048644      .00307   -1.58   0.113   -.01088  .001151   3.32645
 l2drink*|  -.0040133      .00198   -2.03   0.043  -.007892 -.000134   .892777
l2dr~d_e |   .0003342       .0002    1.63   0.103  -.000067  .000736   2.44429
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_smoke_start_mfx.

-------------------------------------------------------------------------------
Model b_smoke_start_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
 smoke_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0034314   .0010155     3.38   0.001     .0014411    .0054217
      hsless |   .0031565   .0011587     2.72   0.006     .0008854    .0054276
     college |  -.0037447   .0011204    -3.34   0.001    -.0059405   -.0015488
    l2age65l |  -.0003011   .0001192    -2.53   0.012    -.0005349   -.0000674
   l2age6574 |  -.0004818   .0001757    -2.74   0.006    -.0008261   -.0001375
    l2age75p |  -.0008542   .0002521    -3.39   0.001    -.0013482   -.0003601
    l2hearte |   .0018971   .0014515     1.31   0.191    -.0009477    .0047419
    l2stroke |   .0023589   .0032187     0.73   0.464    -.0039496    .0086674
    l2cancre |   .0018808    .002029     0.93   0.354    -.0020959    .0058575
     l2hibpe |   .0007704   .0010365     0.74   0.457    -.0012611     .002802
     l2diabe |   .0023765   .0019792     1.20   0.230    -.0015026    .0062556
    l2logbmi |  -.0048644   .0030692    -1.58   0.113    -.0108799    .0011512
     l2drink |  -.0040133   .0019792    -2.03   0.043    -.0078924   -.0001342
  l2drinkd_e |   .0003342   .0002049     1.63   0.103    -.0000673    .0007357
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/smoke_start
> .ster saved

Iteration 0:   log likelihood = -2840.2223  
Iteration 1:   log likelihood =  -2804.384  
Iteration 2:   log likelihood = -2804.3089  
Iteration 3:   log likelihood = -2804.3089  

Probit regression                               Number of obs     =      6,354
                                                LR chi2(14)       =      71.83
                                                Prob > chi2       =     0.0000
Log likelihood = -2804.3089                     Pseudo R2         =     0.0126

------------------------------------------------------------------------------
  smoke_stop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0560828   .0390249     1.44   0.151    -.0204047    .1325702
      hsless |  -.0938542   .0411637    -2.28   0.023    -.1745335    -.013175
     college |   .1352311   .0657809     2.06   0.040     .0063028    .2641593
    l2age65l |   .0175504   .0047804     3.67   0.000     .0081811    .0269198
   l2age6574 |  -.0109893   .0074693    -1.47   0.141    -.0256288    .0036503
    l2age75p |   .0186444   .0124104     1.50   0.133    -.0056795    .0429683
    l2hearte |  -.0133794   .0542815    -0.25   0.805    -.1197691    .0930104
    l2stroke |  -.1364151   .1103898    -1.24   0.217    -.3527752    .0799451
    l2cancre |  -.0540036    .081063    -0.67   0.505    -.2128841    .1048769
     l2hibpe |   .0346191   .0415183     0.83   0.404    -.0467552    .1159935
     l2diabe |  -.1763701    .076128    -2.32   0.021    -.3255782   -.0271619
    l2logbmi |   .6412846   .1187209     5.40   0.000     .4085959    .8739732
     l2drink |   .0059204   .0587757     0.10   0.920     -.109278    .1211187
  l2drinkd_e |   .0183211   .0079336     2.31   0.021     .0027715    .0338708
       _cons |  -4.136847   .4924104    -8.40   0.000    -5.101954   -3.171741
------------------------------------------------------------------------------

Computing marginal effects after probit for smoke_stop...


Marginal effects after probit
      y  = Pr(smoke_stop) (predict)
         =  .16138171
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0137735      .00962    1.43   0.152  -.005076  .032623   .432798
  hsless*|  -.0228818      .00999   -2.29   0.022  -.042471 -.003292   .461284
 college*|   .0348967      .01784    1.96   0.051  -.000079  .069872   .089865
l2age65l |   .0042943      .00117    3.68   0.000   .002005  .006583   58.5872
l2a~6574 |  -.0026889      .00183   -1.47   0.141   -.00627  .000892   2.31161
l2age75p |   .0045619      .00304    1.50   0.133  -.001388  .010512   .498269
l2hearte*|  -.0032584      .01316   -0.25   0.804  -.029047   .02253   .147938
l2stroke*|  -.0312869      .02363   -1.32   0.186  -.077603  .015029   .034624
l2cancre*|   -.012904       .0189   -0.68   0.495  -.049955  .024147   .061064
 l2hibpe*|   .0085185      .01027    0.83   0.407  -.011616  .028653   .334907
 l2diabe*|  -.0399784      .01589   -2.52   0.012  -.071119 -.008838   .076645
l2logbmi |   .1569107      .02897    5.42   0.000   .100131   .21369   3.28923
 l2drink*|   .0014455      .01432    0.10   0.920  -.026622  .029513   .863236
l2dr~d_e |   .0044828      .00194    2.31   0.021    .00068  .008286   2.19877
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_smoke_stop_mfx.

-------------------------------------------------------------------------------
Model b_smoke_stop_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
  smoke_stop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0137735   .0096172     1.43   0.152    -.0050759    .0326229
      hsless |  -.0228818   .0099948    -2.29   0.022    -.0424713   -.0032923
     college |   .0348967   .0178449     1.96   0.051    -.0000785     .069872
    l2age65l |   .0042943   .0011679     3.68   0.000     .0020052    .0065833
   l2age6574 |  -.0026889   .0018271    -1.47   0.141      -.00627    .0008923
    l2age75p |   .0045619   .0030359     1.50   0.133    -.0013884    .0105123
    l2hearte |  -.0032584   .0131578    -0.25   0.804    -.0290472    .0225303
    l2stroke |  -.0312869   .0236312    -1.32   0.186    -.0776033    .0150294
    l2cancre |   -.012904   .0189039    -0.68   0.495    -.0499551    .0241471
     l2hibpe |   .0085185   .0102731     0.83   0.407    -.0116163    .0286534
     l2diabe |  -.0399784   .0158884    -2.52   0.012     -.071119   -.0088377
    l2logbmi |   .1569107   .0289697     5.42   0.000     .1001312    .2136902
     l2drink |   .0014455   .0143202     0.10   0.920    -.0266216    .0295126
  l2drinkd_e |   .0044828   .0019405     2.31   0.021     .0006796    .0082861
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/smoke_stop.
> ster saved

Iteration 0:   log likelihood = -17078.139  
Iteration 1:   log likelihood = -15721.028  
Iteration 2:   log likelihood =  -15620.37  
Iteration 3:   log likelihood = -15618.254  
Iteration 4:   log likelihood = -15618.252  

Probit regression                               Number of obs     =     45,503
                                                LR chi2(17)       =    2919.77
                                                Prob > chi2       =     0.0000
Log likelihood = -15618.252                     Pseudo R2         =     0.0855

------------------------------------------------------------------------------
      smoken |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0868607   .0165945     5.23   0.000     .0543362    .1193853
      hsless |    .268866    .017502    15.36   0.000     .2345627    .3031694
     college |  -.3053236   .0262643   -11.63   0.000    -.3568008   -.2538465
    l2age65l |  -.0253903   .0020857   -12.17   0.000    -.0294782   -.0213024
   l2age6574 |  -.0342451   .0029636   -11.56   0.000    -.0400536   -.0284367
    l2age75p |  -.0503237    .004192   -12.00   0.000    -.0585398   -.0421075
    l2hearte |   .0179809   .0226121     0.80   0.427     -.026338    .0622999
    l2stroke |   .1556566   .0444487     3.50   0.000     .0685388    .2427744
    l2cancre |    -.02605   .0319126    -0.82   0.414    -.0885975    .0364976
     l2hibpe |  -.0644609   .0174298    -3.70   0.000    -.0986227   -.0302991
     l2diabe |   .0981682   .0298009     3.29   0.001     .0397594     .156577
     l2lunge |   .4958671   .0308992    16.05   0.000     .4353059    .5564284
    l2logbmi |  -1.116136   .0513425   -21.74   0.000    -1.216765   -1.015506
     l2drink |  -.1277423   .0253469    -5.04   0.000    -.1774212   -.0780633
  l2drinkd_e |  -.0071526   .0035044    -2.04   0.041    -.0140211    -.000284
       atotf |  -1.42e-06   8.28e-08   -17.12   0.000    -1.58e-06   -1.26e-06
      itearn |  -5.94e-06   9.85e-07    -6.03   0.000    -7.87e-06   -4.01e-06
       _cons |   4.313704   .2112842    20.42   0.000     3.899594    4.727813
------------------------------------------------------------------------------
Note: 28 failures and 0 successes completely determined.

Computing marginal effects after probit for smoken...


Marginal effects after probit
      y  = Pr(smoken) (predict)
         =  .10153193
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0155242      .00299    5.20   0.000   .009668   .02138    .43707
  hsless*|   .0501096      .00342   14.65   0.000   .043407  .056812   .359207
 college*|  -.0475264      .00354  -13.44   0.000  -.054457 -.040596   .167264
l2age65l |  -.0045056      .00037  -12.15   0.000  -.005233 -.003779   59.8651
l2a~6574 |   -.006077      .00052  -11.58   0.000  -.007106 -.005048   3.65488
l2age75p |  -.0089302      .00073  -12.15   0.000   -.01037  -.00749   1.29991
l2hearte*|   .0032155      .00407    0.79   0.430  -.004771  .011202   .161989
l2stroke*|   .0302296      .00939    3.22   0.001    .01183  .048629   .033646
l2cancre*|   -.004558       .0055   -0.83   0.408  -.015347  .006231   .076215
 l2hibpe*|  -.0113425      .00304   -3.73   0.000    -.0173 -.005385    .39582
 l2diabe*|   .0183406      .00585    3.14   0.002   .006878  .029803   .083027
 l2lunge*|   .1140035      .00873   13.06   0.000   .096897   .13111   .052238
l2logbmi |  -.1980638      .00905  -21.90   0.000  -.215793 -.180335   3.32144
 l2drink*|  -.0241263      .00508   -4.75   0.000  -.034083  -.01417   .888821
l2dr~d_e |  -.0012693      .00062   -2.04   0.041  -.002488  -.00005   2.40901
   atotf |  -2.52e-07      .00000  -17.65   0.000  -2.8e-07 -2.2e-07   78842.8
  itearn |  -1.05e-06      .00000   -6.02   0.000  -1.4e-06 -7.1e-07   4119.72
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_smoken_mfx.

-------------------------------------------------------------------------------
Model b_smoken_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
      smoken |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0155242   .0029877     5.20   0.000     .0096684    .0213801
      hsless |   .0501096   .0034195    14.65   0.000     .0434075    .0568117
     college |  -.0475264    .003536   -13.44   0.000    -.0544568    -.040596
    l2age65l |  -.0045056    .000371   -12.15   0.000    -.0052327   -.0037785
   l2age6574 |   -.006077    .000525   -11.58   0.000    -.0071059    -.005048
    l2age75p |  -.0089302   .0007347   -12.15   0.000    -.0103702   -.0074901
    l2hearte |   .0032155    .004075     0.79   0.430    -.0047713    .0112024
    l2stroke |   .0302296   .0093877     3.22   0.001       .01183    .0486292
    l2cancre |   -.004558   .0055046    -0.83   0.408    -.0153468    .0062308
     l2hibpe |  -.0113425   .0030396    -3.73   0.000       -.0173    -.005385
     l2diabe |   .0183406   .0058485     3.14   0.002     .0068778    .0298034
     l2lunge |   .1140035   .0087281    13.06   0.000     .0968967    .1311103
    l2logbmi |  -.1980638   .0090454   -21.90   0.000    -.2157925   -.1803351
     l2drink |  -.0241263   .0050799    -4.75   0.000    -.0340827   -.0141698
  l2drinkd_e |  -.0012693    .000622    -2.04   0.041    -.0024885   -.0000501
       atotf |  -2.52e-07   1.43e-08   -17.65   0.000    -2.80e-07   -2.24e-07
      itearn |  -1.05e-06   1.75e-07    -6.02   0.000    -1.40e-06   -7.11e-07
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/smoken.ster
>  saved

Iteration 0:   log likelihood = -30226.885  
Iteration 1:   log likelihood = -29053.662  
Iteration 2:   log likelihood = -29049.343  
Iteration 3:   log likelihood = -29049.343  

Probit regression                               Number of obs     =     45,601
                                                LR chi2(17)       =    2355.08
                                                Prob > chi2       =     0.0000
Log likelihood = -29049.343                     Pseudo R2         =     0.0390

------------------------------------------------------------------------------
      smokev |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .3847164   .0128125    30.03   0.000     .3596044    .4098283
      hsless |   .1515868   .0139653    10.85   0.000     .1242153    .1789583
     college |  -.1824496   .0174029   -10.48   0.000    -.2165587   -.1483406
    l2age65l |   .0085984   .0017301     4.97   0.000     .0052074    .0119894
   l2age6574 |  -.0075933   .0021862    -3.47   0.001    -.0118781   -.0033085
    l2age75p |   .0073555   .0024211     3.04   0.002     .0026102    .0121009
    l2hearte |   .0954931   .0171782     5.56   0.000     .0618244    .1291618
    l2stroke |   .1964907   .0358602     5.48   0.000     .1262061    .2667754
    l2cancre |   .0294105   .0232011     1.27   0.205    -.0160628    .0748837
     l2hibpe |  -.0331553    .013179    -2.52   0.012    -.0589858   -.0073249
     l2diabe |    .122382   .0232468     5.26   0.000     .0768192    .1679448
     l2lunge |   .4426651   .0299902    14.76   0.000     .3838854    .5014448
    l2logbmi |   .0988579   .0390173     2.53   0.011     .0223854    .1753304
     l2drink |   .1081816   .0201385     5.37   0.000     .0687108    .1476524
  l2drinkd_e |   .0506453   .0027113    18.68   0.000     .0453312    .0559594
       atotf |  -2.50e-07   2.97e-08    -8.41   0.000    -3.08e-07   -1.92e-07
      itearn |  -3.32e-06   6.79e-07    -4.89   0.000    -4.65e-06   -1.99e-06
       _cons |  -.9191092   .1653728    -5.56   0.000    -1.243234   -.5949845
------------------------------------------------------------------------------

Computing marginal effects after probit for smokev...


Marginal effects after probit
      y  = Pr(smokev) (predict)
         =  .62820823
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .1435155      .00468   30.65   0.000   .134338  .152693   .436942
  hsless*|   .0568645      .00519   10.96   0.000   .046691  .067038   .359247
 college*|  -.0701586      .00678  -10.34   0.000  -.083451 -.056866   .167343
l2age65l |   .0032516      .00065    4.97   0.000   .001969  .004534   59.8639
l2a~6574 |  -.0028715      .00083   -3.47   0.001  -.004492 -.001251   3.65705
l2age75p |   .0027816      .00092    3.04   0.002   .000987  .004576   1.30284
l2hearte*|   .0357021      .00634    5.63   0.000   .023269  .048135   .162124
l2stroke*|   .0717138      .01255    5.71   0.000   .047113  .096314   .033727
l2cancre*|   .0110754       .0087    1.27   0.203  -.005975  .028126   .076204
 l2hibpe*|  -.0125516      .00499   -2.51   0.012   -.02234 -.002763   .395912
 l2diabe*|   .0454304      .00845    5.37   0.000   .028861  .061999   .083112
 l2lunge*|   .1529351      .00917   16.68   0.000    .13496   .17091   .052323
l2logbmi |    .037384      .01475    2.53   0.011   .008466  .066303   3.32143
 l2drink*|   .0414213       .0078    5.31   0.000   .026141  .056701   .888709
l2dr~d_e |    .019152      .00102   18.69   0.000   .017143  .021161   2.40863
   atotf |  -9.45e-08      .00000   -8.41   0.000  -1.2e-07 -7.2e-08   78873.9
  itearn |  -1.25e-06      .00000   -4.89   0.000  -1.8e-06 -7.5e-07   4121.53
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_smokev_mfx.

-------------------------------------------------------------------------------
Model b_smokev_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
      smokev |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .1435155   .0046826    30.65   0.000     .1343378    .1526932
      hsless |   .0568645   .0051905    10.96   0.000     .0466913    .0670377
     college |  -.0701586   .0067821   -10.34   0.000    -.0834513   -.0568659
    l2age65l |   .0032516   .0006543     4.97   0.000     .0019692    .0045339
   l2age6574 |  -.0028715   .0008267    -3.47   0.001    -.0044919   -.0012511
    l2age75p |   .0027816   .0009156     3.04   0.002     .0009871    .0045761
    l2hearte |   .0357021   .0063435     5.63   0.000      .023269    .0481351
    l2stroke |   .0717138   .0125516     5.71   0.000     .0471132    .0963144
    l2cancre |   .0110754   .0086995     1.27   0.203    -.0059753     .028126
     l2hibpe |  -.0125516   .0049943    -2.51   0.012    -.0223402   -.0027629
     l2diabe |   .0454304   .0084537     5.37   0.000     .0288614    .0619995
     l2lunge |   .1529351   .0091709    16.68   0.000     .1349603    .1709098
    l2logbmi |    .037384   .0147546     2.53   0.011     .0084655    .0663026
     l2drink |   .0414213   .0077961     5.31   0.000     .0261413    .0567013
  l2drinkd_e |    .019152   .0010248    18.69   0.000     .0171434    .0211606
       atotf |  -9.45e-08   1.12e-08    -8.41   0.000    -1.17e-07   -7.25e-08
      itearn |  -1.25e-06   2.57e-07    -4.89   0.000    -1.76e-06   -7.51e-07
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/smokev.ster
>  saved

Iteration 0:   log likelihood = -29415.705  
Iteration 1:   log likelihood = -11565.485  
Iteration 2:   log likelihood = -10978.751  
Iteration 3:   log likelihood =  -10947.62  
Iteration 4:   log likelihood = -10946.916  
Iteration 5:   log likelihood = -10946.913  
Iteration 6:   log likelihood = -10946.913  

Probit regression                               Number of obs     =     46,364
                                                LR chi2(25)       =   36937.58
                                                Prob > chi2       =     0.0000
Log likelihood = -10946.913                     Pseudo R2         =     0.6279

------------------------------------------------------------------------------
        work |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .1902212   .0198898     9.56   0.000     .1512378    .2292046
      hsless |  -.0688552   .0222079    -3.10   0.002    -.1123819   -.0253285
     college |   .0576268   .0250579     2.30   0.021     .0085141    .1067394
    l2age65l |  -.0837545   .0024785   -33.79   0.000    -.0886122   -.0788968
   l2age6574 |  -.0410156   .0042317    -9.69   0.000    -.0493097   -.0327215
    l2age75p |  -.0376433   .0086596    -4.35   0.000    -.0546159   -.0206707
    l2hearte |  -.0908617   .0297435    -3.05   0.002    -.1491579   -.0325655
    l2stroke |  -.1504341   .0800828    -1.88   0.060    -.3073934    .0065252
    l2cancre |  -.0003201   .0398606    -0.01   0.994    -.0784454    .0778053
     l2hibpe |  -.0255187   .0208793    -1.22   0.222    -.0664413    .0154038
     l2diabe |  -.1268841   .0407495    -3.11   0.002    -.2067515   -.0470166
     l2lunge |   -.147329   .0532454    -2.77   0.006    -.2516881     -.04297
    l2logbmi |   .0091912   .0612065     0.15   0.881    -.1107714    .1291537
      l2work |   2.273541   .0211962   107.26   0.000     2.231997    2.315085
      l2adl1 |  -.0885333   .0413754    -2.14   0.032    -.1696277    -.007439
      l2adl2 |  -.1975772   .0731385    -2.70   0.007     -.340926   -.0542283
     l2adl3p |  -.3948244   .0893841    -4.42   0.000     -.570014   -.2196348
     l2iadl1 |  -.1981914   .0413232    -4.80   0.000    -.2791834   -.1171995
    l2iadl2p |  -.3265539   .0671996    -4.86   0.000    -.4582627   -.1948452
    l2psyche |  -.0989124   .0328746    -3.01   0.003    -.1633455   -.0344793
    l2arthre |  -.0585992   .0223379    -2.62   0.009    -.1023807   -.0148178
   l2asthmae |  -.0241439    .029769    -0.81   0.417    -.0824901    .0342022
   l2parkine |  -.1534107   .2092948    -0.73   0.464     -.563621    .2567997
     l2drink |    .081939   .0366353     2.24   0.025     .0101352    .1537428
  l2drinkd_e |  -.0000566   .0041508    -0.01   0.989     -.008192    .0080788
       _cons |   3.385794   .2517354    13.45   0.000     2.892402    3.879187
------------------------------------------------------------------------------

Computing marginal effects after probit for work...


Marginal effects after probit
      y  = Pr(work) (predict)
         =  .17280068
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0491872      .00518    9.49   0.000   .039026  .059348   .436287
  hsless*|  -.0174444      .00557   -3.13   0.002  -.028368  -.00652   .358187
 college*|   .0150013      .00664    2.26   0.024   .001986  .028016    .16763
l2age65l |  -.0214169      .00069  -30.90   0.000  -.022775 -.020059   59.8581
l2a~6574 |  -.0104881      .00107   -9.76   0.000  -.012594 -.008383   3.64302
l2age75p |  -.0096258      .00217   -4.43   0.000  -.013881  -.00537   1.30685
l2hearte*|  -.0225603      .00716   -3.15   0.002  -.036588 -.008532   .162173
l2stroke*|  -.0359173      .01774   -2.02   0.043   -.07069 -.001144    .03369
l2cancre*|  -.0000818      .01019   -0.01   0.994  -.020054  .019891   .075878
 l2hibpe*|  -.0065088      .00531   -1.23   0.220   -.01692  .003902   .394617
 l2diabe*|  -.0308223      .00937   -3.29   0.001  -.049185  -.01246   .082866
 l2lunge*|  -.0353236      .01191   -2.97   0.003  -.058664 -.011983   .052045
l2logbmi |   .0023503      .01565    0.15   0.881  -.028325  .033026   3.32136
  l2work*|   .6430668      .00574  111.96   0.000   .631809  .654324    .38174
  l2adl1*|  -.0218622      .00985   -2.22   0.027  -.041176 -.002549   .089984
  l2adl2*|  -.0461565      .01548   -2.98   0.003  -.076488 -.015825   .036839
 l2adl3p*|  -.0838039      .01518   -5.52   0.000  -.113564 -.054043   .039664
 l2iadl1*|  -.0468465      .00897   -5.22   0.000  -.064429 -.029264   .096001
l2iadl2p*|  -.0726607      .01271   -5.72   0.000  -.097574 -.047747   .076999
l2psyche*|  -.0243266      .00777   -3.13   0.002  -.039561 -.009092   .091342
l2arthre*|  -.0148541      .00561   -2.65   0.008  -.025855 -.003854   .342938
l2asth~e*|   -.006121      .00748   -0.82   0.413  -.020786  .008544   .124277
l2park~e*|  -.0364123      .04584   -0.79   0.427  -.126256  .053431   .004788
 l2drink*|   .0203225       .0088    2.31   0.021   .003073  .037572   .888426
l2dr~d_e |  -.0000145      .00106   -0.01   0.989  -.002095  .002066   2.41129
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_work_mfx.

-------------------------------------------------------------------------------
Model b_work_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
        work |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0491872   .0051844     9.49   0.000      .039026    .0593484
      hsless |  -.0174444   .0055735    -3.13   0.002    -.0283684   -.0065205
     college |   .0150013   .0066404     2.26   0.024     .0019863    .0280164
    l2age65l |  -.0214169    .000693   -30.90   0.000    -.0227752   -.0200586
   l2age6574 |  -.0104881   .0010743    -9.76   0.000    -.0125936   -.0083826
    l2age75p |  -.0096258   .0021712    -4.43   0.000    -.0138813   -.0053702
    l2hearte |  -.0225603   .0071572    -3.15   0.002     -.036588   -.0085325
    l2stroke |  -.0359173   .0177418    -2.02   0.043    -.0706905   -.0011441
    l2cancre |  -.0000818   .0101902    -0.01   0.994    -.0200542    .0198905
     l2hibpe |  -.0065088   .0053119    -1.23   0.220    -.0169199    .0039022
     l2diabe |  -.0308223   .0093687    -3.29   0.001    -.0491847     -.01246
     l2lunge |  -.0353236   .0119085    -2.97   0.003    -.0586639   -.0119833
    l2logbmi |   .0023503   .0156511     0.15   0.881    -.0283252    .0330258
      l2work |   .6430668   .0057438   111.96   0.000     .6318092    .6543244
      l2adl1 |  -.0218622    .009854    -2.22   0.027    -.0411757   -.0025487
      l2adl2 |  -.0461565   .0154754    -2.98   0.003    -.0764877   -.0158253
     l2adl3p |  -.0838039   .0151842    -5.52   0.000    -.1135643   -.0540434
     l2iadl1 |  -.0468465   .0089707    -5.22   0.000    -.0644288   -.0292642
    l2iadl2p |  -.0726607   .0127112    -5.72   0.000    -.0975742   -.0477472
    l2psyche |  -.0243266    .007773    -3.13   0.002    -.0395614   -.0090919
    l2arthre |  -.0148541   .0056126    -2.65   0.008    -.0258547   -.0038535
   l2asthmae |   -.006121   .0074821    -0.82   0.413    -.0207856    .0085436
   l2parkine |  -.0364123   .0458393    -0.79   0.427    -.1262556    .0534309
     l2drink |   .0203225   .0088009     2.31   0.021      .003073    .0375719
  l2drinkd_e |  -.0000145   .0010614    -0.01   0.989    -.0020948    .0020658
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/work.ster s
> aved

Iteration 0:   log likelihood = -27184.435  
Iteration 1:   log likelihood = -19332.387  
Iteration 2:   log likelihood = -19247.268  
Iteration 3:   log likelihood = -19247.144  
Iteration 4:   log likelihood = -19247.144  

Probit regression                               Number of obs     =     44,517
                                                LR chi2(26)       =   15874.58
                                                Prob > chi2       =     0.0000
Log likelihood = -19247.144                     Pseudo R2         =     0.2920

------------------------------------------------------------------------------
      hlthlm |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .1347491   .0155634     8.66   0.000     .1042454    .1652529
      hsless |   .0496555   .0163493     3.04   0.002     .0176114    .0816996
     college |  -.1536457   .0218154    -7.04   0.000     -.196403   -.1108884
    l2age65l |    .000821   .0021296     0.39   0.700    -.0033529     .004995
   l2age6574 |   .0201646   .0025514     7.90   0.000     .0151639    .0251652
    l2age75p |  -.0021839   .0028566    -0.76   0.445    -.0077828     .003415
      hearte |   .3105929    .018201    17.06   0.000     .2749197    .3462662
      stroke |   .3831715   .0362818    10.56   0.000     .3120605    .4542826
      cancre |   .2045444     .02405     8.50   0.000     .1574074    .2516814
       hibpe |   .1302399   .0153034     8.51   0.000     .1002458    .1602339
       diabe |   .1942387   .0241523     8.04   0.000      .146901    .2415764
       lunge |   .5439297   .0301087    18.07   0.000     .4849176    .6029417
      logbmi |    .362316   .0462289     7.84   0.000      .271709    .4529229
        adl1 |   .5362433    .024156    22.20   0.000     .4888984    .5835881
        adl2 |    .771656   .0403606    19.12   0.000     .6925506    .8507614
       adl3p |   1.002392   .0508543    19.71   0.000     .9027192    1.102065
       iadl1 |   .7970235   .0232985    34.21   0.000     .7513592    .8426878
      iadl2p |   1.141312   .0337093    33.86   0.000     1.075243    1.207381
      smokev |   .1037941   .0162455     6.39   0.000     .0719535    .1356347
      smoken |   .1975023   .0233962     8.44   0.000     .1516466     .243358
      arthre |   .4396251   .0154253    28.50   0.000     .4093921    .4698581
      psyche |   .3990204   .0234119    17.04   0.000     .3531339     .444907
     asthmae |   .1681549    .021346     7.88   0.000     .1263175    .2099923
     parkine |   1.088442   .1071938    10.15   0.000     .8783463    1.298538
       drink |  -.1541299   .0233027    -6.61   0.000    -.1998024   -.1084575
    drinkd_e |  -.0319478   .0033189    -9.63   0.000    -.0384526   -.0254429
       _cons |   -2.59437   .1999836   -12.97   0.000    -2.986331    -2.20241
------------------------------------------------------------------------------

Computing marginal effects after probit for hlthlm...


Marginal effects after probit
      y  = Pr(hlthlm) (predict)
         =  .26931745
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0447067      .00518    8.62   0.000   .034546  .054867   .437249
  hsless*|   .0164717      .00545    3.02   0.002   .005795  .027148   .349237
 college*|  -.0490997      .00672   -7.30   0.000  -.062279 -.035921   .171867
l2age65l |   .0002711       .0007    0.39   0.700  -.001107  .001649   59.7958
l2a~6574 |   .0066589      .00084    7.91   0.000   .005009  .008309   3.51911
l2age75p |  -.0007212      .00094   -0.76   0.445   -.00257  .001128   1.18162
  hearte*|   .1080361      .00661   16.34   0.000   .095081  .120992   .187951
  stroke*|   .1381674      .01396    9.90   0.000   .110808  .165527   .039715
  cancre*|   .0707597      .00866    8.17   0.000   .053778  .087741   .092931
   hibpe*|   .0432285       .0051    8.48   0.000   .033233  .053224   .430218
   diabe*|   .0670206      .00866    7.73   0.000   .050038  .084004   .097581
   lunge*|   .2000515      .01182   16.92   0.000   .176877  .223226   .061213
  logbmi |   .1196463      .01526    7.84   0.000   .089734  .149558    3.3226
    adl1*|   .1958519      .00939   20.85   0.000   .177438  .214265   .090954
    adl2*|   .2909421      .01588   18.32   0.000   .259812  .322073   .038817
   adl3p*|   .3795568      .01904   19.94   0.000   .342248  .416865   .041153
   iadl1*|   .2971319      .00905   32.84   0.000   .279396  .314868   .100097
  iadl2p*|   .4280424      .01213   35.28   0.000   .404263  .451822   .083092
  smokev*|   .0340011      .00527    6.45   0.000   .023663   .04434   .620482
  smoken*|   .0680113      .00836    8.14   0.000   .051629  .084393   .122627
  arthre*|   .1489848       .0053   28.09   0.000   .138591  .159378   .378552
  psyche*|   .1427225      .00888   16.08   0.000   .125326  .160119   .101602
 asthmae*|   .0575294      .00754    7.63   0.000   .042751  .072308   .131253
 parkine*|   .4125939      .03833   10.76   0.000   .337464  .487724   .006088
   drink*|  -.0526292      .00821   -6.41   0.000  -.068712 -.036546   .878092
drinkd_e |    -.01055       .0011   -9.63   0.000  -.012696 -.008404   2.38145
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_hlthlm_mfx.

-------------------------------------------------------------------------------
Model b_hlthlm_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
      hlthlm |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0447067   .0051841     8.62   0.000     .0345461    .0548673
      hsless |   .0164717   .0054472     3.02   0.002     .0057953     .027148
     college |  -.0490997    .006724    -7.30   0.000    -.0622785    -.035921
    l2age65l |   .0002711   .0007032     0.39   0.700    -.0011072    .0016494
   l2age6574 |   .0066589    .000842     7.91   0.000     .0050085    .0083092
    l2age75p |  -.0007212   .0009434    -0.76   0.445    -.0025702    .0011278
      hearte |   .1080361     .00661    16.34   0.000     .0950807    .1209916
      stroke |   .1381674   .0139591     9.90   0.000     .1108081    .1655268
      cancre |   .0707597    .008664     8.17   0.000     .0537785    .0877409
       hibpe |   .0432285   .0050997     8.48   0.000     .0332334    .0532237
       diabe |   .0670206   .0086649     7.73   0.000     .0500377    .0840035
       lunge |   .2000515   .0118237    16.92   0.000     .1768775    .2232256
      logbmi |   .1196463   .0152615     7.84   0.000     .0897344    .1495583
        adl1 |   .1958519   .0093948    20.85   0.000     .1774385    .2142653
        adl2 |   .2909421   .0158832    18.32   0.000     .2598116    .3220727
       adl3p |   .3795568   .0190354    19.94   0.000     .3422482    .4168654
       iadl1 |   .2971319    .009049    32.84   0.000     .2793962    .3148676
      iadl2p |   .4280424   .0121328    35.28   0.000     .4042625    .4518222
      smokev |   .0340011   .0052748     6.45   0.000     .0236626    .0443396
      smoken |   .0680113   .0083584     8.14   0.000     .0516291    .0843935
      arthre |   .1489848   .0053029    28.09   0.000     .1385913    .1593783
      psyche |   .1427225    .008876    16.08   0.000     .1253259    .1601191
     asthmae |   .0575294   .0075401     7.63   0.000     .0427511    .0723076
     parkine |   .4125939   .0383324    10.76   0.000     .3374638    .4877241
       drink |  -.0526292   .0082057    -6.41   0.000    -.0687121   -.0365463
    drinkd_e |    -.01055   .0010951    -9.63   0.000    -.0126963   -.0084037
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/hlthlm.ster
>  saved

Iteration 0:   log likelihood =  -28243.91  
Iteration 1:   log likelihood = -15043.077  
Iteration 2:   log likelihood = -14742.507  
Iteration 3:   log likelihood = -14740.563  
Iteration 4:   log likelihood = -14740.563  

Probit regression                               Number of obs     =     41,634
                                                LR chi2(24)       =   27006.69
                                                Prob > chi2       =     0.0000
Log likelihood = -14740.563                     Pseudo R2         =     0.4781

------------------------------------------------------------------------------
      retemp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |    .157862   .0173654     9.09   0.000     .1238265    .1918974
      hsless |  -.1359944    .018662    -7.29   0.000    -.1725713   -.0994176
     college |   .1500562   .0237854     6.31   0.000     .1034377    .1966748
    l2age65l |   .1936083   .0033192    58.33   0.000     .1871028    .2001138
   l2age6574 |   .0377268   .0031012    12.17   0.000     .0316485    .0438051
    l2age75p |  -.0010293   .0032284    -0.32   0.750    -.0073569    .0052983
    l2hearte |   .0364249   .0228694     1.59   0.111    -.0083982     .081248
    l2stroke |  -.0049789   .0438867    -0.11   0.910    -.0909953    .0810374
    l2cancre |   .0476857   .0304796     1.56   0.118    -.0120531    .1074246
     l2hibpe |   -.039745   .0176387    -2.25   0.024    -.0743162   -.0051738
     l2diabe |  -.0194506   .0290975    -0.67   0.504    -.0764806    .0375794
     l2lunge |  -.0261774   .0358655    -0.73   0.465    -.0964724    .0441177
    l2logbmi |   .0423046   .0524059     0.81   0.420     -.060409    .1450182
      l2work |  -1.386814   .0201952   -68.67   0.000    -1.426396   -1.347232
      l2adl1 |  -.0636813   .0306382    -2.08   0.038     -.123731   -.0036316
      l2adl2 |  -.0604938   .0454227    -1.33   0.183    -.1495206     .028533
     l2adl3p |  -.3568696   .0455694    -7.83   0.000     -.446184   -.2675552
     l2iadl1 |  -.1064411   .0304895    -3.49   0.000    -.1661994   -.0466828
    l2iadl2p |  -.3677056   .0366762   -10.03   0.000    -.4395895   -.2958216
    l2psyche |  -.0395937   .0271731    -1.46   0.145     -.092852    .0136646
    l2arthre |   .0075714   .0187061     0.40   0.686    -.0290918    .0442346
   l2asthmae |  -.0247285   .0247307    -1.00   0.317    -.0731998    .0237428
   l2parkine |  -.1558043   .1038963    -1.50   0.134    -.3594372    .0478286
    l2hlthlm |  -.0520339   .0224731    -2.32   0.021    -.0960804   -.0079873
       _cons |   -11.1304   .2649955   -42.00   0.000    -11.64978   -10.61102
------------------------------------------------------------------------------
Note: 8 failures and 0 successes completely determined.

Computing marginal effects after probit for retemp...


Marginal effects after probit
      y  = Pr(retemp) (predict)
         =  .58406369
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0613821      .00672    9.13   0.000   .048211  .074554   .437527
  hsless*|   -.053214      .00732   -7.27   0.000  -.067555 -.038873   .357592
 college*|   .0577962      .00903    6.40   0.000   .040099  .075493   .169981
l2age65l |   .0755174      .00135   55.91   0.000    .07287  .078164    60.071
l2a~6574 |   .0147154       .0012   12.23   0.000   .012357  .017074   3.78847
l2age75p |  -.0004015      .00126   -0.32   0.750   -.00287  .002067   1.46476
l2hearte*|   .0141694      .00887    1.60   0.110  -.003217  .031556     .1683
l2stroke*|   -.001943      .01713   -0.11   0.910  -.035526   .03164   .037662
l2cancre*|   .0185159      .01178    1.57   0.116  -.004568  .041599    .08116
 l2hibpe*|  -.0155136      .00689   -2.25   0.024  -.029017  -.00201   .408176
 l2diabe*|  -.0075992      .01139   -0.67   0.505  -.029916  .014718   .090863
 l2lunge*|  -.0102349      .01405   -0.73   0.466  -.037782  .017312   .054571
l2logbmi |    .016501      .02044    0.81   0.420  -.023563  .056565   3.32398
  l2work*|  -.5115992      .00637  -80.30   0.000  -.524086 -.499112   .375703
  l2adl1*|  -.0249642      .01206   -2.07   0.039  -.048611 -.001318   .091224
  l2adl2*|  -.0237232       .0179   -1.33   0.185  -.058806  .011359   .038718
 l2adl3p*|  -.1414548      .01801   -7.85   0.000  -.176761 -.106148   .040568
 l2iadl1*|   -.041839      .01206   -3.47   0.001  -.065475 -.018203   .097901
l2iadl2p*|  -.1456147      .01449  -10.05   0.000  -.174016 -.117213   .084859
l2psyche*|   -.015493      .01066   -1.45   0.146  -.036395  .005409   .097228
l2arthre*|   .0029525      .00729    0.40   0.686  -.011341  .017246   .355575
l2asth~e*|  -.0096636      .00968   -1.00   0.318   -.02864  .009313   .128429
l2park~e*|  -.0615302      .04138   -1.49   0.137  -.142625  .019565    .00526
l2hlthlm*|   -.020338       .0088   -2.31   0.021  -.037585 -.003091   .297713
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as b_retemp_mfx.

-------------------------------------------------------------------------------
Model b_retemp_mfx (Marginal effects after probit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
      retemp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0613821   .0067203     9.13   0.000     .0482105    .0745536
      hsless |   -.053214    .007317    -7.27   0.000    -.0675551   -.0388729
     college |   .0577962   .0090292     6.40   0.000     .0400993     .075493
    l2age65l |   .0755174   .0013506    55.91   0.000     .0728702    .0781645
   l2age6574 |   .0147154   .0012033    12.23   0.000      .012357    .0170738
    l2age75p |  -.0004015   .0012592    -0.32   0.750    -.0028695    .0020666
    l2hearte |   .0141694   .0088707     1.60   0.110    -.0032168    .0315557
    l2stroke |   -.001943   .0171347    -0.11   0.910    -.0355263    .0316404
    l2cancre |   .0185159   .0117776     1.57   0.116    -.0045677    .0415995
     l2hibpe |  -.0155136   .0068895    -2.25   0.024    -.0290168   -.0020103
     l2diabe |  -.0075992   .0113864    -0.67   0.505    -.0299162    .0147177
     l2lunge |  -.0102349   .0140547    -0.73   0.466    -.0377816    .0173119
    l2logbmi |    .016501    .020441     0.81   0.420    -.0235626    .0565646
      l2work |  -.5115992   .0063711   -80.30   0.000    -.5240863   -.4991121
      l2adl1 |  -.0249642   .0120648    -2.07   0.039    -.0486106   -.0013177
      l2adl2 |  -.0237232   .0178995    -1.33   0.185    -.0588055    .0113591
     l2adl3p |  -.1414548   .0180139    -7.85   0.000    -.1767615   -.1061482
     l2iadl1 |   -.041839   .0120595    -3.47   0.001    -.0654753   -.0182028
    l2iadl2p |  -.1456147   .0144908   -10.05   0.000    -.1740162   -.1172131
    l2psyche |   -.015493   .0106645    -1.45   0.146    -.0363951     .005409
    l2arthre |   .0029525   .0072929     0.40   0.686    -.0113413    .0172464
   l2asthmae |  -.0096636   .0096821    -1.00   0.318    -.0286402     .009313
   l2parkine |  -.0615302   .0413759    -1.49   0.137    -.1426255    .0195651
    l2hlthlm |   -.020338   .0087998    -2.31   0.021    -.0375854   -.0030906
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/retemp.ster
>  saved

. 
. /*********************************************************************/
. * ESTIMATE OLS
. /*********************************************************************/
. 
. foreach n in $ols {
  2.         local x = "allvars_`n'"
  3.         reg `n' $`x' if `select_`n''
  4.         mfx2, stub(ols_`n') se
  5.   est save "`ster'/`n'.ster", replace
  6.   est restore ols_`n'_mfx
  7.   est store ols_`n'_mfx
  8. }

      Source |       SS           df       MS      Number of obs   =    44,411
-------------+----------------------------------   F(27, 44383)    =  39018.49
       Model |   1159.1119        27  42.9300703   Prob > F        =    0.0000
    Residual |   48.832369    44,383  .001100249   R-squared       =    0.9596
-------------+----------------------------------   Adj R-squared   =    0.9595
       Total |  1207.94427    44,410  .027199826   Root MSE        =    .03317

------------------------------------------------------------------------------
      logbmi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0008141   .0003357     2.43   0.015     .0001561     .001472
      hsless |   .0007799   .0003632     2.15   0.032      .000068    .0014918
     college |  -.0014047    .000449    -3.13   0.002    -.0022847   -.0005247
    l2age65l |  -.0000517   .0000441    -1.17   0.241     -.000138    .0000347
   l2age6574 |  -.0002674   .0000567    -4.71   0.000    -.0003786   -.0001562
    l2age75p |  -.0005549    .000066    -8.41   0.000    -.0006843   -.0004256
    l2cancre |   .0003854   .0006011     0.64   0.521    -.0007927    .0015636
     l2diabe |   -.002812    .000599    -4.69   0.000    -.0039861   -.0016379
    l2hearte |  -.0006032   .0004459    -1.35   0.176    -.0014772    .0002708
     l2hibpe |   .0003318   .0003427     0.97   0.333    -.0003399    .0010036
     l2lunge |  -.0003299   .0007402    -0.45   0.656    -.0017808     .001121
    l2stroke |   .0009672   .0009211     1.05   0.294    -.0008381    .0027725
      l2adl1 |   .0003409   .0006019     0.57   0.571    -.0008388    .0015206
      l2adl2 |  -.0014089   .0009339    -1.51   0.131    -.0032393    .0004216
     l2adl3p |   .0024965    .001021     2.45   0.014     .0004953    .0044977
     l2iadl1 |   .0002114   .0005902     0.36   0.720    -.0009455    .0013682
    l2iadl2p |  -.0020627   .0007997    -2.58   0.010    -.0036302   -.0004953
    l2logbmi |   .9974616   .0010342   964.51   0.000     .9954346    .9994885
    l2smokev |   .0004009    .000351     1.14   0.253    -.0002869    .0010888
    l2smoken |  -.0009594   .0005027    -1.91   0.056    -.0019447     .000026
    l2psyche |  -.0000707   .0005568    -0.13   0.899    -.0011621    .0010207
    l2arthre |   .0002841   .0003633     0.78   0.434     -.000428    .0009962
   l2asthmae |  -.0012539   .0004869    -2.58   0.010    -.0022081   -.0002996
   l2parkine |  -.0005638   .0023984    -0.24   0.814    -.0052646     .004137
       drink |   .0014847   .0005261     2.82   0.005     .0004535     .002516
    drinkd_e |    .000124    .000072     1.72   0.085    -.0000171    .0002651
 l2modex_reg |   .0004204   .0004324     0.97   0.331     -.000427    .0012679
       _cons |   .0120031   .0043796     2.74   0.006     .0034191    .0205871
------------------------------------------------------------------------------

Computing marginal effects after regress for logbmi...


Marginal effects after regress
      y  = Fitted values (predict)
         =  3.3226683
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0008141      .00034    2.43   0.015   .000156  .001472   .436739
  hsless*|   .0007799      .00036    2.15   0.032   .000068  .001492   .349508
 college*|  -.0014047      .00045   -3.13   0.002  -.002285 -.000525   .171737
l2age65l |  -.0000517      .00004   -1.17   0.241  -.000138  .000035    59.808
l2a~6574 |  -.0002674      .00006   -4.71   0.000  -.000379 -.000156   3.52566
l2age75p |  -.0005549      .00007   -8.41   0.000  -.000684 -.000426   1.18585
l2cancre*|   .0003854       .0006    0.64   0.521  -.000793  .001564   .075567
 l2diabe*|   -.002812       .0006   -4.69   0.000  -.003986 -.001638   .081219
l2hearte*|  -.0006032      .00045   -1.35   0.176  -.001477  .000271   .157911
 l2hibpe*|   .0003318      .00034    0.97   0.333   -.00034  .001004    .39193
 l2lunge*|  -.0003299      .00074   -0.45   0.656  -.001781  .001121   .051001
l2stroke*|   .0009672      .00092    1.05   0.294  -.000838  .002772   .031636
  l2adl1*|   .0003409       .0006    0.57   0.571  -.000839  .001521   .087636
  l2adl2*|  -.0014089      .00093   -1.51   0.131  -.003239  .000422   .035599
 l2adl3p*|   .0024965      .00102    2.45   0.014   .000495  .004498   .036883
 l2iadl1*|   .0002114      .00059    0.36   0.720  -.000945  .001368   .093963
l2iadl2p*|  -.0020627       .0008   -2.58   0.010   -.00363 -.000495   .071424
l2logbmi |   .9974616      .00103  964.51   0.000   .995435  .999488   3.32163
l2smokev*|   .0004009      .00035    1.14   0.253  -.000287  .001089   .612168
l2smoken*|  -.0009594       .0005   -1.91   0.056  -.001945  .000026   .135777
l2psyche*|  -.0000707      .00056   -0.13   0.899  -.001162  .001021   .091576
l2arthre*|   .0002841      .00036    0.78   0.434  -.000428  .000996   .339916
l2asth~e*|  -.0012539      .00049   -2.58   0.010  -.002208   -.0003   .123956
l2park~e*|  -.0005638       .0024   -0.24   0.814  -.005265  .004137   .004391
   drink*|   .0014847      .00053    2.82   0.005   .000454  .002516   .878026
drinkd_e |    .000124      .00007    1.72   0.085  -.000017  .000265   2.38018
l2mode~g*|   .0004204      .00043    0.97   0.331  -.000427  .001268   .791313
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as ols_logbmi_mfx.

-------------------------------------------------------------------------------
Model ols_logbmi_mfx (Marginal effects after regress)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
      logbmi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0008141   .0003357     2.43   0.015     .0001561     .001472
      hsless |   .0007799   .0003632     2.15   0.032      .000068    .0014918
     college |  -.0014047    .000449    -3.13   0.002    -.0022847   -.0005247
    l2age65l |  -.0000517   .0000441    -1.17   0.241     -.000138    .0000347
   l2age6574 |  -.0002674   .0000567    -4.71   0.000    -.0003786   -.0001562
    l2age75p |  -.0005549    .000066    -8.41   0.000    -.0006843   -.0004256
    l2cancre |   .0003854   .0006011     0.64   0.521    -.0007927    .0015636
     l2diabe |   -.002812    .000599    -4.69   0.000    -.0039861   -.0016379
    l2hearte |  -.0006032   .0004459    -1.35   0.176    -.0014772    .0002708
     l2hibpe |   .0003318   .0003427     0.97   0.333    -.0003399    .0010036
     l2lunge |  -.0003299   .0007402    -0.45   0.656    -.0017808     .001121
    l2stroke |   .0009672   .0009211     1.05   0.294    -.0008381    .0027725
      l2adl1 |   .0003409   .0006019     0.57   0.571    -.0008388    .0015206
      l2adl2 |  -.0014089   .0009339    -1.51   0.131    -.0032393    .0004216
     l2adl3p |   .0024965    .001021     2.45   0.014     .0004953    .0044977
     l2iadl1 |   .0002114   .0005902     0.36   0.720    -.0009455    .0013682
    l2iadl2p |  -.0020627   .0007997    -2.58   0.010    -.0036302   -.0004953
    l2logbmi |   .9974616   .0010342   964.51   0.000     .9954346    .9994885
    l2smokev |   .0004009    .000351     1.14   0.253    -.0002869    .0010888
    l2smoken |  -.0009594   .0005027    -1.91   0.056    -.0019447     .000026
    l2psyche |  -.0000707   .0005568    -0.13   0.899    -.0011621    .0010207
    l2arthre |   .0002841   .0003633     0.78   0.434     -.000428    .0009962
   l2asthmae |  -.0012539   .0004869    -2.58   0.010    -.0022081   -.0002996
   l2parkine |  -.0005638   .0023984    -0.24   0.814    -.0052646     .004137
       drink |   .0014847   .0005261     2.82   0.005     .0004535     .002516
    drinkd_e |    .000124    .000072     1.72   0.085    -.0000171    .0002651
 l2modex_reg |   .0004204   .0004324     0.97   0.331     -.000427    .0012679
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/logbmi.ster
>  saved
(results ols_logbmi_mfx are active now)

      Source |       SS           df       MS      Number of obs   =    28,643
-------------+----------------------------------   F(26, 28616)    =    179.81
       Model |  203256.919        26  7817.57381   Prob > F        =    0.0000
    Residual |  1244153.48    28,616  43.4775467   R-squared       =    0.1404
-------------+----------------------------------   Adj R-squared   =    0.1396
       Total |   1447410.4    28,642  50.5345435   Root MSE        =    6.5938

------------------------------------------------------------------------------
      retage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   2.504194   .0831269    30.12   0.000     2.341262    2.667127
      hsless |  -.3139249   .0869796    -3.61   0.000    -.4844091   -.1434407
     college |  -.3439187   .1176957    -2.92   0.003    -.5746077   -.1132297
    l2age65l |   .8150242   .0257654    31.63   0.000     .7645228    .8655256
   l2age6574 |   .1874643   .0135765    13.81   0.000     .1608538    .2140748
    l2age75p |   .1209817   .0123736     9.78   0.000     .0967289    .1452345
    l2cancre |   .0074983   .1327438     0.06   0.955    -.2526858    .2676824
     l2diabe |  -.0170664   .1327481    -0.13   0.898     -.277259    .2431261
    l2hearte |  -.5433439   .1004887    -5.41   0.000    -.7403065   -.3463812
     l2hibpe |  -.1187921   .0821083    -1.45   0.148    -.2797282     .042144
     l2lunge |  -.0202503    .164574    -0.12   0.902    -.3428232    .3023225
    l2stroke |   .4700545   .1845127     2.55   0.011      .108401     .831708
      l2adl1 |  -.0524069   .1340355    -0.39   0.696    -.3151227     .210309
      l2adl2 |  -.1409607   .2011203    -0.70   0.483     -.535166    .2532446
     l2adl3p |  -.2551161   .2308196    -1.11   0.269    -.7075334    .1973011
     l2iadl1 |  -.5383919   .1331011    -4.04   0.000    -.7992763   -.2775075
    l2iadl2p |  -.8412468   .1713884    -4.91   0.000    -1.177176   -.5053174
    l2logbmi |   1.261164   .2576693     4.89   0.000       .75612    1.766208
    l2smokev |   .1467863    .086097     1.70   0.088    -.0219679    .3155406
    l2smoken |   .1300367    .133052     0.98   0.328    -.1307515    .3908249
      l2work |   4.166806   .1299464    32.07   0.000     3.912105    4.421507
      hlthlm |  -.5716394   .0934014    -6.12   0.000    -.7547105   -.3885684
    l2arthre |  -.3687215   .0866331    -4.26   0.000    -.5385265   -.1989165
    l2psyche |  -.5851057   .1445996    -4.05   0.000    -.8685277   -.3016838
   l2asthmae |  -.0864997   .1195037    -0.72   0.469    -.3207327    .1477332
   l2parkine |   1.706614   .5006909     3.41   0.001      .725236    2.687991
       _cons |   2.000753   1.798849     1.11   0.266    -1.525076    5.526582
------------------------------------------------------------------------------

Computing marginal effects after regress for retage...


Marginal effects after regress
      y  = Fitted values (predict)
         =  59.130608
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   2.504194      .08313   30.12   0.000   2.34127  2.66712   .450407
  hsless*|  -.3139249      .08698   -3.61   0.000  -.484402 -.143448   .408058
 college*|  -.3439187       .1177   -2.92   0.003  -.574598 -.113239   .149775
l2age65l |   .8150242      .02577   31.63   0.000   .764525  .865523   62.2998
l2a~6574 |   .1874643      .01358   13.81   0.000   .160855  .214074   5.69197
l2age75p |   .1209817      .01237    9.78   0.000    .09673  .145233   2.16067
l2cancre*|   .0074983      .13274    0.06   0.955  -.252675  .267671   .096428
 l2diabe*|  -.0170664      .13275   -0.13   0.898  -.277248  .243115   .102398
l2hearte*|  -.5433439      .10049   -5.41   0.000  -.740298  -.34639   .201829
 l2hibpe*|  -.1187921      .08211   -1.45   0.148  -.279721  .042137   .454107
 l2lunge*|  -.0202503      .16457   -0.12   0.902   -.34281  .302309   .064588
l2stroke*|   .4700545      .18451    2.55   0.011   .108416  .831693   .049297
  l2adl1*|  -.0524069      .13404   -0.39   0.696  -.315112  .210298   .111965
  l2adl2*|  -.1409607      .20112   -0.70   0.483  -.535149  .253228   .047376
 l2adl3p*|  -.2551161      .23082   -1.11   0.269  -.707514  .197282   .040638
 l2iadl1*|  -.5383919       .1331   -4.04   0.000  -.799265 -.277519   .117201
l2iadl2p*|  -.8412468      .17139   -4.91   0.000  -1.17716 -.505332   .090842
l2logbmi |   1.261164      .25767    4.89   0.000   .756141  1.76619   3.31952
l2smokev*|   .1467863       .0861    1.70   0.088  -.021961  .315533   .629159
l2smoken*|   .1300367      .13305    0.98   0.328   -.13074  .390814   .110882
  l2work*|   4.166806      .12995   32.07   0.000   3.91212   4.4215   .120483
  hlthlm*|  -.5716394       .0934   -6.12   0.000  -.754703 -.388576   .376322
l2arthre*|  -.3687215      .08663   -4.26   0.000  -.538519 -.198924   .404567
l2psyche*|  -.5851057       .1446   -4.05   0.000  -.868516 -.301696   .082254
l2asth~e*|  -.0864997       .1195   -0.72   0.469  -.320723  .147723   .126698
l2park~e*|   1.706614      .50069    3.41   0.001   .725277  2.68795   .006214
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as ols_retage_mfx.

-------------------------------------------------------------------------------
Model ols_retage_mfx (Marginal effects after regress)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
      retage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   2.504194   .0831269    30.12   0.000     2.341262    2.667127
      hsless |  -.3139249   .0869796    -3.61   0.000    -.4844091   -.1434407
     college |  -.3439187   .1176957    -2.92   0.003    -.5746077   -.1132297
    l2age65l |   .8150242   .0257654    31.63   0.000     .7645228    .8655256
   l2age6574 |   .1874643   .0135765    13.81   0.000     .1608538    .2140748
    l2age75p |   .1209817   .0123736     9.78   0.000     .0967289    .1452345
    l2cancre |   .0074983   .1327438     0.06   0.955    -.2526858    .2676824
     l2diabe |  -.0170664   .1327481    -0.13   0.898     -.277259    .2431261
    l2hearte |  -.5433439   .1004887    -5.41   0.000    -.7403065   -.3463812
     l2hibpe |  -.1187921   .0821083    -1.45   0.148    -.2797282     .042144
     l2lunge |  -.0202503    .164574    -0.12   0.902    -.3428232    .3023225
    l2stroke |   .4700545   .1845127     2.55   0.011      .108401     .831708
      l2adl1 |  -.0524069   .1340355    -0.39   0.696    -.3151227     .210309
      l2adl2 |  -.1409607   .2011203    -0.70   0.483     -.535166    .2532446
     l2adl3p |  -.2551161   .2308196    -1.11   0.269    -.7075334    .1973011
     l2iadl1 |  -.5383919   .1331011    -4.04   0.000    -.7992763   -.2775075
    l2iadl2p |  -.8412468   .1713884    -4.91   0.000    -1.177176   -.5053174
    l2logbmi |   1.261164   .2576693     4.89   0.000       .75612    1.766208
    l2smokev |   .1467863    .086097     1.70   0.088    -.0219679    .3155406
    l2smoken |   .1300367    .133052     0.98   0.328    -.1307515    .3908249
      l2work |   4.166806   .1299464    32.07   0.000     3.912105    4.421507
      hlthlm |  -.5716394   .0934014    -6.12   0.000    -.7547105   -.3885684
    l2arthre |  -.3687215   .0866331    -4.26   0.000    -.5385265   -.1989165
    l2psyche |  -.5851057   .1445996    -4.05   0.000    -.8685277   -.3016838
   l2asthmae |  -.0864997   .1195037    -0.72   0.469    -.3207327    .1477332
   l2parkine |   1.706614   .5006909     3.41   0.001      .725236    2.687991
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/retage.ster
>  saved
(results ols_retage_mfx are active now)

      Source |       SS           df       MS      Number of obs   =    33,399
-------------+----------------------------------   F(27, 33371)    =    435.29
       Model |  1.0633e+11        27  3.9380e+09   Prob > F        =    0.0000
    Residual |  3.0190e+11    33,371  9046763.64   R-squared       =    0.2605
-------------+----------------------------------   Adj R-squared   =    0.2599
       Total |  4.0823e+11    33,398    12223047   Root MSE        =    3007.8

------------------------------------------------------------------------------
     ipubpen |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   699.6431   35.35153    19.79   0.000     630.3529    768.9334
      hsless |  -87.85108   36.27935    -2.42   0.015    -158.9599   -16.74228
     college |  -207.0983   51.75073    -4.00   0.000    -308.5316   -105.6651
    l2age65l |   316.1046   6.498318    48.64   0.000     303.3677    328.8415
   l2age6574 |    137.296   5.661719    24.25   0.000     126.1988    148.3931
    l2age75p |   9.898402   5.404652     1.83   0.067    -.6949058    20.49171
    l2cancre |   425.8704   57.10013     7.46   0.000     313.9522    537.7887
     l2diabe |   356.1639   55.60315     6.41   0.000     247.1798     465.148
    l2hearte |    144.459   42.60055     3.39   0.001     60.96042    227.9576
     l2hibpe |   33.90417   34.75548     0.98   0.329     -34.2178    102.0261
     l2lunge |    626.506   67.64028     9.26   0.000     493.9287    759.0834
    l2stroke |   268.5069   77.63535     3.46   0.001     116.3389    420.6749
      l2adl1 |   213.1129   56.11143     3.80   0.000     103.1325    323.0932
      l2adl2 |   749.9544   81.35901     9.22   0.000     590.4878    909.4209
     l2adl3p |   1335.224   86.95738    15.35   0.000     1164.784    1505.663
     l2iadl1 |   265.7281   55.10301     4.82   0.000     157.7242    373.7319
    l2iadl2p |   1005.919   68.01685    14.79   0.000     872.6041    1139.235
    l2logbmi |   635.4746   106.3331     5.98   0.000     427.0579    843.8912
    l2smokev |   142.8787   36.75088     3.89   0.000     70.84573    214.9118
    l2smoken |   284.0861   52.84644     5.38   0.000     180.5053     387.667
    l2itearn |  -.0195615   .0044092    -4.44   0.000    -.0282036   -.0109194
      l2work |  -232.2351   70.96052    -3.27   0.001    -371.3202   -93.15002
      hlthlm |   405.4063   39.29826    10.32   0.000     328.3803    482.4323
    l2arthre |   328.6152   36.53171     9.00   0.000     257.0118    400.2186
    l2psyche |   274.6887   57.08993     4.81   0.000     162.7905     386.587
   l2asthmae |   144.2606   49.51457     2.91   0.004     47.21027    241.3109
   l2parkine |   908.4877      208.6     4.36   0.000     499.6244    1317.351
       _cons |  -18040.59   530.5836   -34.00   0.000    -19080.55   -17000.63
------------------------------------------------------------------------------

Computing marginal effects after regress for ipubpen...


Marginal effects after regress
      y  = Fitted values (predict)
         =  5418.8377
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   699.6431      35.352   19.79   0.000   630.355  768.931   .413006
  hsless*|  -87.85108      36.279   -2.42   0.015  -158.957 -16.7449   .428276
 college*|  -207.0983      51.751   -4.00   0.000  -308.528 -105.669   .134974
l2age65l |   316.1046     6.49832   48.64   0.000   303.368  328.841    61.613
l2a~6574 |    137.296     5.66172   24.25   0.000   126.199  148.393   5.21944
l2age75p |   9.898402     5.40465    1.83   0.067  -.694522  20.4913   2.00332
l2cancre*|   425.8704        57.1    7.46   0.000   313.956  537.785   .092608
 l2diabe*|   356.1639      55.603    6.41   0.000   247.184  465.144   .104823
l2hearte*|    144.459      42.601    3.39   0.001   60.9635  227.955   .199677
 l2hibpe*|   33.90417      34.755    0.98   0.329  -34.2153  102.024   .452708
 l2lunge*|    626.506       67.64    9.26   0.000   493.934  759.079   .069074
l2stroke*|   268.5069      77.635    3.46   0.001   116.344  420.669   .049762
  l2adl1*|   213.1129      56.111    3.80   0.000   103.136  323.089   .115512
  l2adl2*|   749.9544      81.359    9.22   0.000   590.494  909.415   .053026
 l2adl3p*|   1335.224      86.957   15.35   0.000   1164.79  1505.66   .057517
 l2iadl1*|   265.7281      55.103    4.82   0.000   157.728  373.728   .125183
l2iadl2p*|   1005.919      68.017   14.79   0.000   872.609  1139.23    .11695
l2logbmi |   635.4746      106.33    5.98   0.000   427.065  843.884   3.32326
l2smokev*|   142.8787      36.751    3.89   0.000   70.8483  214.909   .629989
l2smoken*|   284.0861      52.846    5.38   0.000   180.509  387.663   .135274
l2itearn |  -.0195615      .00441   -4.44   0.000  -.028203  -.01092   1078.33
  l2work*|  -232.2351      70.961   -3.27   0.001  -371.315 -93.1551   .103985
  hlthlm*|   405.4063      39.298   10.32   0.000   328.383  482.429   .419384
l2arthre*|   328.6152      36.532    9.00   0.000   257.014  400.216   .415462
l2psyche*|   274.6887       57.09    4.81   0.000   162.795  386.583   .098326
l2asth~e*|   144.2606      49.515    2.91   0.004   47.2138  241.307   .134256
l2park~e*|   908.4877       208.6    4.36   0.000   499.639  1317.34   .006377
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as ols_ipubpen_mfx.

-------------------------------------------------------------------------------
Model ols_ipubpen_mfx (Marginal effects after regress)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
     ipubpen |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   699.6431   35.35153    19.79   0.000     630.3529    768.9334
      hsless |  -87.85108   36.27935    -2.42   0.015    -158.9599   -16.74228
     college |  -207.0983   51.75073    -4.00   0.000    -308.5316   -105.6651
    l2age65l |   316.1046   6.498318    48.64   0.000     303.3677    328.8415
   l2age6574 |    137.296   5.661719    24.25   0.000     126.1988    148.3931
    l2age75p |   9.898402   5.404652     1.83   0.067    -.6949058    20.49171
    l2cancre |   425.8704   57.10013     7.46   0.000     313.9522    537.7887
     l2diabe |   356.1639   55.60315     6.41   0.000     247.1798     465.148
    l2hearte |    144.459   42.60055     3.39   0.001     60.96042    227.9576
     l2hibpe |   33.90417   34.75548     0.98   0.329     -34.2178    102.0261
     l2lunge |    626.506   67.64028     9.26   0.000     493.9287    759.0834
    l2stroke |   268.5069   77.63535     3.46   0.001     116.3389    420.6749
      l2adl1 |   213.1129   56.11143     3.80   0.000     103.1325    323.0932
      l2adl2 |   749.9544   81.35901     9.22   0.000     590.4878    909.4209
     l2adl3p |   1335.224   86.95738    15.35   0.000     1164.784    1505.663
     l2iadl1 |   265.7281   55.10301     4.82   0.000     157.7242    373.7319
    l2iadl2p |   1005.919   68.01685    14.79   0.000     872.6041    1139.235
    l2logbmi |   635.4746   106.3331     5.98   0.000     427.0579    843.8912
    l2smokev |   142.8787   36.75088     3.89   0.000     70.84573    214.9118
    l2smoken |   284.0861   52.84644     5.38   0.000     180.5053     387.667
    l2itearn |  -.0195615   .0044092    -4.44   0.000    -.0282036   -.0109194
      l2work |  -232.2351   70.96052    -3.27   0.001    -371.3202   -93.15002
      hlthlm |   405.4063   39.29826    10.32   0.000     328.3803    482.4323
    l2arthre |   328.6152   36.53171     9.00   0.000     257.0118    400.2186
    l2psyche |   274.6887   57.08993     4.81   0.000     162.7905     386.587
   l2asthmae |   144.2606   49.51457     2.91   0.004     47.21027    241.3109
   l2parkine |   908.4877      208.6     4.36   0.000     499.6244    1317.351
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/ipubpen.ste
> r saved
(results ols_ipubpen_mfx are active now)

      Source |       SS           df       MS      Number of obs   =    49,309
-------------+----------------------------------   F(28, 49280)    =     83.10
       Model |  1.1074e+14        28  3.9551e+12   Prob > F        =    0.0000
    Residual |  2.3453e+15    49,280  4.7592e+10   R-squared       =    0.0451
-------------+----------------------------------   Adj R-squared   =    0.0445
       Total |  2.4561e+15    49,308  4.9811e+10   Root MSE        =    2.2e+05

------------------------------------------------------------------------------
       atotf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   4922.849   2094.478     2.35   0.019     817.6472    9028.051
      hsless |  -26979.92   2236.931   -12.06   0.000    -31364.33   -22595.51
     college |   62701.38   2859.217    21.93   0.000     57097.28    68305.48
    l2age65l |   2749.827   296.5065     9.27   0.000      2168.67    3330.983
   l2age6574 |  -3193.231   369.2552    -8.65   0.000    -3916.976   -2469.486
    l2age75p |  -755.5505   384.1508    -1.97   0.049    -1508.491    -2.61019
    l2cancre |   7937.413   3730.303     2.13   0.033     625.9747    15248.85
     l2diabe |  -12081.16   3640.795    -3.32   0.001    -19217.16   -4945.157
    l2hearte |  -3754.902   2753.463    -1.36   0.173    -9151.723    1641.919
     l2hibpe |    -6241.7   2133.917    -2.92   0.003     -10424.2   -2059.197
     l2lunge |  -8621.163   4523.142    -1.91   0.057    -17486.58    244.2502
    l2stroke |  -13753.95   5414.974    -2.54   0.011    -24367.37   -3140.539
      l2adl1 |  -4102.968   3710.486    -1.11   0.269    -11375.57    3169.629
      l2adl2 |  -7738.034   5612.324    -1.38   0.168    -18738.26     3262.19
     l2adl3p |  -11092.13   6080.443    -1.82   0.068    -23009.87    825.6134
     l2iadl1 |  -9224.268   3662.846    -2.52   0.012    -16403.49   -2045.044
    l2iadl2p |  -14233.42   4715.472    -3.02   0.003    -23475.81   -4991.041
    l2logbmi |  -66169.08   6427.377   -10.29   0.000    -78766.81   -53571.34
    l2smokev |  -5769.609   2184.346    -2.64   0.008    -10050.95   -1488.264
    l2smoken |  -35882.63   3077.596   -11.66   0.000    -41914.76   -29850.51
    l2itearn |   .5807264   .1219386     4.76   0.000     .3417252    .8197275
        work |  -21998.34   3747.098    -5.87   0.000     -29342.7   -14653.99
      l2work |  -13378.36   3827.409    -3.50   0.000    -20880.13   -5876.591
      hlthlm |  -20337.81   2565.113    -7.93   0.000    -25365.47   -15310.16
    l2arthre |  -8885.377   2286.097    -3.89   0.000    -13366.15     -4404.6
    l2psyche |  -13498.58   3479.352    -3.88   0.000    -20318.15   -6679.003
   l2asthmae |  -9725.032   3027.538    -3.21   0.001    -15659.04   -3791.021
   l2parkine |  -4680.898   14676.06    -0.32   0.750    -33446.15    24084.35
       _cons |   179902.1      27919     6.44   0.000     125180.6    234623.7
------------------------------------------------------------------------------

Computing marginal effects after regress for atotf...


Marginal effects after regress
      y  = Fitted values (predict)
         =  76418.008
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   4922.849      2094.5    2.35   0.019   817.748  9027.95   .436776
  hsless*|  -26979.92      2236.9  -12.06   0.000  -31364.2 -22595.6   .367722
 college*|   62701.38      2859.2   21.93   0.000   57097.4  68305.3   .164716
l2age65l |   2749.827      296.51    9.27   0.000   2168.68  3330.97   59.8553
l2a~6574 |  -3193.231      369.26   -8.65   0.000  -3916.96  -2469.5   3.69803
l2age75p |  -755.5505      384.15   -1.97   0.049  -1508.47 -2.62868   1.37005
l2cancre*|   7937.413      3730.3    2.13   0.033   626.154  15248.7   .076578
 l2diabe*|  -12081.16      3640.8   -3.32   0.001    -19217 -4945.33   .085502
l2hearte*|  -3754.902      2753.5   -1.36   0.173  -9151.59  1641.79   .164067
 l2hibpe*|    -6241.7      2133.9   -2.92   0.003  -10424.1  -2059.3      .398
 l2lunge*|  -8621.163      4523.1   -1.91   0.057  -17486.4  244.032   .053722
l2stroke*|  -13753.95        5415   -2.54   0.011  -24367.1  -3140.8    .03618
  l2adl1*|  -4102.968      3710.5   -1.11   0.269  -11375.4  3169.45   .091403
  l2adl2*|  -7738.034      5612.3   -1.38   0.168    -18738  3261.92   .038877
 l2adl3p*|  -11092.13      6080.4   -1.82   0.068  -23009.6  825.321   .040844
 l2iadl1*|  -9224.268      3662.8   -2.52   0.012  -16403.3 -2045.22   .097589
l2iadl2p*|  -14233.42      4715.5   -3.02   0.003  -23475.6 -4991.27   .082906
l2logbmi |  -66169.08      6427.4  -10.29   0.000  -78766.5 -53571.6   3.32226
l2smokev*|  -5769.609      2184.3   -2.64   0.008  -10050.8 -1488.37   .616297
l2smoken*|  -35882.63      3077.6  -11.66   0.000  -41914.6 -29850.7   .142915
l2itearn |   .5807264      .12194    4.76   0.000   .341731  .819722   4714.44
    work*|  -21998.34      3747.1   -5.87   0.000  -29342.5 -14654.2   .328885
  l2work*|  -13378.36      3827.4   -3.50   0.000  -20879.9 -5876.77   .378795
  hlthlm*|  -20337.81      2565.1   -7.93   0.000  -25365.3 -15310.3   .317265
l2arthre*|  -8885.377      2286.1   -3.89   0.000    -13366 -4404.71    .34584
l2psyche*|  -13498.58      3479.4   -3.88   0.000    -20318 -6679.17   .092417
l2asth~e*|  -9725.032      3027.5   -3.21   0.001  -15658.9 -3791.17   .125413
l2park~e*|  -4680.898       14676   -0.32   0.750  -33445.4  24083.6   .004583
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as ols_atotf_mfx.

-------------------------------------------------------------------------------
Model ols_atotf_mfx (Marginal effects after regress)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
       atotf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   4922.849   2094.478     2.35   0.019     817.6472    9028.051
      hsless |  -26979.92   2236.931   -12.06   0.000    -31364.33   -22595.51
     college |   62701.38   2859.217    21.93   0.000     57097.28    68305.48
    l2age65l |   2749.827   296.5065     9.27   0.000      2168.67    3330.983
   l2age6574 |  -3193.231   369.2552    -8.65   0.000    -3916.976   -2469.486
    l2age75p |  -755.5505   384.1508    -1.97   0.049    -1508.491    -2.61019
    l2cancre |   7937.413   3730.303     2.13   0.033     625.9747    15248.85
     l2diabe |  -12081.16   3640.795    -3.32   0.001    -19217.16   -4945.157
    l2hearte |  -3754.902   2753.463    -1.36   0.173    -9151.723    1641.919
     l2hibpe |    -6241.7   2133.917    -2.92   0.003     -10424.2   -2059.197
     l2lunge |  -8621.163   4523.142    -1.91   0.057    -17486.58    244.2502
    l2stroke |  -13753.95   5414.974    -2.54   0.011    -24367.37   -3140.539
      l2adl1 |  -4102.968   3710.486    -1.11   0.269    -11375.57    3169.629
      l2adl2 |  -7738.034   5612.324    -1.38   0.168    -18738.26     3262.19
     l2adl3p |  -11092.13   6080.443    -1.82   0.068    -23009.87    825.6134
     l2iadl1 |  -9224.268   3662.846    -2.52   0.012    -16403.49   -2045.044
    l2iadl2p |  -14233.42   4715.472    -3.02   0.003    -23475.81   -4991.041
    l2logbmi |  -66169.08   6427.377   -10.29   0.000    -78766.81   -53571.34
    l2smokev |  -5769.609   2184.346    -2.64   0.008    -10050.95   -1488.264
    l2smoken |  -35882.63   3077.596   -11.66   0.000    -41914.76   -29850.51
    l2itearn |   .5807264   .1219386     4.76   0.000     .3417252    .8197275
        work |  -21998.34   3747.098    -5.87   0.000     -29342.7   -14653.99
      l2work |  -13378.36   3827.409    -3.50   0.000    -20880.13   -5876.591
      hlthlm |  -20337.81   2565.113    -7.93   0.000    -25365.47   -15310.16
    l2arthre |  -8885.377   2286.097    -3.89   0.000    -13366.15     -4404.6
    l2psyche |  -13498.58   3479.352    -3.88   0.000    -20318.15   -6679.003
   l2asthmae |  -9725.032   3027.538    -3.21   0.001    -15659.04   -3791.021
   l2parkine |  -4680.898   14676.06    -0.32   0.750    -33446.15    24084.35
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/atotf.ster 
> saved
(results ols_atotf_mfx are active now)

      Source |       SS           df       MS      Number of obs   =    45,648
-------------+----------------------------------   F(30, 45617)    =   1805.18
       Model |  2.4644e+12        30  8.2148e+10   Prob > F        =    0.0000
    Residual |  2.0759e+12    45,617  45507037.9   R-squared       =    0.5428
-------------+----------------------------------   Adj R-squared   =    0.5425
       Total |  4.5403e+12    45,647    99466375   Root MSE        =    6745.9

------------------------------------------------------------------------------
      itearn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   601.8456   67.98934     8.85   0.000     468.5854    735.1058
      hsless |  -20.70939   72.54551    -0.29   0.775    -162.8998     121.481
     college |   553.4527   91.33028     6.06   0.000     374.4439    732.4615
    l2age65l |  -169.5311   9.584869   -17.69   0.000    -188.3176   -150.7446
   l2age6574 |   51.39812   11.86729     4.33   0.000     28.13803     74.6582
    l2age75p |   11.85817   12.81504     0.93   0.355    -13.25953    36.97586
    l2cancre |   7.623874   120.2754     0.06   0.949    -228.1177    243.3655
     l2diabe |  -106.3735   119.4545    -0.89   0.373    -340.5063    127.7594
    l2hearte |  -46.54238    89.0496    -0.52   0.601     -221.081    127.9963
     l2hibpe |   24.57986   68.67805     0.36   0.720    -110.0302    159.1899
     l2lunge |   191.4938   147.9797     1.29   0.196    -98.54886    481.5365
    l2stroke |   35.03126   181.5278     0.19   0.847    -320.7661    390.8286
      l2adl1 |  -69.24473   120.2673    -0.58   0.565    -304.9706    166.4812
      l2adl2 |  -106.6898   185.0524    -0.58   0.564    -469.3955    256.0159
     l2adl3p |  -32.50217    200.841    -0.16   0.871    -426.1537    361.1493
     l2iadl1 |   110.7608   118.7718     0.93   0.351    -122.0338    343.5554
    l2iadl2p |   138.8464   157.7558     0.88   0.379    -170.3574    448.0502
    l2logbmi |   324.2338   207.1084     1.57   0.117     -81.7019    730.1696
    l2smokev |  -75.61756   70.41845    -1.07   0.283    -213.6389    62.40373
    l2smoken |  -155.3138   100.4421    -1.55   0.122     -352.182    41.55427
    l2itearn |   .5338861   .0039494   135.18   0.000     .5261452    .5416269
        work |    8656.93   119.3428    72.54   0.000     8423.016    8890.844
      l2work |  -3669.313   121.9107   -30.10   0.000     -3908.26   -3430.366
      hlthlm |  -252.0931   82.90913    -3.04   0.002    -414.5964   -89.58992
    l2arthre |   27.21289   73.54475     0.37   0.711     -116.936    171.3618
    l2psyche |  -263.1391   112.3697    -2.34   0.019    -483.3856   -42.89269
   l2asthmae |   55.71846   97.78011     0.57   0.569    -135.9321     247.369
   l2parkine |  -131.7657   475.4299    -0.28   0.782    -1063.616    800.0845
     l2drink |  -46.79612   107.4593    -0.44   0.663    -257.4181    163.8259
  l2drinkd_e |    5.50254   13.94783     0.39   0.693    -21.83544    32.84052
       _cons |   8844.544   906.0186     9.76   0.000     7068.733    10620.36
------------------------------------------------------------------------------

Computing marginal effects after regress for itearn...


Marginal effects after regress
      y  = Fitted values (predict)
         =  4149.6237
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   601.8456      67.989    8.85   0.000   468.589  735.102   .435769
  hsless*|  -20.70939      72.546   -0.29   0.775  -162.896  121.477   .356248
 college*|   553.4527       91.33    6.06   0.000   374.449  732.457   .168244
l2age65l |  -169.5311     9.58487  -17.69   0.000  -188.317 -150.745   59.8548
l2a~6574 |   51.39812      11.867    4.33   0.000   28.1387  74.6576   3.61928
l2age75p |   11.85817      12.815    0.93   0.355  -13.2589  36.9752   1.26851
l2cancre*|   7.623874      120.28    0.06   0.949  -228.111  243.359   .076038
 l2diabe*|  -106.3735      119.45   -0.89   0.373    -340.5  127.753   .082128
l2hearte*|  -46.54238       89.05   -0.52   0.601  -221.076  127.992   .161037
 l2hibpe*|   24.57986      68.678    0.36   0.720  -110.027  159.186   .393774
 l2lunge*|   191.4938      147.98    1.29   0.196  -98.5412  481.529   .051744
l2stroke*|   35.03126      181.53    0.19   0.847  -320.757  390.819   .032926
  l2adl1*|  -69.24473      120.27   -0.58   0.565  -304.964  166.475   .089599
  l2adl2*|  -106.6898      185.05   -0.58   0.564  -469.386  256.006   .036672
 l2adl3p*|  -32.50217      200.84   -0.16   0.871  -426.143  361.139   .038819
 l2iadl1*|   110.7608      118.77    0.93   0.351  -122.028  343.549   .095733
l2iadl2p*|   138.8464      157.76    0.88   0.379  -170.349  448.042   .075118
l2logbmi |   324.2338      207.11    1.57   0.117  -81.6911  730.159   3.32141
l2smokev*|  -75.61756      70.418   -1.07   0.283  -213.635  62.4001   .613192
l2smoken*|  -155.3138      100.44   -1.55   0.122  -352.177   41.549   .137114
l2itearn |   .5338861      .00395  135.18   0.000   .526145  .541627   4737.68
    work*|    8656.93      119.34   72.54   0.000   8423.02  8890.84   .331471
  l2work*|  -3669.313      121.91  -30.10   0.000  -3908.25 -3430.37   .382974
  hlthlm*|  -252.0931      82.909   -3.04   0.002  -414.592 -89.5942    .30779
l2arthre*|   27.21289      73.545    0.37   0.711  -116.932  171.358   .342447
l2psyche*|  -263.1391      112.37   -2.34   0.019   -483.38 -42.8985   .091373
l2asth~e*|   55.71846       97.78    0.57   0.569  -135.927  247.364   .123992
l2park~e*|  -131.7657      475.43   -0.28   0.782  -1063.59   800.06   .004513
 l2drink*|  -46.79612      107.46   -0.44   0.663  -257.413   163.82   .889897
l2dr~d_e |    5.50254      13.948    0.39   0.693  -21.8347  32.8398   2.41104
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as ols_itearn_mfx.

-------------------------------------------------------------------------------
Model ols_itearn_mfx (Marginal effects after regress)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
      itearn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   601.8456   67.98934     8.85   0.000     468.5854    735.1058
      hsless |  -20.70939   72.54551    -0.29   0.775    -162.8998     121.481
     college |   553.4527   91.33028     6.06   0.000     374.4439    732.4615
    l2age65l |  -169.5311   9.584869   -17.69   0.000    -188.3176   -150.7446
   l2age6574 |   51.39812   11.86729     4.33   0.000     28.13803     74.6582
    l2age75p |   11.85817   12.81504     0.93   0.355    -13.25953    36.97586
    l2cancre |   7.623874   120.2754     0.06   0.949    -228.1177    243.3655
     l2diabe |  -106.3735   119.4545    -0.89   0.373    -340.5063    127.7594
    l2hearte |  -46.54238    89.0496    -0.52   0.601     -221.081    127.9963
     l2hibpe |   24.57986   68.67805     0.36   0.720    -110.0302    159.1899
     l2lunge |   191.4938   147.9797     1.29   0.196    -98.54886    481.5365
    l2stroke |   35.03126   181.5278     0.19   0.847    -320.7661    390.8286
      l2adl1 |  -69.24473   120.2673    -0.58   0.565    -304.9706    166.4812
      l2adl2 |  -106.6898   185.0524    -0.58   0.564    -469.3955    256.0159
     l2adl3p |  -32.50217    200.841    -0.16   0.871    -426.1537    361.1493
     l2iadl1 |   110.7608   118.7718     0.93   0.351    -122.0338    343.5554
    l2iadl2p |   138.8464   157.7558     0.88   0.379    -170.3574    448.0502
    l2logbmi |   324.2338   207.1084     1.57   0.117     -81.7019    730.1696
    l2smokev |  -75.61756   70.41845    -1.07   0.283    -213.6389    62.40373
    l2smoken |  -155.3138   100.4421    -1.55   0.122     -352.182    41.55427
    l2itearn |   .5338861   .0039494   135.18   0.000     .5261452    .5416269
        work |    8656.93   119.3428    72.54   0.000     8423.016    8890.844
      l2work |  -3669.313   121.9107   -30.10   0.000     -3908.26   -3430.366
      hlthlm |  -252.0931   82.90913    -3.04   0.002    -414.5964   -89.58992
    l2arthre |   27.21289   73.54475     0.37   0.711     -116.936    171.3618
    l2psyche |  -263.1391   112.3697    -2.34   0.019    -483.3856   -42.89269
   l2asthmae |   55.71846   97.78011     0.57   0.569    -135.9321     247.369
   l2parkine |  -131.7657   475.4299    -0.28   0.782    -1063.616    800.0845
     l2drink |  -46.79612   107.4593    -0.44   0.663    -257.4181    163.8259
  l2drinkd_e |    5.50254   13.94783     0.39   0.693    -21.83544    32.84052
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/itearn.ster
>  saved
(results ols_itearn_mfx are active now)

. 
. /*********************************************************************/
. * ESTIMATE ORDERED OUTCOMES
. /*********************************************************************/
. 
. foreach n in $order {
  2.         local x = "allvars_`n'"
  3.   oprobit `n' $`x' if `select_`n''
  4.   mfx2, stub(o_`n') se
  5.   est save "`ster'/`n'.ster", replace
  6. }

Iteration 0:   log likelihood = -30715.667  
Iteration 1:   log likelihood = -23232.876  
Iteration 2:   log likelihood = -23083.894  
Iteration 3:   log likelihood = -23083.508  
Iteration 4:   log likelihood = -23083.508  

Ordered probit regression                       Number of obs     =     47,424
                                                LR chi2(24)       =   15264.32
                                                Prob > chi2       =     0.0000
Log likelihood = -23083.508                     Pseudo R2         =     0.2485

------------------------------------------------------------------------------
     adlstat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0813832    .015694     5.19   0.000     .0506236    .1121428
      hsless |   .0299922   .0163611     1.83   0.067     -.002075    .0620594
     college |  -.1167082   .0240701    -4.85   0.000    -.1638848   -.0695316
    l2age65l |   .0053004   .0024136     2.20   0.028     .0005698     .010031
   l2age6574 |   .0160714   .0026117     6.15   0.000     .0109525    .0211903
    l2age75p |   .0182146    .002398     7.60   0.000     .0135146    .0229147
    l2cancre |   .0160518   .0266029     0.60   0.546    -.0360888    .0681925
     l2diabe |   .1008371   .0241806     4.17   0.000     .0534441    .1482302
    l2hearte |    .044273   .0188362     2.35   0.019     .0073548    .0811913
     l2hibpe |   .0754092   .0156017     4.83   0.000     .0448304    .1059881
     l2lunge |   .2103609   .0281476     7.47   0.000     .1551926    .2655291
    l2stroke |   .1713842   .0332559     5.15   0.000     .1062038    .2365645
      l2adl1 |   .8246601   .0211193    39.05   0.000      .783267    .8660531
      l2adl2 |   1.159051   .0301687    38.42   0.000     1.099921     1.21818
     l2adl3p |   1.679598    .033308    50.43   0.000     1.614316    1.744881
     l2iadl1 |   .4012566   .0220034    18.24   0.000     .3581306    .4443825
    l2iadl2p |   .6239225   .0262703    23.75   0.000     .5724337    .6754114
    l2logbmi |   .6540336    .047036    13.90   0.000     .5618448    .7462224
    l2psyche |   .1374267   .0243394     5.65   0.000     .0897224     .185131
    l2arthre |   .3432574   .0159796    21.48   0.000     .3119378    .3745769
   l2asthmae |   .0757118   .0214271     3.53   0.000     .0337154    .1177081
   l2parkine |   .7575307   .0780928     9.70   0.000     .6044716    .9105898
     l2drink |  -.0989319   .0218013    -4.54   0.000    -.1416616   -.0562022
  l2drinkd_e |  -.0139064   .0032522    -4.28   0.000    -.0202806   -.0075322
-------------+----------------------------------------------------------------
       /cut1 |   4.111012   .2114039                      3.696668    4.525356
       /cut2 |   4.781276   .2117179                      4.366317    5.196235
       /cut3 |   5.289216   .2119316                      4.873837    5.704594
------------------------------------------------------------------------------

Frequencies for adlstat...


     RECODE of |
      adlcount |      Freq.     Percent        Cum.
---------------+-----------------------------------
       No ADLs |     39,044       82.33       82.33
         1 ADL |      4,337        9.15       91.47
        2 ADLs |      1,905        4.02       95.49
3 or more ADLs |      2,138        4.51      100.00
---------------+-----------------------------------
         Total |     47,424      100.00

Computing marginal effects after oprobit for adlstat == 1...


Marginal effects after oprobit
      y  = Pr(adlstat==1) (predict, o(1))
         =  .87376587
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|  -.0169687      .00329   -5.16   0.000  -.023415 -.010522   .436994
  hsless*|  -.0062457      .00342   -1.82   0.068  -.012954  .000463   .363339
 college*|   .0231211      .00454    5.09   0.000   .014216  .032027   .165612
l2age65l |  -.0010986       .0005   -2.20   0.028  -.002078 -.000119   59.8973
l2a~6574 |  -.0033311      .00054   -6.16   0.000  -.004391 -.002271   3.71316
l2age75p |  -.0037753       .0005   -7.59   0.000   -.00475   -.0028   1.37373
l2cancre*|   -.003353       .0056   -0.60   0.549  -.014329  .007623   .076417
 l2diabe*|   -.021912       .0055   -3.98   0.000  -.032692 -.011132   .083586
l2hearte*|  -.0093327      .00404   -2.31   0.021  -.017246 -.001419   .165064
 l2hibpe*|  -.0157709      .00329   -4.79   0.000   -.02222 -.009322   .396508
 l2lunge*|  -.0483446      .00711   -6.80   0.000  -.062281 -.034408   .053496
l2stroke*|  -.0387979      .00817   -4.75   0.000  -.054815 -.022781   .034961
  l2adl1*|  -.2351104      .00741  -31.72   0.000  -.249636 -.220585   .091388
  l2adl2*|   -.370942      .01182  -31.39   0.000  -.394107 -.347777    .03804
 l2adl3p*|  -.5669213      .01173  -48.32   0.000  -.589918 -.543924   .041287
 l2iadl1*|   -.098736      .00625  -15.79   0.000  -.110993 -.086479   .097356
l2iadl2p*|  -.1679697      .00863  -19.46   0.000  -.184886 -.151053   .080698
l2logbmi |  -.1355612      .00972  -13.94   0.000  -.154621 -.116502   3.32125
l2psyche*|  -.0303323       .0057   -5.32   0.000  -.041498 -.019167   .091199
l2arthre*|   -.075594       .0037  -20.41   0.000  -.082853 -.068335    .34434
l2asth~e*|   -.016206      .00473   -3.42   0.001   -.02548 -.006932   .124599
l2park~e*|  -.2225739      .02882   -7.72   0.000  -.279052 -.166096   .005082
 l2drink*|   .0214082      .00492    4.35   0.000   .011768  .031048   .886134
l2dr~d_e |   .0028824      .00067    4.28   0.000   .001562  .004203   2.41245
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for adlstat == 2...


Marginal effects after oprobit
      y  = Pr(adlstat==2) (predict, o(2))
         =  .09144441
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0106489      .00206    5.16   0.000   .006605  .014692   .436994
  hsless*|   .0039223      .00215    1.83   0.068  -.000285  .008129   .363339
 college*|  -.0147559      .00295   -5.01   0.000  -.020532  -.00898   .165612
l2age65l |   .0006911      .00031    2.20   0.028   .000074  .001308   59.8973
l2a~6574 |   .0020954      .00034    6.14   0.000   .001427  .002764   3.71316
l2age75p |   .0023748      .00031    7.56   0.000   .001759  .002991   1.37373
l2cancre*|   .0021034       .0035    0.60   0.548  -.004763   .00897   .076417
 l2diabe*|   .0135447      .00334    4.05   0.000    .00699  .020099   .083586
l2hearte*|   .0058355      .00251    2.32   0.020   .000915  .010755   .165064
 l2hibpe*|   .0098871      .00206    4.80   0.000   .005852  .013922   .396508
 l2lunge*|     .02918      .00413    7.07   0.000   .021086  .037274   .053496
l2stroke*|   .0235808      .00481    4.91   0.000   .014163  .032999   .034961
  l2adl1*|   .1211288      .00343   35.26   0.000   .114396  .127861   .091388
  l2adl2*|   .1604106      .00364   44.02   0.000   .153269  .167553    .03804
 l2adl3p*|    .177679       .0031   57.37   0.000   .171609  .183749   .041287
 l2iadl1*|   .0574381      .00343   16.75   0.000   .050716   .06416   .097356
l2iadl2p*|   .0917704      .00419   21.88   0.000   .083551   .09999   .080698
l2logbmi |   .0852734       .0062   13.74   0.000   .073113  .097434   3.32125
l2psyche*|   .0186309      .00342    5.44   0.000   .011921  .025341   .091199
l2arthre*|   .0462573      .00227   20.38   0.000   .041808  .050706    .34434
l2asth~e*|   .0100757      .00291    3.46   0.001   .004372  .015779   .124599
l2park~e*|   .1127141      .01123   10.03   0.000   .090696  .134732   .005082
 l2drink*|  -.0132542        .003   -4.42   0.000  -.019135 -.007374   .886134
l2dr~d_e |  -.0018131      .00042   -4.27   0.000  -.002645 -.000981   2.41245
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for adlstat == 3...


Marginal effects after oprobit
      y  = Pr(adlstat==3) (predict, o(3))
         =  .02468881
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0041029       .0008    5.12   0.000   .002533  .005673   .436994
  hsless*|   .0015092      .00083    1.82   0.069  -.000116  .003134   .363339
 college*|   -.005494      .00107   -5.14   0.000  -.007588   -.0034   .165612
l2age65l |    .000265      .00012    2.20   0.028   .000029  .000501   59.8973
l2a~6574 |   .0008036      .00013    6.11   0.000   .000546  .001061   3.71316
l2age75p |   .0009108      .00012    7.50   0.000   .000673  .001149   1.37373
l2cancre*|   .0008111      .00136    0.60   0.550  -.001851  .003473   .076417
 l2diabe*|   .0053757      .00138    3.91   0.000    .00268  .008072   .083586
l2hearte*|   .0022648      .00099    2.30   0.022   .000331  .004199   .165064
 l2hibpe*|   .0038171       .0008    4.75   0.000   .002244  .005391   .396508
 l2lunge*|   .0121096      .00186    6.52   0.000   .008468  .015752   .053496
l2stroke*|   .0096624       .0021    4.59   0.000   .005539  .013786   .034961
  l2adl1*|   .0643986       .0025   25.72   0.000   .059492  .069306   .091388
  l2adl2*|   .1059087      .00413   25.67   0.000   .097823  .113995    .03804
 l2adl3p*|    .159491      .00437   36.52   0.000   .150931  .168051   .041287
 l2iadl1*|   .0254197      .00177   14.37   0.000   .021952  .028887   .097356
l2iadl2p*|    .044878      .00264   16.98   0.000   .039697  .050059   .080698
l2logbmi |    .032703      .00243   13.46   0.000    .02794  .037466   3.32125
l2psyche*|   .0074844      .00144    5.19   0.000   .004656  .010313   .091199
l2arthre*|   .0186907      .00101   18.54   0.000   .016715  .020666    .34434
l2asth~e*|   .0039543      .00117    3.38   0.001   .001661  .006248   .124599
l2park~e*|   .0615217      .00872    7.05   0.000   .044429  .078615   .005082
 l2drink*|  -.0052444      .00123   -4.27   0.000   -.00765 -.002838   .886134
l2dr~d_e |  -.0006953      .00016   -4.26   0.000  -.001015 -.000375   2.41245
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for adlstat == 4...


Marginal effects after oprobit
      y  = Pr(adlstat==4) (predict, o(4))
         =  .01010091
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|    .002217      .00044    5.07   0.000   .001359  .003075   .436994
  hsless*|   .0008142      .00045    1.81   0.070  -.000066  .001694   .363339
 college*|  -.0028712      .00055   -5.26   0.000  -.003942 -.001801   .165612
l2age65l |   .0001425      .00006    2.19   0.028   .000015   .00027   59.8973
l2a~6574 |   .0004321      .00007    6.06   0.000   .000292  .000572   3.71316
l2age75p |   .0004897      .00007    7.42   0.000    .00036  .000619   1.37373
l2cancre*|   .0004385      .00074    0.59   0.553  -.001009  .001885   .076417
 l2diabe*|   .0029916      .00079    3.77   0.000   .001437  .004546   .083586
l2hearte*|   .0012324      .00054    2.27   0.023   .000167  .002298   .165064
 l2hibpe*|   .0020667      .00044    4.70   0.000   .001205  .002929   .396508
 l2lunge*|   .0070549      .00117    6.03   0.000   .004761  .009348   .053496
l2stroke*|   .0055547      .00129    4.31   0.000   .003027  .008083   .034961
  l2adl1*|    .049583      .00248   20.01   0.000   .044727  .054439   .091388
  l2adl2*|   .1046227      .00581   18.01   0.000   .093238  .116008    .03804
 l2adl3p*|   .2297514      .01008   22.80   0.000       .21  .249503   .041287
 l2iadl1*|   .0158782      .00127   12.48   0.000   .013385  .018371   .097356
l2iadl2p*|   .0313212      .00225   13.95   0.000    .02692  .035723   .080698
l2logbmi |   .0175848      .00136   12.94   0.000   .014921  .020249   3.32125
l2psyche*|    .004217      .00085    4.94   0.000   .002544   .00589   .091199
l2arthre*|    .010646      .00064   16.64   0.000   .009392    .0119    .34434
l2asth~e*|   .0021759      .00066    3.30   0.001   .000882  .003469   .124599
l2park~e*|   .0483381      .00911    5.31   0.000    .03048  .066196   .005082
 l2drink*|  -.0029096       .0007   -4.13   0.000   -.00429  -.00153   .886134
l2dr~d_e |  -.0003739      .00009   -4.25   0.000  -.000546 -.000201   2.41245
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as o_adlstat_mfx.

-------------------------------------------------------------------------------
Model o_adlstat_mfx (Marginal effects after oprobit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
     adlstat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
No_ADLs      |
        male |  -.0169687    .003289    -5.16   0.000     -.023415   -.0105224
      hsless |  -.0062457   .0034228    -1.82   0.068    -.0129542    .0004628
     college |   .0231211   .0045437     5.09   0.000     .0142156    .0320266
    l2age65l |  -.0010986   .0004999    -2.20   0.028    -.0020784   -.0001188
   l2age6574 |  -.0033311   .0005407    -6.16   0.000    -.0043909   -.0022713
    l2age75p |  -.0037753   .0004975    -7.59   0.000    -.0047504   -.0028003
    l2cancre |   -.003353   .0055999    -0.60   0.549    -.0143285    .0076226
     l2diabe |   -.021912      .0055    -3.98   0.000    -.0326918   -.0111321
    l2hearte |  -.0093327   .0040376    -2.31   0.021    -.0172463   -.0014191
     l2hibpe |  -.0157709   .0032903    -4.79   0.000    -.0222197   -.0093221
     l2lunge |  -.0483446   .0071107    -6.80   0.000    -.0622813   -.0344078
    l2stroke |  -.0387979   .0081722    -4.75   0.000    -.0548152   -.0227806
      l2adl1 |  -.2351104    .007411   -31.72   0.000    -.2496358    -.220585
      l2adl2 |   -.370942    .011819   -31.39   0.000    -.3941068   -.3477773
     l2adl3p |  -.5669213   .0117333   -48.32   0.000    -.5899182   -.5439244
     l2iadl1 |   -.098736   .0062536   -15.79   0.000    -.1109928   -.0864793
    l2iadl2p |  -.1679697   .0086311   -19.46   0.000    -.1848863   -.1510531
    l2logbmi |  -.1355612   .0097243   -13.94   0.000    -.1546206   -.1165019
    l2psyche |  -.0303323   .0056968    -5.32   0.000    -.0414978   -.0191668
    l2arthre |   -.075594   .0037037   -20.41   0.000    -.0828532   -.0683348
   l2asthmae |   -.016206   .0047319    -3.42   0.001    -.0254803   -.0069316
   l2parkine |  -.2225739   .0288159    -7.72   0.000     -.279052   -.1660957
     l2drink |   .0214082   .0049185     4.35   0.000     .0117681    .0310483
  l2drinkd_e |   .0028824   .0006739     4.28   0.000     .0015616    .0042032
-------------+----------------------------------------------------------------
1_ADL        |
        male |   .0106489    .002063     5.16   0.000     .0066054    .0146924
      hsless |   .0039223   .0021464     1.83   0.068    -.0002846    .0081291
     college |  -.0147559   .0029469    -5.01   0.000    -.0205317   -.0089801
    l2age65l |   .0006911   .0003146     2.20   0.028     .0000744    .0013077
   l2age6574 |   .0020954   .0003411     6.14   0.000     .0014269    .0027639
    l2age75p |   .0023748   .0003142     7.56   0.000     .0017591    .0029906
    l2cancre |   .0021034   .0035036     0.60   0.548    -.0047635    .0089704
     l2diabe |   .0135447   .0033441     4.05   0.000     .0069904    .0200989
    l2hearte |   .0058355   .0025102     2.32   0.020     .0009155    .0107555
     l2hibpe |   .0098871   .0020588     4.80   0.000     .0058519    .0139223
     l2lunge |     .02918   .0041295     7.07   0.000     .0210863    .0372737
    l2stroke |   .0235808   .0048052     4.91   0.000     .0141627    .0329989
      l2adl1 |   .1211288   .0034349    35.26   0.000     .1143964    .1278612
      l2adl2 |   .1604106    .003644    44.02   0.000     .1532685    .1675527
     l2adl3p |    .177679   .0030969    57.37   0.000     .1716092    .1837487
     l2iadl1 |   .0574381   .0034297    16.75   0.000      .050716    .0641603
    l2iadl2p |   .0917704   .0041938    21.88   0.000     .0835507    .0999902
    l2logbmi |   .0852734   .0062044    13.74   0.000      .073113    .0974338
    l2psyche |   .0186309   .0034234     5.44   0.000     .0119211    .0253407
    l2arthre |   .0462573   .0022699    20.38   0.000     .0418084    .0507062
   l2asthmae |   .0100757   .0029101     3.46   0.001     .0043721    .0157794
   l2parkine |   .1127141   .0112338    10.03   0.000     .0906963    .1347318
     l2drink |  -.0132542   .0030003    -4.42   0.000    -.0191348   -.0073737
  l2drinkd_e |  -.0018131   .0004245    -4.27   0.000    -.0026452    -.000981
-------------+----------------------------------------------------------------
2_ADLs       |
        male |   .0041029   .0008012     5.12   0.000     .0025325    .0056732
      hsless |   .0015092    .000829     1.82   0.069    -.0001155     .003134
     college |   -.005494   .0010682    -5.14   0.000    -.0075876   -.0034004
    l2age65l |    .000265   .0001206     2.20   0.028     .0000286    .0005015
   l2age6574 |   .0008036   .0001314     6.11   0.000      .000546    .0010612
    l2age75p |   .0009108   .0001214     7.50   0.000     .0006728    .0011488
    l2cancre |   .0008111   .0013583     0.60   0.550    -.0018511    .0034733
     l2diabe |   .0053757   .0013756     3.91   0.000     .0026797    .0080718
    l2hearte |   .0022648   .0009868     2.30   0.022     .0003308    .0041988
     l2hibpe |   .0038171   .0008028     4.75   0.000     .0022436    .0053907
     l2lunge |   .0121096   .0018582     6.52   0.000     .0084676    .0157517
    l2stroke |   .0096624   .0021037     4.59   0.000     .0055392    .0137856
      l2adl1 |   .0643986   .0025037    25.72   0.000     .0594915    .0693057
      l2adl2 |   .1059087   .0041256    25.67   0.000     .0978227    .1139948
     l2adl3p |    .159491   .0043675    36.52   0.000     .1509308    .1680511
     l2iadl1 |   .0254197   .0017693    14.37   0.000     .0219519    .0288874
    l2iadl2p |    .044878   .0026434    16.98   0.000     .0396971     .050059
    l2logbmi |    .032703   .0024303    13.46   0.000     .0279398    .0374663
    l2psyche |   .0074844   .0014432     5.19   0.000     .0046559    .0103129
    l2arthre |   .0186907    .001008    18.54   0.000      .016715    .0206664
   l2asthmae |   .0039543   .0011701     3.38   0.001     .0016611    .0062476
   l2parkine |   .0615217    .008721     7.05   0.000     .0444289    .0786145
     l2drink |  -.0052444   .0012276    -4.27   0.000    -.0076505   -.0028383
  l2drinkd_e |  -.0006953   .0001632    -4.26   0.000    -.0010152   -.0003755
-------------+----------------------------------------------------------------
3_or_more_~s |
        male |    .002217   .0004376     5.07   0.000     .0013592    .0030748
      hsless |   .0008142   .0004491     1.81   0.070     -.000066    .0016945
     college |  -.0028712   .0005463    -5.26   0.000    -.0039419   -.0018006
    l2age65l |   .0001425    .000065     2.19   0.028     .0000152    .0002699
   l2age6574 |   .0004321   .0000713     6.06   0.000     .0002924    .0005718
    l2age75p |   .0004897    .000066     7.42   0.000     .0003603    .0006192
    l2cancre |   .0004385   .0007383     0.59   0.553    -.0010085    .0018855
     l2diabe |   .0029916   .0007931     3.77   0.000     .0014371    .0045461
    l2hearte |   .0012324   .0005438     2.27   0.023     .0001665    .0022982
     l2hibpe |   .0020667   .0004398     4.70   0.000     .0012047    .0029286
     l2lunge |   .0070549   .0011702     6.03   0.000     .0047614    .0093485
    l2stroke |   .0055547   .0012899     4.31   0.000     .0030265    .0080828
      l2adl1 |    .049583   .0024774    20.01   0.000     .0447274    .0544385
      l2adl2 |   .1046227   .0058088    18.01   0.000     .0932377    .1160077
     l2adl3p |   .2297514   .0100776    22.80   0.000     .2099997    .2495031
     l2iadl1 |   .0158782    .001272    12.48   0.000     .0133851    .0183713
    l2iadl2p |   .0313212   .0022458    13.95   0.000     .0269195    .0357229
    l2logbmi |   .0175848   .0013593    12.94   0.000     .0149206     .020249
    l2psyche |    .004217   .0008536     4.94   0.000     .0025439      .00589
    l2arthre |    .010646   .0006397    16.64   0.000     .0093922    .0118997
   l2asthmae |   .0021759   .0006599     3.30   0.001     .0008825    .0034693
   l2parkine |   .0483381   .0091116     5.31   0.000     .0304797    .0661964
     l2drink |  -.0029096   .0007041    -4.13   0.000    -.0042897   -.0015296
  l2drinkd_e |  -.0003739    .000088    -4.25   0.000    -.0005463   -.0002015
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/adlstat.ste
> r saved

Iteration 0:   log likelihood =  -29440.55  
Iteration 1:   log likelihood = -21668.831  
Iteration 2:   log likelihood = -21560.816  
Iteration 3:   log likelihood =   -21560.7  
Iteration 4:   log likelihood =   -21560.7  

Ordered probit regression                       Number of obs     =     47,424
                                                LR chi2(24)       =   15759.70
                                                Prob > chi2       =     0.0000
Log likelihood =   -21560.7                     Pseudo R2         =     0.2677

------------------------------------------------------------------------------
    iadlstat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |  -.1319928   .0157651    -8.37   0.000    -.1628918   -.1010939
      hsless |   .0974231   .0162484     6.00   0.000     .0655767    .1292695
     college |  -.0924713   .0238689    -3.87   0.000    -.1392535   -.0456891
    l2age65l |  -.0020361   .0022975    -0.89   0.375    -.0065391    .0024669
   l2age6574 |   .0152819   .0026056     5.87   0.000     .0101751    .0203888
    l2age75p |    .042281   .0023924    17.67   0.000      .037592      .04697
    l2cancre |   .0540513   .0261218     2.07   0.039     .0028535     .105249
     l2diabe |   .1593248   .0245192     6.50   0.000     .1112679    .2073816
    l2hearte |   .1222175   .0187065     6.53   0.000     .0855533    .1588816
     l2hibpe |   .1041288   .0155979     6.68   0.000     .0735575    .1347001
     l2lunge |   .2710506   .0284318     9.53   0.000     .2153253    .3267758
    l2stroke |   .2171542   .0342573     6.34   0.000     .1500112    .2842973
      l2adl1 |   .3391537   .0226305    14.99   0.000     .2947987    .3835087
      l2adl2 |   .5532153   .0320318    17.27   0.000     .4904342    .6159965
     l2adl3p |   .7801966   .0344541    22.64   0.000     .7126679    .8477254
     l2iadl1 |   .8310496   .0208692    39.82   0.000     .7901468    .8719525
    l2iadl2p |    1.36046   .0266158    51.11   0.000     1.308294    1.412626
    l2logbmi |   .1352752   .0470013     2.88   0.004     .0431543     .227396
    l2psyche |   .2778761   .0234365    11.86   0.000     .2319414    .3238108
    l2arthre |   .2650868    .015953    16.62   0.000     .2338196     .296354
   l2asthmae |   .0747304   .0214385     3.49   0.000     .0327117    .1167491
   l2parkine |   .5409583   .0827331     6.54   0.000     .3788043    .7031122
     l2drink |  -.1341074    .021598    -6.21   0.000    -.1764387   -.0917761
  l2drinkd_e |   -.022616   .0032521    -6.95   0.000      -.02899   -.0162419
-------------+----------------------------------------------------------------
       /cut1 |   1.814242    .206243                      1.410013    2.218471
       /cut2 |   2.510179   .2064073                      2.105628    2.914729
------------------------------------------------------------------------------

Frequencies for iadlstat...


      RECODE of |
      iadlcount |      Freq.     Percent        Cum.
----------------+-----------------------------------
       No IADLs |     38,346       80.86       80.86
         1 IADL |      4,729        9.97       90.83
2 or more IADLs |      4,349        9.17      100.00
----------------+-----------------------------------
          Total |     47,424      100.00

Computing marginal effects after oprobit for iadlstat == 1...


Marginal effects after oprobit
      y  = Pr(iadlstat==1) (predict, o(1))
         =  .85958524
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0291776      .00345    8.45   0.000   .022413  .035942   .436994
  hsless*|  -.0220412      .00373   -5.91   0.000  -.029346 -.014737   .363339
 college*|   .0199391      .00497    4.02   0.000   .010207  .029671   .165612
l2age65l |   .0004541      .00051    0.89   0.376   -.00055  .001458   59.8973
l2a~6574 |  -.0034082      .00058   -5.87   0.000  -.004545 -.002271   3.71316
l2age75p |  -.0094297      .00054  -17.54   0.000  -.010483 -.008376   1.37373
l2cancre*|   -.012353      .00611   -2.02   0.043  -.024336 -.000371   .076417
 l2diabe*|  -.0380859      .00625   -6.09   0.000  -.050344 -.025827   .083586
l2hearte*|  -.0284652      .00454   -6.27   0.000  -.037368 -.019562   .165064
 l2hibpe*|  -.0234949      .00356   -6.60   0.000  -.030467 -.016523   .396508
 l2lunge*|  -.0683587        .008   -8.55   0.000   -.08403 -.052687   .053496
l2stroke*|  -.0537236      .00931   -5.77   0.000  -.071976 -.035471   .034961
  l2adl1*|  -.0869438      .00654  -13.30   0.000  -.099757 -.074131   .091388
  l2adl2*|  -.1566599      .01087  -14.41   0.000  -.177972 -.135348    .03804
 l2adl3p*|   -.237166      .01284  -18.48   0.000  -.262322  -.21201   .041287
 l2iadl1*|  -.2481828      .00749  -33.14   0.000  -.262863 -.233503   .097356
l2iadl2p*|  -.4509975      .01009  -44.71   0.000  -.470766 -.431229   .080698
l2logbmi |  -.0301697      .01048   -2.88   0.004  -.050714 -.009625   3.32125
l2psyche*|  -.0695837      .00649  -10.72   0.000  -.082306 -.056861   .091199
l2arthre*|  -.0617719      .00386  -16.00   0.000  -.069339 -.054205    .34434
l2asth~e*|  -.0171723      .00507   -3.39   0.001  -.027112 -.007233   .124599
l2park~e*|  -.1547103      .02848   -5.43   0.000  -.210521 -.098899   .005082
 l2drink*|   .0315859      .00536    5.89   0.000    .02108  .042092   .886134
l2dr~d_e |   .0050439      .00072    6.96   0.000   .003624  .006464   2.41245
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for iadlstat == 2...


Marginal effects after oprobit
      y  = Pr(iadlstat==2) (predict, o(2))
         =  .10241576
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   -.018412      .00219   -8.40   0.000  -.022709 -.014115   .436994
  hsless*|   .0137908      .00232    5.94   0.000   .009238  .018344   .363339
 college*|  -.0127022       .0032   -3.96   0.000  -.018984 -.006421   .165612
l2age65l |  -.0002858      .00032   -0.89   0.376  -.000918  .000346   59.8973
l2a~6574 |   .0021452      .00037    5.86   0.000   .001428  .002863   3.71316
l2age75p |   .0059353      .00034   17.22   0.000    .00526  .006611   1.37373
l2cancre*|   .0077007      .00378    2.04   0.041   .000301    .0151   .076417
 l2diabe*|   .0232758      .00372    6.26   0.000   .015987  .030564   .083586
l2hearte*|   .0175989      .00277    6.36   0.000    .01218  .023018   .165064
 l2hibpe*|   .0147149      .00222    6.62   0.000   .010358  .019072   .396508
 l2lunge*|   .0406477      .00451    9.02   0.000   .031815  .049481   .053496
l2stroke*|   .0322882      .00535    6.04   0.000   .021804  .042773   .034961
  l2adl1*|   .0511586      .00364   14.07   0.000   .044033  .058285   .091388
  l2adl2*|   .0858747      .00521   16.48   0.000   .075663  .096087    .03804
 l2adl3p*|   .1202285      .00518   23.19   0.000   .110069  .130388   .041287
 l2iadl1*|   .1271013      .00342   37.14   0.000   .120394  .133808   .097356
l2iadl2p*|   .1805312      .00308   58.64   0.000   .174497  .186565   .080698
l2logbmi |   .0189896       .0066    2.88   0.004   .006053  .031926   3.32125
l2psyche*|   .0415128       .0037   11.23   0.000   .034265  .048761   .091199
l2arthre*|   .0380812      .00237   16.07   0.000   .033438  .042725    .34434
l2asth~e*|   .0106803      .00312    3.42   0.001   .004568  .016793   .124599
l2park~e*|   .0842877      .01319    6.39   0.000   .058428  .110147   .005082
 l2drink*|  -.0194341      .00323   -6.02   0.000  -.025765 -.013104   .886134
l2dr~d_e |  -.0031748      .00046   -6.94   0.000  -.004072 -.002278   2.41245
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for iadlstat == 3...


Marginal effects after oprobit
      y  = Pr(iadlstat==3) (predict, o(3))
         =    .037999
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|  -.0107656      .00128   -8.42   0.000  -.013271  -.00826   .436994
  hsless*|   .0082503      .00141    5.83   0.000   .005478  .011022   .363339
 college*|  -.0072368      .00177   -4.10   0.000    -.0107 -.003774   .165612
l2age65l |  -.0001683      .00019   -0.89   0.376  -.000541  .000204   59.8973
l2a~6574 |    .001263      .00022    5.86   0.000    .00084  .001686   3.71316
l2age75p |   .0034944      .00021   16.98   0.000   .003091  .003898   1.37373
l2cancre*|   .0046523      .00234    1.99   0.047   .000066  .009239   .076417
 l2diabe*|   .0148102      .00255    5.80   0.000   .009805  .019816   .083586
l2hearte*|   .0108663      .00179    6.07   0.000   .007356  .014377   .165064
 l2hibpe*|   .0087799      .00135    6.52   0.000   .006141  .011419   .396508
 l2lunge*|    .027711      .00353    7.84   0.000   .020785  .034637   .053496
l2stroke*|   .0214354      .00399    5.38   0.000   .013621   .02925   .034961
  l2adl1*|   .0357852      .00299   11.97   0.000   .029926  .041644   .091388
  l2adl2*|   .0707852      .00583   12.13   0.000   .059351   .08222    .03804
 l2adl3p*|   .1169374      .00799   14.63   0.000   .101274  .132601   .041287
 l2iadl1*|   .1210816      .00467   25.93   0.000   .111928  .130235   .097356
l2iadl2p*|   .2704663      .00879   30.79   0.000   .253247  .287686   .080698
l2logbmi |   .0111801      .00389    2.88   0.004   .003561    .0188   3.32125
l2psyche*|   .0280709      .00285    9.85   0.000   .022485  .033657   .091199
l2arthre*|   .0236907      .00157   15.11   0.000   .020618  .026763    .34434
l2asth~e*|    .006492      .00196    3.32   0.001   .002656  .010328   .124599
l2park~e*|   .0704226      .01535    4.59   0.000   .040345    .1005   .005082
 l2drink*|  -.0121518      .00214   -5.67   0.000  -.016356 -.007948   .886134
l2dr~d_e |  -.0018691      .00027   -6.94   0.000  -.002397 -.001341   2.41245
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as o_iadlstat_mfx.

-------------------------------------------------------------------------------
Model o_iadlstat_mfx (Marginal effects after oprobit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
    iadlstat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
No_IADLs     |
        male |   .0291776   .0034513     8.45   0.000     .0224132     .035942
      hsless |  -.0220412   .0037269    -5.91   0.000    -.0293458   -.0147366
     college |   .0199391   .0049655     4.02   0.000     .0102069    .0296712
    l2age65l |   .0004541   .0005124     0.89   0.376    -.0005503    .0014585
   l2age6574 |  -.0034082   .0005802    -5.87   0.000    -.0045453   -.0022712
    l2age75p |  -.0094297   .0005375   -17.54   0.000    -.0104832   -.0083762
    l2cancre |   -.012353   .0061136    -2.02   0.043    -.0243355   -.0003706
     l2diabe |  -.0380859   .0062545    -6.09   0.000    -.0503445   -.0258274
    l2hearte |  -.0284652   .0045424    -6.27   0.000    -.0373681   -.0195624
     l2hibpe |  -.0234949   .0035572    -6.60   0.000    -.0304668   -.0165229
     l2lunge |  -.0683587   .0079958    -8.55   0.000    -.0840302   -.0526871
    l2stroke |  -.0537236   .0093126    -5.77   0.000     -.071976   -.0354713
      l2adl1 |  -.0869438   .0065375   -13.30   0.000    -.0997571   -.0741305
      l2adl2 |  -.1566599   .0108737   -14.41   0.000    -.1779718   -.1353479
     l2adl3p |   -.237166    .012835   -18.48   0.000    -.2623222   -.2120098
     l2iadl1 |  -.2481828   .0074899   -33.14   0.000    -.2628628   -.2335029
    l2iadl2p |  -.4509975   .0100862   -44.71   0.000    -.4707661   -.4312289
    l2logbmi |  -.0301697    .010482    -2.88   0.004    -.0507139   -.0096254
    l2psyche |  -.0695837   .0064912   -10.72   0.000    -.0823062   -.0568612
    l2arthre |  -.0617719   .0038608   -16.00   0.000    -.0693389   -.0542049
   l2asthmae |  -.0171723   .0050712    -3.39   0.001    -.0271116    -.007233
   l2parkine |  -.1547103   .0284755    -5.43   0.000    -.2105212   -.0988993
     l2drink |   .0315859   .0053603     5.89   0.000     .0210799     .042092
  l2drinkd_e |   .0050439   .0007244     6.96   0.000     .0036241    .0064637
-------------+----------------------------------------------------------------
1_IADL       |
        male |   -.018412   .0021923    -8.40   0.000    -.0227088   -.0141151
      hsless |   .0137908   .0023228     5.94   0.000     .0092382    .0183435
     college |  -.0127022   .0032049    -3.96   0.000    -.0189837   -.0064208
    l2age65l |  -.0002858   .0003226    -0.89   0.376    -.0009181    .0003464
   l2age6574 |   .0021452   .0003662     5.86   0.000     .0014275    .0028629
    l2age75p |   .0059353   .0003446    17.22   0.000     .0052598    .0066108
    l2cancre |   .0077007   .0037754     2.04   0.041      .000301    .0151004
     l2diabe |   .0232758   .0037186     6.26   0.000     .0159875     .030564
    l2hearte |   .0175989    .002765     6.36   0.000     .0121796    .0230183
     l2hibpe |   .0147149   .0022228     6.62   0.000     .0103582    .0190716
     l2lunge |   .0406477   .0045068     9.02   0.000     .0318145    .0494809
    l2stroke |   .0322882   .0053493     6.04   0.000     .0218039    .0427726
      l2adl1 |   .0511586   .0036358    14.07   0.000     .0440325    .0582847
      l2adl2 |   .0858747   .0052104    16.48   0.000     .0756626    .0960868
     l2adl3p |   .1202285   .0051835    23.19   0.000     .1100691     .130388
     l2iadl1 |   .1271013    .003422    37.14   0.000     .1203943    .1338082
    l2iadl2p |   .1805312   .0030786    58.64   0.000     .1744973    .1865651
    l2logbmi |   .0189896   .0066005     2.88   0.004     .0060528    .0319264
    l2psyche |   .0415128   .0036979    11.23   0.000     .0342649    .0487606
    l2arthre |   .0380812   .0023691    16.07   0.000     .0334379    .0427245
   l2asthmae |   .0106803   .0031186     3.42   0.001      .004568    .0167926
   l2parkine |   .0842877   .0131938     6.39   0.000     .0584282    .1101471
     l2drink |  -.0194341   .0032299    -6.02   0.000    -.0257646   -.0131036
  l2drinkd_e |  -.0031748   .0004577    -6.94   0.000    -.0040718   -.0022777
-------------+----------------------------------------------------------------
2_or_more_~s |
        male |  -.0107656   .0012785    -8.42   0.000    -.0132715   -.0082598
      hsless |   .0082503   .0014143     5.83   0.000     .0054783    .0110223
     college |  -.0072368    .001767    -4.10   0.000    -.0107001   -.0037736
    l2age65l |  -.0001683   .0001899    -0.89   0.376    -.0005405    .0002039
   l2age6574 |    .001263   .0002156     5.86   0.000     .0008405    .0016856
    l2age75p |   .0034944   .0002058    16.98   0.000     .0030911    .0038977
    l2cancre |   .0046523   .0023402     1.99   0.047     .0000657     .009239
     l2diabe |   .0148102   .0025539     5.80   0.000     .0098047    .0198157
    l2hearte |   .0108663   .0017912     6.07   0.000     .0073556    .0143771
     l2hibpe |   .0087799   .0013466     6.52   0.000     .0061407    .0114192
     l2lunge |    .027711   .0035337     7.84   0.000     .0207851    .0346369
    l2stroke |   .0214354   .0039872     5.38   0.000     .0136207    .0292501
      l2adl1 |   .0357852   .0029893    11.97   0.000     .0299262    .0416442
      l2adl2 |   .0707852   .0058339    12.13   0.000     .0593509    .0822195
     l2adl3p |   .1169374   .0079915    14.63   0.000     .1012743    .1326006
     l2iadl1 |   .1210816   .0046701    25.93   0.000     .1119283    .1302348
    l2iadl2p |   .2704663   .0087856    30.79   0.000     .2532469    .2876858
    l2logbmi |   .0111801   .0038876     2.88   0.004     .0035605    .0187997
    l2psyche |   .0280709   .0028502     9.85   0.000     .0224847    .0336572
    l2arthre |   .0236907   .0015677    15.11   0.000      .020618    .0267634
   l2asthmae |    .006492   .0019571     3.32   0.001     .0026561     .010328
   l2parkine |   .0704226   .0153459     4.59   0.000     .0403451       .1005
     l2drink |  -.0121518   .0021449    -5.67   0.000    -.0163558   -.0079479
  l2drinkd_e |  -.0018691   .0002695    -6.94   0.000    -.0023973    -.001341
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/iadlstat.st
> er saved

Iteration 0:   log likelihood = -100363.06  
Iteration 1:   log likelihood = -98432.843  
Iteration 2:   log likelihood = -98432.244  
Iteration 3:   log likelihood = -98432.244  

Ordered probit regression                       Number of obs     =     53,344
                                                LR chi2(14)       =    3861.63
                                                Prob > chi2       =     0.0000
Log likelihood = -98432.244                     Pseudo R2         =     0.0192

------------------------------------------------------------------------------
    drinkd_e |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .3274373   .0095302    34.36   0.000     .3087584    .3461162
      hsless |  -.1839504   .0105764   -17.39   0.000    -.2046798   -.1632211
     college |   .2317054   .0132714    17.46   0.000     .2056941    .2577168
    l2age65l |    .006357   .0012842     4.95   0.000       .00384     .008874
   l2age6574 |    -.01005   .0016669    -6.03   0.000    -.0133172   -.0067829
    l2age75p |  -.0010794   .0017278    -0.62   0.532    -.0044658     .002307
    l2hearte |   -.074853   .0128961    -5.80   0.000    -.1001289    -.049577
    l2stroke |  -.0375434   .0246981    -1.52   0.128    -.0859508    .0108639
    l2cancre |   .0267622   .0177041     1.51   0.131    -.0079373    .0614616
     l2hibpe |   .0144762   .0100615     1.44   0.150    -.0052439    .0341963
     l2diabe |  -.2835427   .0174613   -16.24   0.000    -.3177663   -.2493192
    l2logbmi |  -.5081502   .0308458   -16.47   0.000    -.5686068   -.4476936
    l2psyche |  -.0711344   .0163055    -4.36   0.000    -.1030926   -.0391762
 l2modex_reg |   .1575113   .0117586    13.40   0.000     .1344648    .1805577
-------------+----------------------------------------------------------------
       /cut1 |  -1.569542   .1279992                     -1.820416   -1.318668
       /cut2 |  -1.230186   .1279604                     -1.480984   -.9793881
       /cut3 |  -.8736052   .1279263                     -1.124336   -.6228743
       /cut4 |  -.5921356   .1279103                     -.8428352    -.341436
       /cut5 |  -.3596484   .1279048                     -.6103371   -.1089596
       /cut6 |  -.1392728   .1279099                     -.3899716    .1114261
       /cut7 |   .0892446   .1279299                     -.1614934    .3399826
------------------------------------------------------------------------------

Frequencies for drinkd_e...


# Days/week |
has a drink |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,387       34.47       34.47
          1 |      6,654       12.47       46.94
          2 |      7,169       13.44       60.38
          3 |      5,285        9.91       70.29
          4 |      3,863        7.24       77.53
          5 |      3,128        5.86       83.39
          6 |      2,649        4.97       88.36
          7 |      6,209       11.64      100.00
------------+-----------------------------------
      Total |     53,344      100.00

Computing marginal effects after oprobit for drinkd_e == 0...


Marginal effects after oprobit
      y  = Pr(drinkd_e==0) (predict, o(0))
         =  .33871579
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|  -.1183654       .0034  -34.84   0.000  -.125024 -.111707   .439393
  hsless*|   .0678411      .00393   17.27   0.000   .060143  .075539   .377118
 college*|  -.0816686      .00448  -18.22   0.000  -.090455 -.072883   .161911
l2age65l |  -.0023259      .00047   -4.95   0.000  -.003247 -.001405   59.8936
l2a~6574 |   .0036771      .00061    6.03   0.000   .002482  .004873   3.79902
l2age75p |   .0003949      .00063    0.62   0.532  -.000844  .001634   1.52465
l2hearte*|   .0276562      .00481    5.75   0.000    .01823  .037082   .169785
l2stroke*|   .0138325      .00916    1.51   0.131  -.004124  .031789   .040473
l2cancre*|  -.0097448      .00642   -1.52   0.129  -.022318  .002828   .076597
 l2hibpe*|  -.0052933      .00368   -1.44   0.150    -.0125  .001913   .400345
 l2diabe*|   .1078379      .00683   15.78   0.000   .094446   .12123   .088032
l2logbmi |   .1859212      .01129   16.47   0.000   .163793   .20805   3.32178
l2psyche*|   .0263264       .0061    4.32   0.000    .01437  .038283   .092531
l2mode~g*|  -.0585118      .00443  -13.21   0.000  -.067191 -.049833    .75793
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for drinkd_e == 1...


Marginal effects after oprobit
      y  = Pr(drinkd_e==1) (predict, o(1))
         =  .13074934
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|  -.0110837      .00042  -26.38   0.000  -.011907  -.01026   .439393
  hsless*|   .0053347      .00031   17.35   0.000   .004732  .005937   .377118
 college*|  -.0094665      .00068  -13.93   0.000  -.010799 -.008134   .161911
l2age65l |  -.0002028      .00004   -4.91   0.000  -.000284 -.000122   59.8936
l2a~6574 |   .0003205      .00005    5.97   0.000   .000215  .000426   3.79902
l2age75p |   .0000344      .00006    0.62   0.532  -.000074  .000142   1.52465
l2hearte*|   .0021587      .00034    6.41   0.000   .001499  .002819   .169785
l2stroke*|   .0011179      .00068    1.64   0.102  -.000221  .002457   .040473
l2cancre*|  -.0008902      .00061   -1.45   0.147  -.002092  .000312   .076597
 l2hibpe*|  -.0004642      .00032   -1.43   0.153    -.0011  .000172   .400345
 l2diabe*|    .004811       .0002   23.64   0.000   .004412   .00521   .088032
l2logbmi |   .0162073      .00106   15.32   0.000   .014133  .018281   3.32178
l2psyche*|   .0020139      .00041    4.96   0.000   .001218  .002809   .092531
l2mode~g*|  -.0042206      .00028  -15.12   0.000  -.004768 -.003674    .75793
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for drinkd_e == 2...


Marginal effects after oprobit
      y  = Pr(drinkd_e==2) (predict, o(2))
         =  .14078319
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|     .00369      .00025   14.70   0.000   .003198  .004182   .439393
  hsless*|  -.0031633      .00025  -12.46   0.000  -.003661 -.002666   .377118
 college*|   .0007519       .0002    3.83   0.000   .000367  .001137   .161911
l2age65l |     .00009      .00002    4.80   0.000   .000053  .000127   59.8936
l2a~6574 |  -.0001423      .00002   -5.73   0.000  -.000191 -.000094   3.79902
l2age75p |  -.0000153      .00002   -0.62   0.532  -.000063  .000033   1.52465
l2hearte*|  -.0013133      .00028   -4.77   0.000  -.001853 -.000773   .169785
l2stroke*|  -.0006207      .00047   -1.33   0.184  -.001537  .000296   .040473
l2cancre*|   .0003371       .0002    1.72   0.086  -.000047  .000722   .076597
 l2hibpe*|   .0002021      .00014    1.46   0.145   -.00007  .000474   .400345
 l2diabe*|  -.0083888       .0008  -10.46   0.000   -.00996 -.006818   .088032
l2logbmi |   -.007197      .00058  -12.47   0.000  -.008328 -.006066   3.32178
l2psyche*|  -.0012896      .00036   -3.54   0.000  -.002003 -.000576   .092531
l2mode~g*|   .0030975      .00032    9.72   0.000   .002473  .003722    .75793
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for drinkd_e == 3...


Marginal effects after oprobit
      y  = Pr(drinkd_e==3) (predict, o(3))
         =  .10250147
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0133052      .00044   30.25   0.000   .012443  .014167   .439393
  hsless*|  -.0081912      .00051  -16.11   0.000  -.009188 -.007195   .377118
 college*|   .0082679      .00041   20.24   0.000   .007467  .009069   .161911
l2age65l |   .0002723      .00006    4.93   0.000   .000164  .000381   59.8936
l2a~6574 |  -.0004305      .00007   -5.99   0.000  -.000571  -.00029   3.79902
l2age75p |  -.0000462      .00007   -0.62   0.532  -.000191  .000099   1.52465
l2hearte*|  -.0033569      .00061   -5.54   0.000  -.004545 -.002168   .169785
l2stroke*|  -.0016617      .00113   -1.47   0.141  -.003873  .000549   .040473
l2cancre*|   .0011207      .00072    1.55   0.122  -.000299  .002541   .076597
 l2hibpe*|   .0006184      .00043    1.44   0.149  -.000222  .001459   .400345
 l2diabe*|   -.014548      .00105  -13.90   0.000    -.0166 -.012496   .088032
l2logbmi |  -.0217684      .00138  -15.76   0.000  -.024476 -.019061   3.32178
l2psyche*|  -.0032148      .00078   -4.14   0.000  -.004736 -.001693   .092531
l2mode~g*|   .0072479      .00059   12.29   0.000   .006092  .008404    .75793
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for drinkd_e == 4...


Marginal effects after oprobit
      y  = Pr(drinkd_e==4) (predict, o(4))
         =  .07363012
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0158165      .00052   30.38   0.000   .014796  .016837   .439393
  hsless*|  -.0092642      .00056  -16.52   0.000  -.010363 -.008165   .377118
 college*|    .010636      .00058   18.21   0.000   .009491  .011781   .161911
l2age65l |   .0003158      .00006    4.93   0.000    .00019  .000441   59.8936
l2a~6574 |  -.0004992      .00008   -6.00   0.000  -.000662 -.000336   3.79902
l2age75p |  -.0000536      .00009   -0.62   0.532  -.000222  .000115   1.52465
l2hearte*|  -.0037867      .00067   -5.68   0.000  -.005093 -.002481   .169785
l2stroke*|  -.0018897      .00126   -1.50   0.133  -.004358  .000578   .040473
l2cancre*|    .001317      .00086    1.53   0.127  -.000375  .003009   .076597
 l2hibpe*|   .0007182       .0005    1.44   0.150  -.000259  .001696   .400345
 l2diabe*|  -.0150383      .00099  -15.12   0.000  -.016988 -.013089   .088032
l2logbmi |  -.0252415      .00159  -15.83   0.000  -.028367 -.022116   3.32178
l2psyche*|  -.0036099      .00085   -4.27   0.000  -.005268 -.001952   .092531
l2mode~g*|   .0080417      .00063   12.79   0.000    .00681  .009274    .75793
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for drinkd_e == 5...


Marginal effects after oprobit
      y  = Pr(drinkd_e==5) (predict, o(5))
         =  .05839998
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0169726      .00057   29.80   0.000   .015856  .018089   .439393
  hsless*|  -.0096838      .00058  -16.65   0.000  -.010823 -.008544   .377118
 college*|   .0118444      .00069   17.25   0.000   .010499   .01319   .161911
l2age65l |   .0003343      .00007    4.93   0.000   .000201  .000467   59.8936
l2a~6574 |  -.0005285      .00009   -6.00   0.000  -.000701 -.000356   3.79902
l2age75p |  -.0000568      .00009   -0.62   0.532  -.000235  .000121   1.52465
l2hearte*|  -.0039517      .00069   -5.76   0.000  -.005297 -.002607   .169785
l2stroke*|  -.0019804      .00131   -1.52   0.130  -.004542  .000581   .040473
l2cancre*|   .0014038      .00093    1.52   0.130  -.000412   .00322   .076597
 l2hibpe*|    .000761      .00053    1.44   0.150  -.000276  .001798   .400345
 l2diabe*|  -.0149552      .00094  -15.87   0.000  -.016803 -.013108   .088032
l2logbmi |   -.026722      .00169  -15.79   0.000  -.030039 -.023405   3.32178
l2psyche*|  -.0037579      .00087   -4.34   0.000  -.005456 -.002059   .092531
l2mode~g*|   .0083194      .00064   13.04   0.000   .007069   .00957    .75793
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for drinkd_e == 6...


Marginal effects after oprobit
      y  = Pr(drinkd_e==6) (predict, o(6))
         =  .04825231
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0176906      .00061   29.16   0.000   .016501   .01888   .439393
  hsless*|  -.0098924      .00059  -16.72   0.000  -.011052 -.008733   .377118
 college*|   .0126738      .00076   16.60   0.000   .011177   .01417   .161911
l2age65l |   .0003447      .00007    4.93   0.000   .000208  .000482   59.8936
l2a~6574 |  -.0005449      .00009   -6.00   0.000  -.000723 -.000367   3.79902
l2age75p |  -.0000585      .00009   -0.62   0.532  -.000242  .000125   1.52465
l2hearte*|   -.004031      .00069   -5.82   0.000  -.005389 -.002672   .169785
l2stroke*|  -.0020265      .00133   -1.53   0.127  -.004628  .000575   .040473
l2cancre*|   .0014547      .00097    1.51   0.132  -.000437  .003346   .076597
 l2hibpe*|   .0007851      .00055    1.44   0.151  -.000285  .001855   .400345
 l2diabe*|  -.0147056      .00089  -16.45   0.000  -.016457 -.012954   .088032
l2logbmi |  -.0275515      .00175  -15.74   0.000  -.030982 -.024121   3.32178
l2psyche*|  -.0038262      .00087   -4.39   0.000  -.005535 -.002117   .092531
l2mode~g*|   .0084316      .00064   13.21   0.000   .007181  .009682    .75793
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for drinkd_e == 7...


Marginal effects after oprobit
      y  = Pr(drinkd_e==7) (predict, o(7))
         =  .10696781
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0619742       .0019   32.61   0.000   .058249  .065699   .439393
  hsless*|  -.0329809      .00186  -17.73   0.000  -.036627 -.029335   .377118
 college*|   .0469608      .00295   15.92   0.000   .041178  .052744   .161911
l2age65l |   .0011715      .00024    4.95   0.000   .000707  .001636   59.8936
l2a~6574 |  -.0018521      .00031   -6.02   0.000  -.002455 -.001249   3.79902
l2age75p |  -.0001989      .00032   -0.62   0.532  -.000823  .000425   1.52465
l2hearte*|  -.0133753      .00224   -5.98   0.000  -.017756 -.008995   .169785
l2stroke*|  -.0067714      .00436   -1.55   0.120  -.015314  .001771   .040473
l2cancre*|   .0050018      .00336    1.49   0.136  -.001574  .011578   .076597
 l2hibpe*|   .0026726      .00186    1.44   0.151  -.000975   .00632   .400345
 l2diabe*|  -.0450132      .00238  -18.93   0.000  -.049673 -.040353   .088032
l2logbmi |   -.093648      .00572  -16.37   0.000  -.104857 -.082439   3.32178
l2psyche*|   -.012642      .00279   -4.53   0.000  -.018117 -.007167   .092531
l2mode~g*|   .0275944      .00197   14.03   0.000    .02374  .031448    .75793
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as o_drinkd_e_mfx.

-------------------------------------------------------------------------------
Model o_drinkd_e_mfx (Marginal effects after oprobit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
    drinkd_e |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
0            |
        male |  -.1183654   .0033972   -34.84   0.000    -.1250238    -.111707
      hsless |   .0678411   .0039276    17.27   0.000     .0601431    .0755391
     college |  -.0816686   .0044827   -18.22   0.000    -.0904546   -.0728825
    l2age65l |  -.0023259   .0004699    -4.95   0.000    -.0032468    -.001405
   l2age6574 |   .0036771   .0006099     6.03   0.000     .0024816    .0048725
    l2age75p |   .0003949   .0006322     0.62   0.532    -.0008441    .0016339
    l2hearte |   .0276562   .0048092     5.75   0.000     .0182304     .037082
    l2stroke |   .0138325   .0091615     1.51   0.131    -.0041237    .0317887
    l2cancre |  -.0097448    .006415    -1.52   0.129     -.022318    .0028284
     l2hibpe |  -.0052933   .0036767    -1.44   0.150    -.0124996     .001913
     l2diabe |   .1078379   .0068326    15.78   0.000     .0944463    .1212295
    l2logbmi |   .1859212   .0112903    16.47   0.000     .1637927    .2080497
    l2psyche |   .0263264   .0061003     4.32   0.000     .0143701    .0382827
 l2modex_reg |  -.0585118   .0044281   -13.21   0.000    -.0671907    -.049833
-------------+----------------------------------------------------------------
1            |
        male |  -.0110837   .0004202   -26.38   0.000    -.0119073   -.0102601
      hsless |   .0053347   .0003075    17.35   0.000      .004732    .0059374
     college |  -.0094665   .0006798   -13.93   0.000    -.0107988   -.0081341
    l2age65l |  -.0002028   .0000413    -4.91   0.000    -.0002836   -.0001219
   l2age6574 |   .0003205   .0000537     5.97   0.000     .0002152    .0004258
    l2age75p |   .0000344   .0000551     0.62   0.532    -.0000736    .0001424
    l2hearte |   .0021587   .0003367     6.41   0.000     .0014987    .0028186
    l2stroke |   .0011179   .0006832     1.64   0.102    -.0002212     .002457
    l2cancre |  -.0008902   .0006134    -1.45   0.147    -.0020925     .000312
     l2hibpe |  -.0004642   .0003246    -1.43   0.153    -.0011005     .000172
     l2diabe |    .004811   .0002035    23.64   0.000     .0044121      .00521
    l2logbmi |   .0162073   .0010582    15.32   0.000     .0141332    .0182814
    l2psyche |   .0020139   .0004059     4.96   0.000     .0012184    .0028095
 l2modex_reg |  -.0042206   .0002791   -15.12   0.000    -.0047676   -.0036736
-------------+----------------------------------------------------------------
2            |
        male |     .00369    .000251    14.70   0.000     .0031981    .0041819
      hsless |  -.0031633   .0002539   -12.46   0.000    -.0036609   -.0026657
     college |   .0007519   .0001964     3.83   0.000     .0003671    .0011368
    l2age65l |     .00009   .0000188     4.80   0.000     .0000532    .0001268
   l2age6574 |  -.0001423   .0000248    -5.73   0.000     -.000191   -.0000937
    l2age75p |  -.0000153   .0000245    -0.62   0.532    -.0000633    .0000327
    l2hearte |  -.0013133   .0002754    -4.77   0.000    -.0018531   -.0007735
    l2stroke |  -.0006207   .0004675    -1.33   0.184    -.0015369    .0002955
    l2cancre |   .0003371   .0001962     1.72   0.086    -.0000474    .0007217
     l2hibpe |   .0002021   .0001389     1.46   0.145      -.00007    .0004743
     l2diabe |  -.0083888   .0008017   -10.46   0.000    -.0099602   -.0068175
    l2logbmi |   -.007197   .0005772   -12.47   0.000    -.0083284   -.0060657
    l2psyche |  -.0012896   .0003639    -3.54   0.000    -.0020028   -.0005764
 l2modex_reg |   .0030975   .0003187     9.72   0.000     .0024729    .0037222
-------------+----------------------------------------------------------------
3            |
        male |   .0133052   .0004399    30.25   0.000     .0124431    .0141673
      hsless |  -.0081912   .0005084   -16.11   0.000    -.0091877   -.0071947
     college |   .0082679   .0004086    20.24   0.000     .0074671    .0090688
    l2age65l |   .0002723   .0000552     4.93   0.000     .0001641    .0003806
   l2age6574 |  -.0004305   .0000719    -5.99   0.000    -.0005715   -.0002896
    l2age75p |  -.0000462    .000074    -0.62   0.532    -.0001913    .0000988
    l2hearte |  -.0033569   .0006064    -5.54   0.000    -.0045454   -.0021684
    l2stroke |  -.0016617   .0011281    -1.47   0.141    -.0038727    .0005493
    l2cancre |   .0011207   .0007244     1.55   0.122    -.0002992    .0025406
     l2hibpe |   .0006184   .0004287     1.44   0.149    -.0002218    .0014586
     l2diabe |   -.014548   .0010468   -13.90   0.000    -.0165996   -.0124963
    l2logbmi |  -.0217684   .0013812   -15.76   0.000    -.0244756   -.0190613
    l2psyche |  -.0032148   .0007762    -4.14   0.000    -.0047361   -.0016935
 l2modex_reg |   .0072479   .0005899    12.29   0.000     .0060917     .008404
-------------+----------------------------------------------------------------
4            |
        male |   .0158165   .0005207    30.38   0.000      .014796     .016837
      hsless |  -.0092642   .0005608   -16.52   0.000    -.0103634    -.008165
     college |    .010636    .000584    18.21   0.000     .0094915    .0117806
    l2age65l |   .0003158    .000064     4.93   0.000     .0001903    .0004413
   l2age6574 |  -.0004992   .0000832    -6.00   0.000    -.0006624   -.0003361
    l2age75p |  -.0000536   .0000858    -0.62   0.532    -.0002218    .0001146
    l2hearte |  -.0037867   .0006664    -5.68   0.000    -.0050929   -.0024805
    l2stroke |  -.0018897   .0012592    -1.50   0.133    -.0043577    .0005783
    l2cancre |    .001317   .0008632     1.53   0.127    -.0003748    .0030087
     l2hibpe |   .0007182   .0004988     1.44   0.150    -.0002593    .0016958
     l2diabe |  -.0150383   .0009946   -15.12   0.000    -.0169876   -.0130889
    l2logbmi |  -.0252415   .0015948   -15.83   0.000    -.0283673   -.0221157
    l2psyche |  -.0036099   .0008458    -4.27   0.000    -.0052676   -.0019521
 l2modex_reg |   .0080417   .0006287    12.79   0.000     .0068095    .0092739
-------------+----------------------------------------------------------------
5            |
        male |   .0169726   .0005696    29.80   0.000     .0158562    .0180891
      hsless |  -.0096838   .0005815   -16.65   0.000    -.0108234   -.0085441
     college |   .0118444   .0006866    17.25   0.000     .0104986    .0131902
    l2age65l |   .0003343   .0000678     4.93   0.000     .0002014    .0004672
   l2age6574 |  -.0005285   .0000881    -6.00   0.000    -.0007012   -.0003558
    l2age75p |  -.0000568   .0000909    -0.62   0.532    -.0002349    .0001213
    l2hearte |  -.0039517   .0006862    -5.76   0.000    -.0052966   -.0026068
    l2stroke |  -.0019804   .0013067    -1.52   0.130    -.0045415    .0005807
    l2cancre |   .0014038   .0009265     1.52   0.130    -.0004121    .0032196
     l2hibpe |    .000761    .000529     1.44   0.150    -.0002757    .0017977
     l2diabe |  -.0149552   .0009425   -15.87   0.000    -.0168025   -.0131078
    l2logbmi |   -.026722   .0016924   -15.79   0.000    -.0300391   -.0234049
    l2psyche |  -.0037579   .0008666    -4.34   0.000    -.0054564   -.0020595
 l2modex_reg |   .0083194   .0006381    13.04   0.000     .0070687      .00957
-------------+----------------------------------------------------------------
6            |
        male |   .0176906   .0006067    29.16   0.000     .0165014    .0188797
      hsless |  -.0098924   .0005916   -16.72   0.000    -.0110519   -.0087329
     college |   .0126738   .0007635    16.60   0.000     .0111774    .0141702
    l2age65l |   .0003447   .0000699     4.93   0.000     .0002076    .0004817
   l2age6574 |  -.0005449   .0000909    -6.00   0.000     -.000723   -.0003668
    l2age75p |  -.0000585   .0000937    -0.62   0.532    -.0002421    .0001251
    l2hearte |   -.004031   .0006931    -5.82   0.000    -.0053894   -.0026725
    l2stroke |  -.0020265   .0013272    -1.53   0.127    -.0046279    .0005748
    l2cancre |   .0014547    .000965     1.51   0.132    -.0004367    .0033461
     l2hibpe |   .0007851   .0005461     1.44   0.151    -.0002852    .0018555
     l2diabe |  -.0147056   .0008937   -16.45   0.000    -.0164572   -.0129539
    l2logbmi |  -.0275515   .0017501   -15.74   0.000    -.0309817   -.0241213
    l2psyche |  -.0038262   .0008718    -4.39   0.000     -.005535   -.0021175
 l2modex_reg |   .0084316   .0006381    13.21   0.000      .007181    .0096821
-------------+----------------------------------------------------------------
7            |
        male |   .0619742   .0019006    32.61   0.000      .058249    .0656994
      hsless |  -.0329809   .0018601   -17.73   0.000    -.0366267   -.0293351
     college |   .0469608   .0029504    15.92   0.000     .0411781    .0527436
    l2age65l |   .0011715   .0002368     4.95   0.000     .0007075    .0016356
   l2age6574 |  -.0018521   .0003075    -6.02   0.000    -.0024549   -.0012494
    l2age75p |  -.0001989   .0003184    -0.62   0.532     -.000823    .0004252
    l2hearte |  -.0133753   .0022351    -5.98   0.000    -.0177559   -.0089946
    l2stroke |  -.0067714   .0043584    -1.55   0.120    -.0153136    .0017708
    l2cancre |   .0050018   .0033552     1.49   0.136    -.0015744    .0115779
     l2hibpe |   .0026726    .001861     1.44   0.151    -.0009748    .0063201
     l2diabe |  -.0450132   .0023777   -18.93   0.000    -.0496733    -.040353
    l2logbmi |   -.093648   .0057191   -16.37   0.000    -.1048572   -.0824387
    l2psyche |   -.012642   .0027935    -4.53   0.000    -.0181172   -.0071668
 l2modex_reg |   .0275944   .0019664    14.03   0.000     .0237404    .0314485
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/drinkd_e.st
> er saved

Iteration 0:   log likelihood = -54570.888  
Iteration 1:   log likelihood = -49952.147  
Iteration 2:   log likelihood = -49838.122  
Iteration 3:   log likelihood = -49837.826  
Iteration 4:   log likelihood = -49837.826  

Ordered probit regression                       Number of obs     =     51,540
                                                LR chi2(24)       =    9466.12
                                                Prob > chi2       =     0.0000
Log likelihood = -49837.826                     Pseudo R2         =     0.0867

------------------------------------------------------------------------------
    vgactx_e |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |  -.2407464   .0115965   -20.76   0.000    -.2634751   -.2180177
      hsless |   .1416974   .0128529    11.02   0.000     .1165062    .1668886
     college |  -.2162997   .0151313   -14.29   0.000    -.2459565   -.1866429
    l2age65l |     .00295   .0014782     2.00   0.046     .0000527    .0058472
   l2age6574 |   .0287212   .0020322    14.13   0.000     .0247381    .0327042
    l2age75p |    .060268   .0027563    21.87   0.000     .0548657    .0656702
    l2cancre |   .0086502    .021929     0.39   0.693    -.0343299    .0516303
     l2diabe |   .2933515    .022932    12.79   0.000     .2484057    .3382973
    l2hearte |   .0743257   .0164045     4.53   0.000     .0421734    .1064779
     l2hibpe |   .1070418   .0121797     8.79   0.000     .0831701    .1309135
     l2lunge |   .2870634   .0297537     9.65   0.000     .2287472    .3453796
    l2stroke |   .1478147   .0364511     4.06   0.000     .0763718    .2192575
      l2adl1 |   .2353148    .023322    10.09   0.000     .1896045     .281025
      l2adl2 |   .3025517   .0398297     7.60   0.000      .224487    .3806165
     l2adl3p |   .3783507   .0461452     8.20   0.000     .2879078    .4687936
     l2iadl1 |   .3461796   .0229596    15.08   0.000     .3011795    .3911796
    l2iadl2p |   .6558953   .0346786    18.91   0.000     .5879265    .7238642
    l2logbmi |   .7454569    .037498    19.88   0.000     .6719623    .8189515
    l2psyche |   .0798243   .0199747     4.00   0.000     .0406745    .1189741
    l2arthre |    .089668   .0130227     6.89   0.000      .064144    .1151919
   l2asthmae |   .0574951   .0175981     3.27   0.001     .0230035    .0919866
   l2parkine |   .2879904   .0971405     2.96   0.003     .0975985    .4783822
    l2smokev |  -.0023592   .0121772    -0.19   0.846    -.0262261    .0215076
    l2smoken |   .4140993   .0181184    22.86   0.000     .3785879    .4496107
-------------+----------------------------------------------------------------
       /cut1 |   2.059688   .1523558                      1.761076      2.3583
       /cut2 |   2.404523   .1524279                       2.10577    2.703276
       /cut3 |   2.714187   .1524965                      2.415299    3.013074
------------------------------------------------------------------------------

Frequencies for vgactx_e...


  Number of times done |
 vigorous exercise per |
                  week |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
        2.> 1 per week |      9,723       18.86       18.86
          3.1 per week |      4,818        9.35       28.21
         4.1-3 per mon |      5,010        9.72       37.93
5.hardly ever or never |     31,989       62.07      100.00
-----------------------+-----------------------------------
                 Total |     51,540      100.00

Computing marginal effects after oprobit for vgactx_e == 2...


Marginal effects after oprobit
      y  = Pr(vgactx_e==2) (predict, o(2))
         =  .14718971
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0563065      .00276   20.39   0.000   .050894  .061719   .437815
  hsless*|  -.0320023      .00285  -11.23   0.000  -.037586 -.026418    .37109
 college*|   .0535924      .00402   13.32   0.000   .045707  .061478   .164222
l2age65l |  -.0006792      .00034   -2.00   0.046  -.001346 -.000012   59.8628
l2a~6574 |  -.0066124      .00047  -14.07   0.000  -.007533 -.005691    3.7239
l2age75p |  -.0138754      .00063  -22.09   0.000  -.015107 -.012644   1.44433
l2cancre*|  -.0019839      .00501   -0.40   0.692  -.011803  .007835   .076193
 l2diabe*|  -.0591234      .00399  -14.82   0.000  -.066941 -.051306    .08702
l2hearte*|  -.0166682      .00358   -4.65   0.000  -.023687 -.009649   .166376
 l2hibpe*|  -.0243662      .00274   -8.88   0.000  -.029743 -.018989   .398933
 l2lunge*|  -.0573879      .00508  -11.31   0.000  -.067337 -.047439   .053842
l2stroke*|  -.0316171      .00721   -4.39   0.000  -.045739 -.017496   .038805
  l2adl1*|  -.0487912      .00432  -11.30   0.000  -.057253 -.040329   .091541
  l2adl2*|  -.0596977      .00659   -9.06   0.000  -.072615 -.046781   .039406
 l2adl3p*|  -.0718382      .00699  -10.28   0.000   -.08553 -.058146   .044393
 l2iadl1*|  -.0683277      .00382  -17.88   0.000  -.075818 -.060837    .09707
l2iadl2p*|  -.1112145        .004  -27.78   0.000  -.119061 -.103368   .089503
l2logbmi |  -.1716259      .00866  -19.81   0.000  -.188606 -.154645   3.32196
l2psyche*|  -.0177538      .00429   -4.14   0.000   -.02616 -.009347   .092996
l2arthre*|  -.0203445      .00291   -6.98   0.000  -.026054 -.014635   .345033
l2asth~e*|  -.0129384      .00387   -3.34   0.001  -.020522 -.005355   .125068
l2park~e*|  -.0566064      .01593   -3.55   0.000  -.087832 -.025381   .005239
l2smokev*|    .000543       .0028    0.19   0.846  -.004949  .006035   .617171
l2smoken*|   -.080984      .00298  -27.15   0.000   -.08683 -.075138   .142472
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for vgactx_e == 3...


Marginal effects after oprobit
      y  = Pr(vgactx_e==3) (predict, o(3))
         =  .09361136
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0193605      .00096   20.14   0.000   .017476  .021245   .437815
  hsless*|  -.0115393      .00106  -10.88   0.000  -.013618  -.00946    .37109
 college*|   .0170344      .00117   14.55   0.000    .01474  .019329   .164222
l2age65l |  -.0002396      .00012   -1.99   0.046  -.000475 -4.2e-06   59.8628
l2a~6574 |  -.0023324      .00017  -13.84   0.000  -.002663 -.002002    3.7239
l2age75p |  -.0048943      .00024  -20.76   0.000  -.005356 -.004432   1.44433
l2cancre*|  -.0007032      .00178   -0.39   0.694    -.0042  .002794   .076193
 l2diabe*|  -.0240621      .00189  -12.73   0.000  -.027766 -.020358    .08702
l2hearte*|  -.0060698      .00135   -4.50   0.000  -.008713 -.003427   .166376
 l2hibpe*|  -.0087082        .001   -8.71   0.000  -.010668 -.006749   .398933
 l2lunge*|  -.0235559      .00243   -9.68   0.000  -.028326 -.018786   .053842
l2stroke*|  -.0121437      .00301   -4.03   0.000  -.018051 -.006236   .038805
  l2adl1*|  -.0193292      .00193  -10.01   0.000  -.023113 -.015546   .091541
  l2adl2*|  -.0248076      .00323   -7.68   0.000  -.031138 -.018478   .039406
 l2adl3p*|  -.0308506      .00365   -8.44   0.000  -.038014 -.023687   .044393
 l2iadl1*|  -.0283192      .00188  -15.06   0.000  -.032006 -.024633    .09707
l2iadl2p*|  -.0515984      .00249  -20.71   0.000  -.056482 -.046715   .089503
l2logbmi |  -.0605377      .00318  -19.05   0.000  -.066765 -.054311   3.32196
l2psyche*|  -.0065288      .00165   -3.97   0.000  -.009754 -.003304   .092996
l2arthre*|  -.0073026      .00107   -6.84   0.000  -.009396 -.005209   .345033
l2asth~e*|  -.0046929      .00144   -3.25   0.001  -.007523 -.001862   .125068
l2park~e*|   -.023629      .00785   -3.01   0.003  -.039008  -.00825   .005239
l2smokev*|   .0001916      .00099    0.19   0.846  -.001747   .00213   .617171
l2smoken*|  -.0337283      .00151  -22.41   0.000  -.036679 -.030778   .142472
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for vgactx_e == 4...


Marginal effects after oprobit
      y  = Pr(vgactx_e==4) (predict, o(4))
         =  .10596565
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0135332      .00068   20.04   0.000   .012209  .014857   .437815
  hsless*|  -.0083446      .00078  -10.64   0.000  -.009881 -.006808    .37109
 college*|   .0111766      .00071   15.74   0.000   .009784  .012569   .164222
l2age65l |  -.0001702      .00009   -1.99   0.046  -.000337 -2.9e-06   59.8628
l2a~6574 |  -.0016572      .00012  -13.76   0.000  -.001893 -.001421    3.7239
l2age75p |  -.0034775      .00017  -20.11   0.000  -.003816 -.003139   1.44433
l2cancre*|  -.0005014      .00128   -0.39   0.695  -.003005  .002002   .076193
 l2diabe*|  -.0190295      .00164  -11.59   0.000  -.022246 -.015813    .08702
l2hearte*|  -.0044183      .00101   -4.39   0.000  -.006389 -.002447   .166376
 l2hibpe*|  -.0062528      .00073   -8.60   0.000  -.007678 -.004827   .398933
 l2lunge*|  -.0187351      .00213   -8.78   0.000  -.022915 -.014555   .053842
l2stroke*|  -.0091959      .00242   -3.80   0.000  -.013937 -.004455   .038805
  l2adl1*|  -.0149837      .00162   -9.26   0.000  -.018154 -.011814   .091541
  l2adl2*|  -.0199042      .00287   -6.93   0.000  -.025536 -.014273   .039406
 l2adl3p*|  -.0253595      .00339   -7.48   0.000  -.032006 -.018713   .044393
 l2iadl1*|  -.0227094      .00167  -13.58   0.000  -.025987 -.019432    .09707
l2iadl2p*|  -.0450835      .00257  -17.56   0.000  -.050117  -.04005   .089503
l2logbmi |  -.0430137      .00229  -18.77   0.000  -.047505 -.038522   3.32196
l2psyche*|  -.0047872      .00124   -3.85   0.000  -.007224 -.002351   .092996
l2arthre*|  -.0052597      .00078   -6.74   0.000   -.00679  -.00373   .345033
l2asth~e*|  -.0034056      .00107   -3.18   0.001  -.005503 -.001309   .125068
l2park~e*|  -.0190091      .00701   -2.71   0.007  -.032742 -.005277   .005239
l2smokev*|   .0001362       .0007    0.19   0.846  -.001242  .001514   .617171
l2smoken*|  -.0271965      .00135  -20.13   0.000  -.029844 -.024549   .142472
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for vgactx_e == 5...


Marginal effects after oprobit
      y  = Pr(vgactx_e==5) (predict, o(5))
         =  .65323328
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|  -.0892002       .0043  -20.75   0.000  -.097625 -.080775   .437815
  hsless*|   .0518862      .00466   11.13   0.000   .042748  .061025    .37109
 college*|  -.0818034      .00584  -14.01   0.000  -.093246 -.070361   .164222
l2age65l |   .0010889      .00055    2.00   0.046   .000019  .002158   59.8628
l2a~6574 |   .0106021      .00075   14.12   0.000   .009131  .012074    3.7239
l2age75p |   .0222473      .00101   22.00   0.000   .020265  .024229   1.44433
l2cancre*|   .0031885      .00807    0.40   0.693  -.012631  .019008   .076193
 l2diabe*|   .1022151      .00745   13.73   0.000   .087622  .116808    .08702
l2hearte*|   .0271562      .00593    4.58   0.000   .015537  .038776   .166376
 l2hibpe*|   .0393272      .00445    8.83   0.000   .030602  .048052   .398933
 l2lunge*|   .0996789      .00959   10.40   0.000   .080888   .11847   .053842
l2stroke*|   .0529567      .01263    4.19   0.000    .02821  .077704   .038805
  l2adl1*|   .0831042      .00782   10.63   0.000   .067781  .098428   .091541
  l2adl2*|   .1044094      .01265    8.26   0.000   .079621  .129198   .039406
 l2adl3p*|   .1280483      .01397    9.17   0.000   .100669  .155427   .044393
 l2iadl1*|   .1193563      .00727   16.41   0.000   .105104  .133608    .09707
l2iadl2p*|   .2078964       .0088   23.62   0.000   .190645  .225148   .089503
l2logbmi |   .2751772      .01384   19.88   0.000   .248053  .302301   3.32196
l2psyche*|   .0290698      .00717    4.05   0.000   .015015  .043125   .092996
l2arthre*|   .0329068      .00475    6.93   0.000   .023598  .042215   .345033
l2asth~e*|   .0210369      .00638    3.30   0.001   .008533  .033541   .125068
l2park~e*|   .0992444      .03077    3.23   0.001   .038941  .159548   .005239
l2smokev*|  -.0008708      .00449   -0.19   0.846  -.009679  .007937   .617171
l2smoken*|   .1419088      .00566   25.09   0.000   .130825  .152993   .142472
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as o_vgactx_e_mfx.

-------------------------------------------------------------------------------
Model o_vgactx_e_mfx (Marginal effects after oprobit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
    vgactx_e |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
2_>_1_per_~k |
        male |   .0563065   .0027615    20.39   0.000     .0508941     .061719
      hsless |  -.0320023    .002849   -11.23   0.000    -.0375862   -.0264184
     college |   .0535924   .0040232    13.32   0.000     .0457071    .0614778
    l2age65l |  -.0006792   .0003403    -2.00   0.046    -.0013462   -.0000121
   l2age6574 |  -.0066124   .0004699   -14.07   0.000    -.0075334   -.0056915
    l2age75p |  -.0138754   .0006281   -22.09   0.000    -.0151066   -.0126443
    l2cancre |  -.0019839   .0050099    -0.40   0.692    -.0118032    .0078354
     l2diabe |  -.0591234   .0039886   -14.82   0.000     -.066941   -.0513059
    l2hearte |  -.0166682   .0035813    -4.65   0.000    -.0236874    -.009649
     l2hibpe |  -.0243662   .0027433    -8.88   0.000     -.029743   -.0189893
     l2lunge |  -.0573879    .005076   -11.31   0.000    -.0673366   -.0474391
    l2stroke |  -.0316171    .007205    -4.39   0.000    -.0457386   -.0174955
      l2adl1 |  -.0487912   .0043173   -11.30   0.000     -.057253   -.0403295
      l2adl2 |  -.0596977   .0065905    -9.06   0.000    -.0726149   -.0467805
     l2adl3p |  -.0718382   .0069859   -10.28   0.000    -.0855303   -.0581461
     l2iadl1 |  -.0683277   .0038217   -17.88   0.000    -.0758182   -.0608373
    l2iadl2p |  -.1112145   .0040033   -27.78   0.000    -.1190609   -.1033681
    l2logbmi |  -.1716259   .0086637   -19.81   0.000    -.1886065   -.1546453
    l2psyche |  -.0177538    .004289    -4.14   0.000    -.0261601   -.0093475
    l2arthre |  -.0203445   .0029131    -6.98   0.000     -.026054    -.014635
   l2asthmae |  -.0129384   .0038694    -3.34   0.001    -.0205222   -.0053547
   l2parkine |  -.0566064   .0159319    -3.55   0.000    -.0878323   -.0253805
    l2smokev |    .000543   .0028019     0.19   0.846    -.0049486    .0060347
    l2smoken |   -.080984   .0029828   -27.15   0.000    -.0868301   -.0751378
-------------+----------------------------------------------------------------
3_1_per_week |
        male |   .0193605   .0009615    20.14   0.000     .0174761    .0212449
      hsless |  -.0115393   .0010606   -10.88   0.000    -.0136181   -.0094605
     college |   .0170344   .0011707    14.55   0.000     .0147399    .0193289
    l2age65l |  -.0002396   .0001201    -1.99   0.046     -.000475   -4.16e-06
   l2age6574 |  -.0023324   .0001685   -13.84   0.000    -.0026627   -.0020021
    l2age75p |  -.0048943   .0002358   -20.76   0.000    -.0053565   -.0044321
    l2cancre |  -.0007032   .0017843    -0.39   0.694    -.0042003     .002794
     l2diabe |  -.0240621   .0018899   -12.73   0.000    -.0277663   -.0203579
    l2hearte |  -.0060698   .0013484    -4.50   0.000    -.0087127   -.0034269
     l2hibpe |  -.0087082   .0009998    -8.71   0.000    -.0106679   -.0067486
     l2lunge |  -.0235559   .0024339    -9.68   0.000    -.0283263   -.0187855
    l2stroke |  -.0121437    .003014    -4.03   0.000     -.018051   -.0062364
      l2adl1 |  -.0193292   .0019304   -10.01   0.000    -.0231128   -.0155456
      l2adl2 |  -.0248076   .0032296    -7.68   0.000    -.0311375   -.0184776
     l2adl3p |  -.0308506    .003655    -8.44   0.000    -.0380142    -.023687
     l2iadl1 |  -.0283192   .0018809   -15.06   0.000    -.0320056   -.0246328
    l2iadl2p |  -.0515984   .0024916   -20.71   0.000    -.0564819   -.0467149
    l2logbmi |  -.0605377   .0031771   -19.05   0.000    -.0667647   -.0543108
    l2psyche |  -.0065288   .0016454    -3.97   0.000    -.0097538   -.0033038
    l2arthre |  -.0073026    .001068    -6.84   0.000    -.0093958   -.0052095
   l2asthmae |  -.0046929   .0014442    -3.25   0.001    -.0075234   -.0018624
   l2parkine |   -.023629   .0078466    -3.01   0.003     -.039008   -.0082499
    l2smokev |   .0001916   .0009891     0.19   0.846    -.0017469    .0021301
    l2smoken |  -.0337283   .0015053   -22.41   0.000    -.0366787   -.0307779
-------------+----------------------------------------------------------------
4_1-3_per_~n |
        male |   .0135332   .0006754    20.04   0.000     .0122094    .0148569
      hsless |  -.0083446   .0007841   -10.64   0.000    -.0098815   -.0068077
     college |   .0111766   .0007103    15.74   0.000     .0097845    .0125687
    l2age65l |  -.0001702   .0000853    -1.99   0.046    -.0003375   -2.95e-06
   l2age6574 |  -.0016572   .0001204   -13.76   0.000    -.0018933   -.0014212
    l2age75p |  -.0034775   .0001729   -20.11   0.000    -.0038165   -.0031386
    l2cancre |  -.0005014   .0012771    -0.39   0.695    -.0030045    .0020016
     l2diabe |  -.0190295   .0016413   -11.59   0.000    -.0222465   -.0158126
    l2hearte |  -.0044183   .0010055    -4.39   0.000    -.0063891   -.0024474
     l2hibpe |  -.0062528   .0007273    -8.60   0.000    -.0076783   -.0048274
     l2lunge |  -.0187351   .0021328    -8.78   0.000    -.0229154   -.0145548
    l2stroke |  -.0091959   .0024191    -3.80   0.000    -.0139372   -.0044545
      l2adl1 |  -.0149837   .0016174    -9.26   0.000    -.0181537   -.0118138
      l2adl2 |  -.0199042   .0028732    -6.93   0.000    -.0255356   -.0142728
     l2adl3p |  -.0253595    .003391    -7.48   0.000    -.0320056   -.0187134
     l2iadl1 |  -.0227094   .0016724   -13.58   0.000    -.0259872   -.0194316
    l2iadl2p |  -.0450835   .0025681   -17.56   0.000    -.0501168   -.0400501
    l2logbmi |  -.0430137   .0022918   -18.77   0.000    -.0475055   -.0385219
    l2psyche |  -.0047872   .0012431    -3.85   0.000    -.0072236   -.0023507
    l2arthre |  -.0052597   .0007807    -6.74   0.000    -.0067898   -.0037296
   l2asthmae |  -.0034056   .0010699    -3.18   0.001    -.0055025   -.0013086
   l2parkine |  -.0190091   .0070065    -2.71   0.007    -.0327415   -.0052766
    l2smokev |   .0001362   .0007031     0.19   0.846    -.0012419    .0015143
    l2smoken |  -.0271965    .001351   -20.13   0.000    -.0298444   -.0245487
-------------+----------------------------------------------------------------
5_hardly_e~r |
        male |  -.0892002   .0042986   -20.75   0.000    -.0976254    -.080775
      hsless |   .0518862   .0046626    11.13   0.000     .0427477    .0610247
     college |  -.0818034   .0058381   -14.01   0.000    -.0932459   -.0703609
    l2age65l |   .0010889   .0005457     2.00   0.046     .0000194    .0021585
   l2age6574 |   .0106021   .0007507    14.12   0.000     .0091307    .0120735
    l2age75p |   .0222473   .0010111    22.00   0.000     .0202655    .0242291
    l2cancre |   .0031885   .0080713     0.40   0.693    -.0126309    .0190079
     l2diabe |   .1022151   .0074455    13.73   0.000     .0876221     .116808
    l2hearte |   .0271562   .0059285     4.58   0.000     .0155365    .0387759
     l2hibpe |   .0393272   .0044516     8.83   0.000     .0306022    .0480522
     l2lunge |   .0996789   .0095875    10.40   0.000     .0808877    .1184701
    l2stroke |   .0529567   .0126262     4.19   0.000     .0282098    .0777035
      l2adl1 |   .0831042   .0078182    10.63   0.000     .0677809    .0984275
      l2adl2 |   .1044094   .0126475     8.26   0.000     .0796208    .1291981
     l2adl3p |   .1280483   .0139691     9.17   0.000     .1006693    .1554272
     l2iadl1 |   .1193563   .0072715    16.41   0.000     .1051044    .1336082
    l2iadl2p |   .2078964    .008802    23.62   0.000     .1906447     .225148
    l2logbmi |   .2751772   .0138389    19.88   0.000     .2480535     .302301
    l2psyche |   .0290698   .0071712     4.05   0.000     .0150145     .043125
    l2arthre |   .0329068   .0047493     6.93   0.000     .0235984    .0422153
   l2asthmae |   .0210369   .0063796     3.30   0.001      .008533    .0335407
   l2parkine |   .0992444   .0307678     3.23   0.001     .0389406    .1595483
    l2smokev |  -.0008708   .0044941    -0.19   0.846     -.009679    .0079375
    l2smoken |   .1419088   .0056552    25.09   0.000     .1308249    .1529927
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/vgactx_e.st
> er saved

Iteration 0:   log likelihood = -55741.061  
Iteration 1:   log likelihood = -48598.383  
Iteration 2:   log likelihood = -48586.407  
Iteration 3:   log likelihood = -48586.407  

Ordered probit regression                       Number of obs     =     51,536
                                                LR chi2(24)       =   14309.31
                                                Prob > chi2       =     0.0000
Log likelihood = -48586.407                     Pseudo R2         =     0.1284

------------------------------------------------------------------------------
    mdactx_e |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |  -.1097941    .011635    -9.44   0.000    -.1325983   -.0869898
      hsless |   .1772247   .0122576    14.46   0.000     .1532003    .2012492
     college |  -.1490541   .0167608    -8.89   0.000    -.1819046   -.1162035
    l2age65l |  -.0027896    .001572    -1.77   0.076    -.0058706    .0002914
   l2age6574 |   .0215103   .0019655    10.94   0.000      .017658    .0253626
    l2age75p |   .0649358    .002079    31.23   0.000     .0608612    .0690105
    l2cancre |     .02905    .020675     1.41   0.160    -.0114722    .0695722
     l2diabe |    .293208   .0195417    15.00   0.000     .2549069    .3315091
    l2hearte |   .0987312      .0151     6.54   0.000     .0691357    .1283268
     l2hibpe |   .0689207   .0118281     5.83   0.000      .045738    .0921034
     l2lunge |   .2858812   .0244101    11.71   0.000     .2380383    .3337241
    l2stroke |   .2230119   .0291322     7.66   0.000     .1659139    .2801099
      l2adl1 |   .2471248   .0195367    12.65   0.000     .2088335    .2854161
      l2adl2 |   .4256482   .0298624    14.25   0.000      .367119    .4841774
     l2adl3p |   .6609582   .0328701    20.11   0.000      .596534    .7253825
     l2iadl1 |   .3950192   .0189686    20.82   0.000     .3578413     .432197
    l2iadl2p |   .8440127   .0246243    34.28   0.000     .7957499    .8922755
    l2logbmi |   .7928431   .0359715    22.04   0.000     .7223403    .8633459
    l2psyche |   .0012221   .0192334     0.06   0.949    -.0364747    .0389189
    l2arthre |   .0740171   .0124712     5.94   0.000      .049574    .0984602
   l2asthmae |   .0651229   .0168222     3.87   0.000      .032152    .0980938
   l2parkine |   .3772435   .0763187     4.94   0.000     .2276617    .5268254
    l2smokev |  -.0045221   .0123683    -0.37   0.715    -.0287634    .0197193
    l2smoken |   .3435883   .0168076    20.44   0.000      .310646    .3765306
-------------+----------------------------------------------------------------
       /cut1 |   3.236111     .15116                      2.939843    3.532379
       /cut2 |   3.716949     .15132                      3.420368    4.013531
       /cut3 |    4.01397   .1514397                      3.717154    4.310787
------------------------------------------------------------------------------

Frequencies for mdactx_e...


  Number of times done |
 moderate exercise per |
                  week |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
        2.> 1 per week |     30,911       59.98       59.98
          3.1 per week |      7,263       14.09       74.07
         4.1-3 per mon |      3,488        6.77       80.84
5.hardly ever or never |      9,874       19.16      100.00
-----------------------+-----------------------------------
                 Total |     51,536      100.00

Computing marginal effects after oprobit for mdactx_e == 2...


Marginal effects after oprobit
      y  = Pr(mdactx_e==2) (predict, o(2))
         =   .5956394
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0424455      .00449    9.46   0.000    .03365  .051241    .43781
  hsless*|  -.0689378      .00478  -14.42   0.000  -.078306  -.05957   .371061
 college*|    .056932       .0063    9.04   0.000   .044594   .06927   .164254
l2age65l |   .0010808      .00061    1.77   0.076  -.000113  .002274   59.8624
l2a~6574 |  -.0083336      .00076  -10.95   0.000  -.009826 -.006842    3.7232
l2age75p |  -.0251576      .00081  -31.16   0.000   -.02674 -.023575   1.44383
l2cancre*|   -.011287      .00806   -1.40   0.161  -.027075  .004501    .07618
 l2diabe*|  -.1157117      .00777  -14.89   0.000  -.130941 -.100482   .086968
l2hearte*|  -.0385211      .00593   -6.50   0.000   -.05014 -.026902   .166389
 l2hibpe*|  -.0267409       .0046   -5.82   0.000  -.035747 -.017735   .398925
 l2lunge*|  -.1129249      .00972  -11.62   0.000  -.131972 -.093877   .053846
l2stroke*|  -.0879321      .01161   -7.58   0.000  -.110678 -.065186   .038788
  l2adl1*|  -.0973687      .00777  -12.53   0.000  -.112595 -.082143   .091509
  l2adl2*|  -.1683601      .01174  -14.34   0.000  -.191371 -.145349   .039409
 l2adl3p*|  -.2585268      .01217  -21.24   0.000  -.282388 -.234665   .044377
 l2iadl1*|  -.1560412       .0075  -20.82   0.000  -.170732  -.14135    .09702
l2iadl2p*|  -.3253053      .00861  -37.77   0.000  -.342188 -.308423   .089491
l2logbmi |  -.3071654      .01393  -22.05   0.000  -.334471  -.27986   3.32196
l2psyche*|  -.0004735      .00745   -0.06   0.949  -.015082  .014135   .092984
l2arthre*|  -.0287475      .00485   -5.92   0.000  -.038262 -.019233    .34504
l2asth~e*|  -.0253678      .00659   -3.85   0.000  -.038276 -.012459   .125097
l2park~e*|  -.1493838      .03017   -4.95   0.000  -.208525 -.090243   .005239
l2smokev*|   .0017522      .00479    0.37   0.715  -.007642  .011146   .617141
l2smoken*|  -.1354441      .00666  -20.35   0.000  -.148492 -.122396   .142444
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for mdactx_e == 3...


Marginal effects after oprobit
      y  = Pr(mdactx_e==3) (predict, o(3))
         =  .16949449
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   -.008891      .00096   -9.26   0.000  -.010772  -.00701    .43781
  hsless*|   .0136381      .00093   14.71   0.000   .011821  .015456   .371061
 college*|  -.0128406      .00155   -8.29   0.000  -.015878 -.009803   .164254
l2age65l |  -.0002238      .00013   -1.77   0.076  -.000471  .000023   59.8624
l2a~6574 |   .0017255      .00016   10.76   0.000   .001411   .00204    3.7232
l2age75p |    .005209      .00018   28.29   0.000   .004848   .00557   1.44383
l2cancre*|   .0022838      .00159    1.43   0.151  -.000837  .005404    .07618
 l2diabe*|   .0183365      .00091   20.20   0.000   .016557  .020116   .086968
l2hearte*|   .0074829      .00108    6.92   0.000   .005364  .009602   .166389
 l2hibpe*|   .0054638      .00093    5.87   0.000    .00364  .007288   .398925
 l2lunge*|   .0176078      .00106   16.68   0.000   .015539  .019677   .053846
l2stroke*|   .0146164      .00147    9.98   0.000   .011745  .017488   .038788
  l2adl1*|   .0162451      .00102   15.92   0.000   .014245  .018245   .091509
  l2adl2*|   .0213595      .00068   31.31   0.000   .020023  .022696   .039409
 l2adl3p*|   .0208464      .00102   20.45   0.000   .018849  .022844   .044377
 l2iadl1*|   .0221979      .00072   30.83   0.000   .020787  .023609    .09702
l2iadl2p*|    .019439      .00128   15.17   0.000   .016928   .02195   .089491
l2logbmi |   .0636004      .00307   20.71   0.000   .057582  .069619   3.32196
l2psyche*|    .000098      .00154    0.06   0.949  -.002921  .003117   .092984
l2arthre*|   .0058239      .00097    6.03   0.000    .00393  .007718    .34504
l2asth~e*|   .0050134      .00124    4.04   0.000    .00258  .007447   .125097
l2park~e*|   .0195908       .0016   12.25   0.000   .016456  .022725   .005239
l2smokev*|  -.0003624      .00099   -0.37   0.714  -.002304  .001579   .617141
l2smoken*|   .0213159      .00082   26.13   0.000   .019717  .022915   .142444
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for mdactx_e == 4...


Marginal effects after oprobit
      y  = Pr(mdactx_e==4) (predict, o(4))
         =  .08098658
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|  -.0076977      .00083   -9.31   0.000  -.009317 -.006078    .43781
  hsless*|   .0122919      .00087   14.19   0.000   .010594   .01399   .371061
 college*|  -.0105401       .0012   -8.76   0.000    -.0129 -.008181   .164254
l2age65l |  -.0001954      .00011   -1.77   0.076  -.000411   .00002   59.8624
l2a~6574 |   .0015069      .00014   10.75   0.000   .001232  .001782    3.7232
l2age75p |   .0045492      .00017   27.45   0.000   .004224  .004874   1.44383
l2cancre*|   .0020276      .00144    1.41   0.158   -.00079  .004845    .07618
 l2diabe*|    .019329      .00122   15.79   0.000    .01693  .021728   .086968
l2hearte*|   .0068377      .00104    6.58   0.000   .004802  .008873   .166389
 l2hibpe*|   .0048165      .00083    5.81   0.000   .003193   .00644   .398925
 l2lunge*|   .0187811      .00149   12.59   0.000   .015858  .021704   .053846
l2stroke*|   .0149086      .00184    8.11   0.000   .011305  .018512   .038788
  l2adl1*|   .0165188      .00125   13.17   0.000    .01406  .018978   .091509
  l2adl2*|   .0263568      .00156   16.91   0.000   .023302  .029411   .039409
 l2adl3p*|   .0358142      .00118   30.31   0.000   .033499   .03813   .044377
 l2iadl1*|   .0252236      .00114   22.21   0.000   .022998  .027449    .09702
l2iadl2p*|   .0417909      .00093   44.93   0.000   .039968  .043614   .089491
l2logbmi |   .0555442       .0027   20.57   0.000   .050251  .060838   3.32196
l2psyche*|   .0000856      .00135    0.06   0.949  -.002555  .002726   .092984
l2arthre*|   .0051652      .00087    5.93   0.000   .003458  .006872    .34504
l2asth~e*|    .004526      .00116    3.90   0.000    .00225  .006802   .125097
l2park~e*|   .0236332      .00396    5.97   0.000   .015874  .031392   .005239
l2smokev*|  -.0003168      .00087   -0.37   0.715  -.002015  .001381   .617141
l2smoken*|   .0225533      .00108   20.95   0.000   .020443  .024664   .142444
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for mdactx_e == 5...


Marginal effects after oprobit
      y  = Pr(mdactx_e==5) (predict, o(5))
         =  .15387953
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|  -.0258568      .00272   -9.49   0.000  -.031197 -.020517    .43781
  hsless*|   .0430079      .00305   14.11   0.000   .037034  .048981   .371061
 college*|  -.0335513      .00357   -9.39   0.000  -.040553 -.026549   .164254
l2age65l |  -.0006616      .00037   -1.77   0.076  -.001392  .000069   59.8624
l2a~6574 |   .0051011      .00047   10.94   0.000   .004187  .006015    3.7232
l2age75p |   .0153994       .0005   30.60   0.000   .014413  .016386   1.44383
l2cancre*|   .0069757      .00503    1.39   0.165  -.002875  .016827    .07618
 l2diabe*|   .0780463      .00577   13.53   0.000   .066743   .08935   .086968
l2hearte*|   .0242004      .00382    6.33   0.000   .016706  .031695   .166389
 l2hibpe*|   .0164606      .00285    5.79   0.000   .010884  .022037   .398925
 l2lunge*|    .076536      .00727   10.52   0.000   .062283   .09079   .053846
l2stroke*|   .0584071      .00835    7.00   0.000   .042043  .074771   .038788
  l2adl1*|   .0646047      .00558   11.58   0.000   .053669   .07554   .091509
  l2adl2*|   .1206438      .00978   12.33   0.000    .10147  .139818   .039409
 l2adl3p*|   .2018662      .01199   16.84   0.000    .17837  .225363   .044377
 l2iadl1*|   .1086197      .00591   18.37   0.000   .097033  .120207    .09702
l2iadl2p*|   .2640754       .0092   28.71   0.000   .246047  .282104   .089491
l2logbmi |   .1880208      .00857   21.95   0.000   .171232  .204809   3.32196
l2psyche*|     .00029      .00457    0.06   0.949  -.008659  .009239   .092984
l2arthre*|   .0177584      .00303    5.87   0.000   .011825  .023692    .34504
l2asth~e*|   .0158284      .00419    3.78   0.000   .007619  .024038   .125097
l2park~e*|   .1061598       .0247    4.30   0.000   .057745  .154575   .005239
l2smokev*|   -.001073      .00294   -0.37   0.715  -.006828  .004682   .617141
l2smoken*|   .0915749      .00497   18.44   0.000   .081843  .101307   .142444
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as o_mdactx_e_mfx.

-------------------------------------------------------------------------------
Model o_mdactx_e_mfx (Marginal effects after oprobit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
    mdactx_e |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
2_>_1_per_~k |
        male |   .0424455   .0044875     9.46   0.000     .0336501    .0512408
      hsless |  -.0689378   .0047796   -14.42   0.000    -.0783056     -.05957
     college |    .056932    .006295     9.04   0.000      .044594    .0692699
    l2age65l |   .0010808    .000609     1.77   0.076    -.0001129    .0022744
   l2age6574 |  -.0083336   .0007613   -10.95   0.000    -.0098256   -.0068415
    l2age75p |  -.0251576   .0008073   -31.16   0.000      -.02674   -.0235753
    l2cancre |   -.011287   .0080552    -1.40   0.161     -.027075     .004501
     l2diabe |  -.1157117   .0077703   -14.89   0.000    -.1309412   -.1004822
    l2hearte |  -.0385211   .0059282    -6.50   0.000      -.05014   -.0269021
     l2hibpe |  -.0267409   .0045951    -5.82   0.000     -.035747   -.0177347
     l2lunge |  -.1129249   .0097183   -11.62   0.000    -.1319724   -.0938774
    l2stroke |  -.0879321   .0116051    -7.58   0.000    -.1106778   -.0651864
      l2adl1 |  -.0973687   .0077686   -12.53   0.000    -.1125948   -.0821426
      l2adl2 |  -.1683601   .0117403   -14.34   0.000    -.1913707   -.1453495
     l2adl3p |  -.2585268   .0121745   -21.24   0.000    -.2823884   -.2346651
     l2iadl1 |  -.1560412   .0074954   -20.82   0.000     -.170732   -.1413504
    l2iadl2p |  -.3253053   .0086137   -37.77   0.000    -.3421879   -.3084227
    l2logbmi |  -.3071654   .0139317   -22.05   0.000    -.3344711   -.2798597
    l2psyche |  -.0004735   .0074532    -0.06   0.949    -.0150816    .0141346
    l2arthre |  -.0287475   .0048545    -5.92   0.000    -.0382622   -.0192328
   l2asthmae |  -.0253678    .006586    -3.85   0.000    -.0382761   -.0124595
   l2parkine |  -.1493838   .0301747    -4.95   0.000     -.208525   -.0902425
    l2smokev |   .0017522   .0047929     0.37   0.715    -.0076418    .0111462
    l2smoken |  -.1354441   .0066573   -20.35   0.000    -.1484922    -.122396
-------------+----------------------------------------------------------------
3_1_per_week |
        male |   -.008891   .0009596    -9.26   0.000    -.0107718   -.0070101
      hsless |   .0136381   .0009273    14.71   0.000     .0118206    .0154556
     college |  -.0128406   .0015496    -8.29   0.000    -.0158777   -.0098034
    l2age65l |  -.0002238   .0001262    -1.77   0.076     -.000471    .0000235
   l2age6574 |   .0017255   .0001604    10.76   0.000     .0014111    .0020399
    l2age75p |    .005209   .0001842    28.29   0.000     .0048481      .00557
    l2cancre |   .0022838   .0015922     1.43   0.151     -.000837    .0054045
     l2diabe |   .0183365   .0009079    20.20   0.000      .016557    .0201159
    l2hearte |   .0074829   .0010813     6.92   0.000     .0053637    .0096022
     l2hibpe |   .0054638   .0009307     5.87   0.000     .0036396     .007288
     l2lunge |   .0176078   .0010555    16.68   0.000     .0155391    .0196766
    l2stroke |   .0146164    .001465     9.98   0.000      .011745    .0174878
      l2adl1 |   .0162451   .0010203    15.92   0.000     .0142454    .0182448
      l2adl2 |   .0213595   .0006821    31.31   0.000     .0200226    .0226963
     l2adl3p |   .0208464   .0010192    20.45   0.000     .0188487    .0228441
     l2iadl1 |   .0221979   .0007201    30.83   0.000     .0207865    .0236092
    l2iadl2p |    .019439   .0012812    15.17   0.000      .016928      .02195
    l2logbmi |   .0636004   .0030706    20.71   0.000      .057582    .0696187
    l2psyche |    .000098   .0015404     0.06   0.949    -.0029212    .0031171
    l2arthre |   .0058239   .0009665     6.03   0.000     .0039296    .0077182
   l2asthmae |   .0050134   .0012417     4.04   0.000     .0025798    .0074471
   l2parkine |   .0195908   .0015994    12.25   0.000      .016456    .0227255
    l2smokev |  -.0003624   .0009905    -0.37   0.714    -.0023037    .0015789
    l2smoken |   .0213159   .0008159    26.13   0.000     .0197168     .022915
-------------+----------------------------------------------------------------
4_1-3_per_~n |
        male |  -.0076977   .0008264    -9.31   0.000    -.0093174    -.006078
      hsless |   .0122919   .0008663    14.19   0.000      .010594    .0139898
     college |  -.0105401   .0012039    -8.76   0.000    -.0128997   -.0081806
    l2age65l |  -.0001954   .0001102    -1.77   0.076    -.0004114    .0000205
   l2age6574 |   .0015069   .0001402    10.75   0.000     .0012321    .0017818
    l2age75p |   .0045492   .0001657    27.45   0.000     .0042244     .004874
    l2cancre |   .0020276   .0014377     1.41   0.158    -.0007903    .0048454
     l2diabe |    .019329   .0012238    15.79   0.000     .0169304    .0217275
    l2hearte |   .0068377   .0010384     6.58   0.000     .0048024     .008873
     l2hibpe |   .0048165   .0008283     5.81   0.000      .003193      .00644
     l2lunge |   .0187811   .0014913    12.59   0.000     .0158583    .0217039
    l2stroke |   .0149086   .0018388     8.11   0.000     .0113047    .0185125
      l2adl1 |   .0165188   .0012547    13.17   0.000     .0140596    .0189781
      l2adl2 |   .0263568   .0015584    16.91   0.000     .0233024    .0294113
     l2adl3p |   .0358142   .0011815    30.31   0.000     .0334986    .0381298
     l2iadl1 |   .0252236   .0011355    22.21   0.000      .022998    .0274492
    l2iadl2p |   .0417909   .0009301    44.93   0.000      .039968    .0436138
    l2logbmi |   .0555442   .0027008    20.57   0.000     .0502507    .0608377
    l2psyche |   .0000856   .0013471     0.06   0.949    -.0025546    .0027258
    l2arthre |   .0051652   .0008709     5.93   0.000     .0034582    .0068722
   l2asthmae |    .004526   .0011611     3.90   0.000     .0022503    .0068017
   l2parkine |   .0236332   .0039586     5.97   0.000     .0158744    .0313921
    l2smokev |  -.0003168   .0008662    -0.37   0.715    -.0020145     .001381
    l2smoken |   .0225533   .0010767    20.95   0.000     .0204431    .0246635
-------------+----------------------------------------------------------------
5_hardly_e~r |
        male |  -.0258568   .0027246    -9.49   0.000     -.031197   -.0205166
      hsless |   .0430079   .0030478    14.11   0.000     .0370343    .0489814
     college |  -.0335513   .0035726    -9.39   0.000    -.0405534   -.0265492
    l2age65l |  -.0006616   .0003728    -1.77   0.076    -.0013922    .0000691
   l2age6574 |   .0051011   .0004661    10.94   0.000     .0041875    .0060147
    l2age75p |   .0153994   .0005032    30.60   0.000     .0144131    .0163857
    l2cancre |   .0069757   .0050262     1.39   0.165    -.0028755    .0168268
     l2diabe |   .0780463   .0057673    13.53   0.000     .0667425      .08935
    l2hearte |   .0242004   .0038238     6.33   0.000      .016706    .0316948
     l2hibpe |   .0164606   .0028452     5.79   0.000     .0108841    .0220372
     l2lunge |    .076536   .0072723    10.52   0.000     .0622825    .0907896
    l2stroke |   .0584071    .008349     7.00   0.000     .0420434    .0747708
      l2adl1 |   .0646047   .0055796    11.58   0.000      .053669    .0755405
      l2adl2 |   .1206438    .009783    12.33   0.000     .1014696    .1398181
     l2adl3p |   .2018662   .0119883    16.84   0.000     .1783696    .2253628
     l2iadl1 |   .1086197   .0059117    18.37   0.000     .0970329    .1202065
    l2iadl2p |   .2640754   .0091985    28.71   0.000     .2460467    .2821041
    l2logbmi |   .1880208   .0085658    21.95   0.000     .1712321    .2048095
    l2psyche |     .00029   .0045658     0.06   0.949    -.0086588    .0092387
    l2arthre |   .0177584   .0030272     5.87   0.000     .0118253    .0236915
   l2asthmae |   .0158284   .0041888     3.78   0.000     .0076186    .0240382
   l2parkine |   .1061598    .024702     4.30   0.000     .0577448    .1545747
    l2smokev |   -.001073   .0029363    -0.37   0.715     -.006828    .0046821
    l2smoken |   .0915749   .0049653    18.44   0.000      .081843    .1013068
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/mdactx_e.st
> er saved

Iteration 0:   log likelihood = -38945.391  
Iteration 1:   log likelihood =   -34663.9  
Iteration 2:   log likelihood = -34633.229  
Iteration 3:   log likelihood = -34633.209  
Iteration 4:   log likelihood = -34633.209  

Ordered probit regression                       Number of obs     =     51,542
                                                LR chi2(24)       =    8624.36
                                                Prob > chi2       =     0.0000
Log likelihood = -34633.209                     Pseudo R2         =     0.1107

------------------------------------------------------------------------------
    ltactx_e |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .4826334   .0132952    36.30   0.000     .4565753    .5086915
      hsless |   .0966263   .0140676     6.87   0.000     .0690543    .1241983
     college |  -.0199057   .0187992    -1.06   0.290    -.0567514    .0169401
    l2age65l |   .0012525    .001897     0.66   0.509    -.0024654    .0049705
   l2age6574 |    .013612   .0022397     6.08   0.000     .0092223    .0180017
    l2age75p |   .0555223   .0021084    26.33   0.000     .0513898    .0596548
    l2cancre |    .042632   .0230544     1.85   0.064    -.0025538    .0878178
     l2diabe |   .2056707   .0208576     9.86   0.000     .1647907    .2465508
    l2hearte |   .0463703   .0165939     2.79   0.005     .0138469    .0788937
     l2hibpe |   .0164836   .0134247     1.23   0.219    -.0098283    .0427956
     l2lunge |   .1310121   .0262854     4.98   0.000     .0794936    .1825305
    l2stroke |    .134832   .0298923     4.51   0.000     .0762442    .1934199
      l2adl1 |   .1647221   .0215775     7.63   0.000      .122431    .2070132
      l2adl2 |     .29672   .0308164     9.63   0.000     .2363211     .357119
     l2adl3p |   .6329197   .0319076    19.84   0.000     .5703819    .6954574
     l2iadl1 |   .2878858    .021181    13.59   0.000     .2463718    .3293998
    l2iadl2p |   .7665615   .0251051    30.53   0.000     .7173563    .8157666
    l2logbmi |   .2892492   .0413244     7.00   0.000     .2082548    .3702435
    l2psyche |   .0229426   .0219518     1.05   0.296    -.0200822    .0659674
    l2arthre |   -.015915   .0143326    -1.11   0.267    -.0440064    .0121764
   l2asthmae |   .0092009   .0191782     0.48   0.631    -.0283876    .0467895
   l2parkine |   .3008277   .0745132     4.04   0.000     .1547845    .4468709
    l2smokev |  -.0115659   .0141527    -0.82   0.414    -.0393048    .0161729
    l2smoken |   .1735435   .0190839     9.09   0.000     .1361397    .2109473
-------------+----------------------------------------------------------------
       /cut1 |   2.468638   .1775132                      2.120719    2.816558
       /cut2 |   2.903454   .1776283                      2.555309    3.251599
       /cut3 |   3.092473   .1776907                      2.744206    3.440741
------------------------------------------------------------------------------

Frequencies for ltactx_e...


  Number of times done |
    light exercise per |
                  week |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
        2.> 1 per week |     39,975       77.56       77.56
          3.1 per week |      4,853        9.42       86.97
         4.1-3 per mon |      1,556        3.02       89.99
5.hardly ever or never |      5,158       10.01      100.00
-----------------------+-----------------------------------
                 Total |     51,542      100.00

Computing marginal effects after oprobit for ltactx_e == 2...


Marginal effects after oprobit
      y  = Pr(ltactx_e==2) (predict, o(2))
         =  .80008498
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|  -.1380198      .00382  -36.17   0.000    -.1455  -.13054   .437798
  hsless*|  -.0273245      .00402   -6.80   0.000  -.035199  -.01945   .371076
 college*|     .00554       .0052    1.06   0.287  -.004656  .015736   .164235
l2age65l |  -.0003506      .00053   -0.66   0.509  -.001391   .00069   59.8626
l2a~6574 |  -.0038099      .00063   -6.08   0.000  -.005038 -.002582   3.72366
l2age75p |  -.0155402      .00059  -26.19   0.000  -.016703 -.014377   1.44428
l2cancre*|  -.0121129      .00665   -1.82   0.068  -.025141  .000915   .076171
 l2diabe*|  -.0615636      .00663   -9.28   0.000  -.074567  -.04856   .087016
l2hearte*|  -.0131468      .00476   -2.76   0.006  -.022486 -.003808   .166369
 l2hibpe*|  -.0046201      .00377   -1.23   0.220  -.012005  .002765   .398937
 l2lunge*|  -.0384424      .00806   -4.77   0.000  -.054244 -.022641    .05384
l2stroke*|   -.039678      .00922   -4.30   0.000  -.057749 -.021607   .038803
  l2adl1*|  -.0486589       .0067   -7.26   0.000  -.061787 -.035531   .091537
  l2adl2*|  -.0921399      .01045   -8.82   0.000  -.112622 -.071658   .039424
 l2adl3p*|  -.2141447      .01222  -17.52   0.000  -.238105 -.190185   .044391
 l2iadl1*|  -.0881027      .00699  -12.60   0.000  -.101812 -.074394   .097086
l2iadl2p*|  -.2614909      .00961  -27.20   0.000  -.280334 -.242647     .0895
l2logbmi |  -.0809581      .01156   -7.00   0.000  -.103615 -.058301   3.32195
l2psyche*|  -.0064718      .00624   -1.04   0.300  -.018702  .005759   .092992
l2arthre*|   .0044452        .004    1.11   0.266  -.003385  .012275    .34502
l2asth~e*|  -.0025827       .0054   -0.48   0.632  -.013164  .007999   .125082
l2park~e*|  -.0942032      .02563   -3.67   0.000  -.144446 -.043961   .005238
l2smokev*|   .0032409      .00397    0.82   0.414  -.004541  .011022   .617147
l2smoken*|  -.0510545      .00587   -8.69   0.000  -.062569  -.03954   .142466
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for ltactx_e == 3...


Marginal effects after oprobit
      y  = Pr(ltactx_e==3) (predict, o(3))
         =  .09906812
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|    .049039      .00147   33.29   0.000   .046152  .051927   .437798
  hsless*|   .0099858      .00146    6.84   0.000   .007125  .012847   .371076
 college*|  -.0020549      .00194   -1.06   0.289  -.005856  .001746   .164235
l2age65l |   .0001294       .0002    0.66   0.509  -.000255  .000514   59.8626
l2a~6574 |   .0014062      .00023    6.06   0.000   .000951  .001861   3.72366
l2age75p |   .0057359      .00023   24.69   0.000   .005281  .006191   1.44428
l2cancre*|   .0044101      .00239    1.85   0.065   -.00027   .00909   .076171
 l2diabe*|    .021202      .00214    9.89   0.000   .017001  .025403   .087016
l2hearte*|   .0047959      .00172    2.79   0.005   .001427  .008165   .166369
 l2hibpe*|   .0017031      .00139    1.23   0.220  -.001016  .004422   .398937
 l2lunge*|   .0135494      .00272    4.99   0.000   .008228  .018871    .05384
l2stroke*|   .0139423      .00308    4.52   0.000   .007898  .019987   .038803
  l2adl1*|    .017018      .00223    7.64   0.000   .012652  .021384   .091537
  l2adl2*|   .0302692      .00305    9.93   0.000   .024294  .036245   .039424
 l2adl3p*|   .0593006      .00244   24.26   0.000    .05451  .064091   .044391
 l2iadl1*|   .0294786      .00215   13.73   0.000   .025272  .033686   .097086
l2iadl2p*|   .0693807      .00189   36.75   0.000    .06568  .073081     .0895
l2logbmi |    .029882      .00429    6.97   0.000   .021475  .038289   3.32195
l2psyche*|   .0023721      .00227    1.04   0.296   -.00208  .006824   .092992
l2arthre*|  -.0016437      .00148   -1.11   0.267  -.004545  .001257    .34502
l2asth~e*|   .0009508      .00198    0.48   0.632  -.002935  .004837   .125082
l2park~e*|   .0306086      .00724    4.23   0.000   .016423  .044794   .005238
l2smokev*|   -.001195      .00146   -0.82   0.414  -.004061  .001671   .617147
l2smoken*|   .0179276      .00198    9.08   0.000   .014056  .021799   .142466
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for ltactx_e == 4...


Marginal effects after oprobit
      y  = Pr(ltactx_e==4) (predict, o(4))
         =  .02949002
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0195901      .00071   27.66   0.000   .018202  .020978   .437798
  hsless*|   .0039246      .00058    6.73   0.000   .002781  .005068   .371076
 college*|  -.0007991      .00075   -1.06   0.288  -.002272  .000674   .164235
l2age65l |   .0000505      .00008    0.66   0.509  -.000099    .0002   59.8626
l2a~6574 |   .0005488      .00009    6.02   0.000    .00037  .000728   3.72366
l2age75p |   .0022386       .0001   22.10   0.000    .00204  .002437   1.44428
l2cancre*|   .0017382      .00095    1.83   0.068  -.000126  .003602   .076171
 l2diabe*|   .0086844      .00094    9.25   0.000   .006845  .010524   .087016
l2hearte*|   .0018876      .00068    2.76   0.006   .000548  .003227   .166369
 l2hibpe*|   .0006653      .00054    1.23   0.220  -.000398  .001729   .398937
 l2lunge*|   .0054634      .00114    4.80   0.000   .003235  .007692    .05384
l2stroke*|   .0056338       .0013    4.35   0.000   .003093  .008175   .038803
  l2adl1*|   .0068981      .00095    7.28   0.000   .005041  .008756   .091537
  l2adl2*|   .0127938      .00142    8.99   0.000   .010003  .015584   .039424
 l2adl3p*|   .0278141      .00153   18.14   0.000   .024809   .03082   .044391
 l2iadl1*|   .0123071      .00099   12.44   0.000   .010368  .014246   .097086
l2iadl2p*|   .0332785      .00131   25.37   0.000   .030708  .035849     .0895
l2logbmi |    .011662      .00169    6.90   0.000   .008352  .014972   3.32195
l2psyche*|   .0009304       .0009    1.04   0.299  -.000825  .002686   .092992
l2arthre*|  -.0006406      .00058   -1.11   0.266   -.00177  .000489    .34502
l2asth~e*|   .0003718      .00078    0.48   0.632   -.00115  .001894   .125082
l2park~e*|   .0130325      .00339    3.84   0.000   .006379  .019686   .005238
l2smokev*|  -.0004667      .00057   -0.82   0.414  -.001587  .000654   .617147
l2smoken*|   .0072461      .00084    8.64   0.000   .005602  .008891   .142466
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for ltactx_e == 5...


Marginal effects after oprobit
      y  = Pr(ltactx_e==5) (predict, o(5))
         =  .07135688
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0693906      .00207   33.60   0.000   .065343  .073438   .437798
  hsless*|    .013414      .00199    6.73   0.000    .00951  .017318   .371076
 college*|   -.002686      .00251   -1.07   0.285  -.007609  .002237   .164235
l2age65l |   .0001707      .00026    0.66   0.509  -.000336  .000677   59.8626
l2a~6574 |   .0018548      .00031    6.08   0.000   .001257  .002453   3.72366
l2age75p |   .0075657       .0003   25.49   0.000   .006984  .008147   1.44428
l2cancre*|   .0059646      .00331    1.80   0.072  -.000524  .012453   .076171
 l2diabe*|   .0316772      .00361    8.78   0.000   .024609  .038746   .087016
l2hearte*|   .0064634      .00237    2.73   0.006   .001826  .011101   .166369
 l2hibpe*|   .0022516      .00184    1.22   0.221  -.001351  .005855   .398937
 l2lunge*|   .0194295      .00423    4.60   0.000   .011144  .027715    .05384
l2stroke*|   .0201019      .00486    4.14   0.000   .010584   .02962   .038803
  l2adl1*|   .0247427      .00356    6.96   0.000   .017772  .031713   .091537
  l2adl2*|    .049077      .00605    8.11   0.000    .03721  .060944   .039424
 l2adl3p*|     .12703      .00862   14.74   0.000   .110133  .143926   .044391
 l2iadl1*|    .046317      .00396   11.69   0.000   .038549  .054085   .097086
l2iadl2p*|   .1588317       .0071   22.36   0.000   .144908  .172756     .0895
l2logbmi |   .0394141      .00564    6.99   0.000   .028368   .05046   3.32195
l2psyche*|   .0031693      .00307    1.03   0.303  -.002855  .009194   .092992
l2arthre*|  -.0021608      .00194   -1.11   0.265  -.005962   .00164    .34502
l2asth~e*|   .0012601      .00264    0.48   0.633  -.003914  .006434   .125082
l2park~e*|   .0505622      .01504    3.36   0.001   .021094  .080031   .005238
l2smokev*|  -.0015792      .00194   -0.82   0.415  -.005374  .002216   .617147
l2smoken*|   .0258808       .0031    8.34   0.000     .0198  .031962   .142466
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as o_ltactx_e_mfx.

-------------------------------------------------------------------------------
Model o_ltactx_e_mfx (Marginal effects after oprobit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
    ltactx_e |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
2_>_1_per_~k |
        male |  -.1380198   .0038164   -36.17   0.000    -.1454997   -.1305398
      hsless |  -.0273245   .0040175    -6.80   0.000    -.0351986   -.0194504
     college |     .00554   .0052023     1.06   0.287    -.0046563    .0157363
    l2age65l |  -.0003506   .0005309    -0.66   0.509    -.0013912      .00069
   l2age6574 |  -.0038099   .0006264    -6.08   0.000    -.0050375   -.0025822
    l2age75p |  -.0155402   .0005934   -26.19   0.000    -.0167032   -.0143771
    l2cancre |  -.0121129   .0066473    -1.82   0.068    -.0251413    .0009155
     l2diabe |  -.0615636   .0066345    -9.28   0.000     -.074567   -.0485602
    l2hearte |  -.0131468   .0047649    -2.76   0.006    -.0224859   -.0038077
     l2hibpe |  -.0046201   .0037678    -1.23   0.220    -.0120047    .0027646
     l2lunge |  -.0384424   .0080623    -4.77   0.000    -.0542441   -.0226406
    l2stroke |   -.039678   .0092203    -4.30   0.000    -.0577494   -.0216065
      l2adl1 |  -.0486589   .0066979    -7.26   0.000    -.0617866   -.0355311
      l2adl2 |  -.0921399     .01045    -8.82   0.000    -.1126215   -.0716583
     l2adl3p |  -.2141447   .0122247   -17.52   0.000    -.2381046   -.1901847
     l2iadl1 |  -.0881027   .0069945   -12.60   0.000    -.1018116   -.0743937
    l2iadl2p |  -.2614909   .0096142   -27.20   0.000    -.2803344   -.2426473
    l2logbmi |  -.0809581   .0115599    -7.00   0.000    -.1036151    -.058301
    l2psyche |  -.0064718   .0062402    -1.04   0.300    -.0187023    .0057587
    l2arthre |   .0044452   .0039951     1.11   0.266     -.003385    .0122754
   l2asthmae |  -.0025827   .0053989    -0.48   0.632    -.0131644    .0079989
   l2parkine |  -.0942032   .0256344    -3.67   0.000    -.1444457   -.0439607
    l2smokev |   .0032409   .0039702     0.82   0.414    -.0045405    .0110223
    l2smoken |  -.0510545   .0058748    -8.69   0.000    -.0625689   -.0395401
-------------+----------------------------------------------------------------
3_1_per_week |
        male |    .049039   .0014732    33.29   0.000     .0461516    .0519265
      hsless |   .0099858   .0014597     6.84   0.000     .0071249    .0128468
     college |  -.0020549   .0019394    -1.06   0.289    -.0058561    .0017462
    l2age65l |   .0001294    .000196     0.66   0.509    -.0002547    .0005135
   l2age6574 |   .0014062   .0002322     6.06   0.000     .0009512    .0018612
    l2age75p |   .0057359   .0002323    24.69   0.000     .0052806    .0061913
    l2cancre |   .0044101   .0023877     1.85   0.065    -.0002697      .00909
     l2diabe |    .021202   .0021436     9.89   0.000     .0170006    .0254034
    l2hearte |   .0047959   .0017189     2.79   0.005     .0014269    .0081649
     l2hibpe |   .0017031   .0013874     1.23   0.220    -.0010162    .0044225
     l2lunge |   .0135494   .0027151     4.99   0.000      .008228    .0188709
    l2stroke |   .0139423   .0030838     4.52   0.000     .0078981    .0199866
      l2adl1 |    .017018   .0022274     7.64   0.000     .0126525    .0213836
      l2adl2 |   .0302692   .0030487     9.93   0.000     .0242938    .0362446
     l2adl3p |   .0593006   .0024442    24.26   0.000       .05451    .0640913
     l2iadl1 |   .0294786   .0021464    13.73   0.000     .0252717    .0336855
    l2iadl2p |   .0693807    .001888    36.75   0.000     .0656803     .073081
    l2logbmi |    .029882   .0042892     6.97   0.000     .0214753    .0382887
    l2psyche |   .0023721   .0022714     1.04   0.296    -.0020799     .006824
    l2arthre |  -.0016437   .0014801    -1.11   0.267    -.0045446    .0012571
   l2asthmae |   .0009508   .0019826     0.48   0.632    -.0029349    .0048366
   l2parkine |   .0306086   .0072378     4.23   0.000     .0164228    .0447943
    l2smokev |   -.001195   .0014625    -0.82   0.414    -.0040615    .0016715
    l2smoken |   .0179276   .0019754     9.08   0.000      .014056    .0217992
-------------+----------------------------------------------------------------
4_1-3_per_~n |
        male |   .0195901   .0007082    27.66   0.000      .018202    .0209782
      hsless |   .0039246   .0005834     6.73   0.000     .0027812    .0050681
     college |  -.0007991   .0007516    -1.06   0.288    -.0022722     .000674
    l2age65l |   .0000505   .0000765     0.66   0.509    -.0000994    .0002004
   l2age6574 |   .0005488   .0000912     6.02   0.000     .0003701    .0007275
    l2age75p |   .0022386   .0001013    22.10   0.000       .00204    .0024371
    l2cancre |   .0017382   .0009509     1.83   0.068    -.0001256     .003602
     l2diabe |   .0086844   .0009385     9.25   0.000     .0068449    .0105239
    l2hearte |   .0018876   .0006834     2.76   0.006     .0005482    .0032269
     l2hibpe |   .0006653   .0005426     1.23   0.220    -.0003982    .0017288
     l2lunge |   .0054634   .0011372     4.80   0.000     .0032346    .0076922
    l2stroke |   .0056338   .0012964     4.35   0.000     .0030929    .0081747
      l2adl1 |   .0068981   .0009478     7.28   0.000     .0050405    .0087558
      l2adl2 |   .0127938   .0014238     8.99   0.000     .0100032    .0155843
     l2adl3p |   .0278141   .0015334    18.14   0.000     .0248086    .0308195
     l2iadl1 |   .0123071   .0009894    12.44   0.000     .0103679    .0142463
    l2iadl2p |   .0332785   .0013115    25.37   0.000      .030708     .035849
    l2logbmi |    .011662    .001689     6.90   0.000     .0083517    .0149723
    l2psyche |   .0009304   .0008957     1.04   0.299     -.000825    .0026859
    l2arthre |  -.0006406   .0005763    -1.11   0.266    -.0017701    .0004889
   l2asthmae |   .0003718   .0007767     0.48   0.632    -.0011504     .001894
   l2parkine |   .0130325   .0033947     3.84   0.000     .0063791    .0196859
    l2smokev |  -.0004667   .0005717    -0.82   0.414    -.0015872    .0006538
    l2smoken |   .0072461    .000839     8.64   0.000     .0056016    .0088906
-------------+----------------------------------------------------------------
5_hardly_e~r |
        male |   .0693906   .0020651    33.60   0.000      .065343    .0734382
      hsless |    .013414    .001992     6.73   0.000     .0095097    .0173184
     college |   -.002686   .0025119    -1.07   0.285    -.0076091    .0022372
    l2age65l |   .0001707   .0002585     0.66   0.509    -.0003359    .0006773
   l2age6574 |   .0018548   .0003052     6.08   0.000     .0012566    .0024531
    l2age75p |   .0075657   .0002968    25.49   0.000     .0069839    .0081474
    l2cancre |   .0059646   .0033107     1.80   0.072    -.0005243    .0124535
     l2diabe |   .0316772   .0036065     8.78   0.000     .0246086    .0387458
    l2hearte |   .0064634   .0023661     2.73   0.006     .0018258    .0111009
     l2hibpe |   .0022516   .0018383     1.22   0.221    -.0013513    .0058546
     l2lunge |   .0194295   .0042274     4.60   0.000      .011144    .0277151
    l2stroke |   .0201019   .0048563     4.14   0.000     .0105836    .0296201
      l2adl1 |   .0247427   .0035563     6.96   0.000     .0177725    .0317129
      l2adl2 |    .049077   .0060549     8.11   0.000     .0372097    .0609443
     l2adl3p |     .12703   .0086208    14.74   0.000     .1101335    .1439265
     l2iadl1 |    .046317   .0039632    11.69   0.000     .0385492    .0540847
    l2iadl2p |   .1588317   .0071043    22.36   0.000     .1449076    .1727558
    l2logbmi |   .0394141   .0056358     6.99   0.000     .0283681    .0504601
    l2psyche |   .0031693   .0030737     1.03   0.303    -.0028551    .0091936
    l2arthre |  -.0021608   .0019392    -1.11   0.265    -.0059616    .0016399
   l2asthmae |   .0012601   .0026398     0.48   0.633    -.0039138     .006434
   l2parkine |   .0505622   .0150352     3.36   0.001     .0210937    .0800307
    l2smokev |  -.0015792   .0019362    -0.82   0.415    -.0053741    .0022158
    l2smoken |   .0258808   .0031025     8.34   0.000     .0197999    .0319616
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/ltactx_e.st
> er saved

Iteration 0:   log likelihood = -44417.458  
Iteration 1:   log likelihood = -43299.617  
Iteration 2:   log likelihood = -43296.822  
Iteration 3:   log likelihood = -43296.821  

Ordered probit regression                       Number of obs     =     45,601
                                                LR chi2(17)       =    2241.27
                                                Prob > chi2       =     0.0000
Log likelihood = -43296.821                     Pseudo R2         =     0.0252

------------------------------------------------------------------------------
     smkstat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .2784524   .0111664    24.94   0.000     .2565667     .300338
      hsless |   .1965429   .0121532    16.17   0.000     .1727231    .2203628
     college |  -.2092694   .0156171   -13.40   0.000    -.2398784   -.1786603
    l2age65l |   -.004645   .0015438    -3.01   0.003    -.0076707   -.0016193
   l2age6574 |  -.0163034   .0019131    -8.52   0.000    -.0200531   -.0125537
    l2age75p |  -.0058359   .0021008    -2.78   0.005    -.0099535   -.0017183
    l2hearte |   .0687089   .0148148     4.64   0.000     .0396725    .0977453
    l2stroke |   .1644895   .0297759     5.52   0.000     .1061298    .2228491
    l2cancre |    .011143   .0202631     0.55   0.582    -.0285718    .0508579
     l2hibpe |  -.0394282   .0115399    -3.42   0.001    -.0620459   -.0168104
     l2diabe |   .1066286   .0198748     5.37   0.000     .0676747    .1455825
     l2lunge |   .4589192   .0238739    19.22   0.000     .4121271    .5057112
    l2logbmi |  -.2956149   .0343174    -8.61   0.000    -.3628757    -.228354
     l2drink |    .025319   .0180126     1.41   0.160    -.0099851    .0606232
  l2drinkd_e |   .0283261   .0023319    12.15   0.000     .0237556    .0328966
       atotf |  -3.54e-07   2.84e-08   -12.44   0.000    -4.10e-07   -2.98e-07
      itearn |  -4.36e-06   6.11e-07    -7.13   0.000    -5.56e-06   -3.16e-06
-------------+----------------------------------------------------------------
       /cut1 |  -1.410626   .1463823                      -1.69753   -1.123722
       /cut2 |   .1018897    .146158                     -.1845746     .388354
------------------------------------------------------------------------------

Frequencies for smkstat...


       smkstat |      Freq.     Percent        Cum.
---------------+-----------------------------------
  Never smoked |     17,255       37.84       37.84
 Former smoker |     22,686       49.75       87.59
Current smoker |      5,660       12.41      100.00
---------------+-----------------------------------
         Total |     45,601      100.00

Computing marginal effects after oprobit for smkstat == 1...


Marginal effects after oprobit
      y  = Pr(smkstat==1) (predict, o(1))
         =  .37434004
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|  -.1046214      .00415  -25.22   0.000  -.112753 -.096489   .436942
  hsless*|  -.0736969       .0045  -16.38   0.000  -.082518 -.064876   .359247
 college*|   .0807642      .00611   13.22   0.000   .068786  .092742   .167343
l2age65l |   .0017604      .00059    3.01   0.003   .000614  .002907   59.8639
l2a~6574 |   .0061787      .00073    8.52   0.000   .004758    .0076   3.65705
l2age75p |   .0022117       .0008    2.78   0.005   .000651  .003772   1.30284
l2hearte*|  -.0258352      .00552   -4.68   0.000  -.036663 -.015008   .162124
l2stroke*|  -.0605896      .01061   -5.71   0.000  -.081393 -.039787   .033727
l2cancre*|  -.0042166      .00766   -0.55   0.582  -.019222  .010789   .076204
 l2hibpe*|   .0149613      .00438    3.41   0.001   .006369  .023554   .395912
 l2diabe*|  -.0397835      .00729   -5.46   0.000   -.05407 -.025497   .083112
 l2lunge*|  -.1584362      .00727  -21.80   0.000  -.172681 -.144191   .052323
l2logbmi |   .1120334        .013    8.62   0.000   .086546  .137521   3.32143
 l2drink*|  -.0096251      .00687   -1.40   0.161  -.023087  .003836   .888709
l2dr~d_e |  -.0107351      .00088  -12.14   0.000  -.012468 -.009003   2.40863
   atotf |   1.34e-07      .00000   12.44   0.000   1.1e-07  1.6e-07   78873.9
  itearn |   1.65e-06      .00000    7.13   0.000   1.2e-06  2.1e-06   4121.53
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for smkstat == 2...


Marginal effects after oprobit
      y  = Pr(smkstat==2) (predict, o(2))
         =  .50905591
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0488251      .00198   24.69   0.000   .044949  .052701   .436942
  hsless*|   .0338711      .00201   16.82   0.000   .029924  .037818   .359247
 college*|  -.0430607      .00357  -12.05   0.000  -.050066 -.036055   .167343
l2age65l |  -.0008499      .00028   -3.01   0.003  -.001404 -.000296   59.8639
l2a~6574 |  -.0029829      .00035   -8.47   0.000  -.003673 -.002292   3.65705
l2age75p |  -.0010678      .00038   -2.78   0.006  -.001822 -.000314   1.30284
l2hearte*|   .0119916      .00246    4.87   0.000   .007163   .01682   .162124
l2stroke*|   .0253532      .00371    6.83   0.000   .018083  .032624   .033727
l2cancre*|     .00202      .00364    0.56   0.579  -.005113  .009153   .076204
 l2hibpe*|  -.0072701      .00215   -3.39   0.001  -.011477 -.003064   .395912
 l2diabe*|   .0177629      .00299    5.95   0.000   .011911  .023615   .083112
 l2lunge*|    .045944      .00112   41.01   0.000   .043748   .04814   .052323
l2logbmi |  -.0540866      .00632   -8.56   0.000  -.066475 -.041698   3.32143
 l2drink*|   .0047201      .00342    1.38   0.168  -.001984  .011424   .888709
l2dr~d_e |   .0051826      .00043   11.99   0.000   .004335   .00603   2.40863
   atotf |  -6.47e-08      .00000  -12.26   0.000  -7.5e-08 -5.4e-08   78873.9
  itearn |  -7.97e-07      .00000   -7.10   0.000  -1.0e-06 -5.8e-07   4121.53
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Computing marginal effects after oprobit for smkstat == 3...


Marginal effects after oprobit
      y  = Pr(smkstat==3) (predict, o(3))
         =  .11660406
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
    male*|   .0557963      .00231   24.12   0.000   .051263   .06033   .436942
  hsless*|   .0398258      .00255   15.59   0.000   .034819  .044832   .359247
 college*|  -.0377035      .00259  -14.58   0.000  -.042772 -.032635   .167343
l2age65l |  -.0009105       .0003   -3.01   0.003  -.001504 -.000317   59.8639
l2a~6574 |  -.0031958      .00038   -8.51   0.000  -.003932  -.00246   3.65705
l2age75p |   -.001144      .00041   -2.78   0.005  -.001951 -.000337   1.30284
l2hearte*|   .0138436      .00307    4.51   0.000   .007832  .019856   .162124
l2stroke*|   .0352364      .00693    5.09   0.000   .021657  .048816   .033727
l2cancre*|   .0021966      .00402    0.55   0.584  -.005676  .010069   .076204
 l2hibpe*|  -.0076912      .00224   -3.43   0.001  -.012083   -.0033   .395912
 l2diabe*|   .0220205      .00432    5.10   0.000    .01356  .030481   .083112
 l2lunge*|   .1124921      .00702   16.01   0.000   .098725   .12626   .052323
l2logbmi |  -.0579468      .00673   -8.61   0.000  -.071145 -.044748   3.32143
 l2drink*|    .004905      .00345    1.42   0.155  -.001854  .011664   .888709
l2dr~d_e |   .0055525      .00046   12.11   0.000   .004654  .006451   2.40863
   atotf |  -6.94e-08      .00000  -12.42   0.000  -8.0e-08 -5.8e-08   78873.9
  itearn |  -8.54e-07      .00000   -7.12   0.000  -1.1e-06 -6.2e-07   4121.53
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

Preparing final results...


Original results are now active. mfx results are stored as o_smkstat_mfx.

-------------------------------------------------------------------------------
Model o_smkstat_mfx (Marginal effects after oprobit)
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
     smkstat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
Never_smoked |
        male |  -.1046214   .0041491   -25.22   0.000    -.1127535   -.0964894
      hsless |  -.0736969   .0045005   -16.38   0.000    -.0825177   -.0648762
     college |   .0807642   .0061112    13.22   0.000     .0687863     .092742
    l2age65l |   .0017604    .000585     3.01   0.003     .0006137     .002907
   l2age6574 |   .0061787    .000725     8.52   0.000     .0047577    .0075998
    l2age75p |   .0022117   .0007962     2.78   0.005     .0006513    .0037722
    l2hearte |  -.0258352   .0055243    -4.68   0.000    -.0366626   -.0150078
    l2stroke |  -.0605896   .0106139    -5.71   0.000    -.0813926   -.0397867
    l2cancre |  -.0042166   .0076558    -0.55   0.582    -.0192217    .0107885
     l2hibpe |   .0149613   .0043841     3.41   0.001     .0063687     .023554
     l2diabe |  -.0397835   .0072893    -5.46   0.000    -.0540701   -.0254968
     l2lunge |  -.1584362   .0072679   -21.80   0.000    -.1726809   -.1441914
    l2logbmi |   .1120334   .0130039     8.62   0.000     .0865463    .1375205
     l2drink |  -.0096251   .0068682    -1.40   0.161    -.0230866    .0038364
  l2drinkd_e |  -.0107351   .0008839   -12.14   0.000    -.0124676   -.0090027
       atotf |   1.34e-07   1.08e-08    12.44   0.000     1.13e-07    1.55e-07
      itearn |   1.65e-06   2.32e-07     7.13   0.000     1.20e-06    2.11e-06
-------------+----------------------------------------------------------------
Former_smo~r |
        male |   .0488251   .0019776    24.69   0.000      .044949    .0527012
      hsless |   .0338711   .0020139    16.82   0.000     .0299239    .0378183
     college |  -.0430607   .0035742   -12.05   0.000     -.050066   -.0360553
    l2age65l |  -.0008499   .0002827    -3.01   0.003    -.0014039   -.0002958
   l2age6574 |  -.0029829   .0003523    -8.47   0.000    -.0036735   -.0022924
    l2age75p |  -.0010678   .0003846    -2.78   0.006    -.0018217   -.0003139
    l2hearte |   .0119916   .0024636     4.87   0.000      .007163    .0168201
    l2stroke |   .0253532   .0037095     6.83   0.000     .0180827    .0326236
    l2cancre |     .00202   .0036391     0.56   0.579    -.0051125    .0091525
     l2hibpe |  -.0072701   .0021462    -3.39   0.001    -.0114765   -.0030637
     l2diabe |   .0177629   .0029858     5.95   0.000     .0119109     .023615
     l2lunge |    .045944   .0011202    41.01   0.000     .0437485    .0481396
    l2logbmi |  -.0540866   .0063207    -8.56   0.000     -.066475   -.0416982
     l2drink |   .0047201   .0034204     1.38   0.168    -.0019837    .0114239
  l2drinkd_e |   .0051826   .0004323    11.99   0.000     .0043354    .0060299
       atotf |  -6.47e-08   5.28e-09   -12.26   0.000    -7.51e-08   -5.44e-08
      itearn |  -7.97e-07   1.12e-07    -7.10   0.000    -1.02e-06   -5.77e-07
-------------+----------------------------------------------------------------
Current_sm~r |
        male |   .0557963    .002313    24.12   0.000      .051263    .0603296
      hsless |   .0398258   .0025543    15.59   0.000     .0348194    .0448322
     college |  -.0377035   .0025861   -14.58   0.000    -.0427721   -.0326348
    l2age65l |  -.0009105   .0003026    -3.01   0.003    -.0015037   -.0003174
   l2age6574 |  -.0031958   .0003755    -8.51   0.000    -.0039317   -.0024599
    l2age75p |   -.001144   .0004118    -2.78   0.005    -.0019511   -.0003368
    l2hearte |   .0138436   .0030675     4.51   0.000     .0078315    .0198557
    l2stroke |   .0352364   .0069285     5.09   0.000     .0216568    .0488161
    l2cancre |   .0021966   .0040168     0.55   0.584    -.0056762    .0100694
     l2hibpe |  -.0076912   .0022406    -3.43   0.001    -.0120826   -.0032997
     l2diabe |   .0220205   .0043165     5.10   0.000     .0135603    .0304808
     l2lunge |   .1124921   .0070243    16.01   0.000     .0987247    .1262596
    l2logbmi |  -.0579468    .006734    -8.61   0.000    -.0711453   -.0447484
     l2drink |    .004905   .0034486     1.42   0.155    -.0018541    .0116641
  l2drinkd_e |   .0055525   .0004585    12.11   0.000     .0046539    .0064511
       atotf |  -6.94e-08   5.59e-09   -12.42   0.000    -8.03e-08   -5.84e-08
      itearn |  -8.54e-07   1.20e-07    -7.12   0.000    -1.09e-06   -6.19e-07
------------------------------------------------------------------------------
file /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimates/ELSA/smkstat.ste
> r saved

. 
. * xml_tab b_*, save(test.xml) append sheet(ols) pvalue
. * xml_tab ols_*, save(test.xml) append sheet(ols) pvalue
. * xml_tab o_*, save(test.xml) append sheet(ordered) pvalue
. 
.  * Unsure of what to change here, modify when outputs are understood more
. xml_tab b_*, save(test.xml) replace sheet(binaries) pvalue


note: results saved to /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimati
> on/test.xml

. xml_tab ols_*, save(test.xml) append sheet(ols) pvalue


note: results saved to /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimati
> on/test.xml

. xml_tab o_*, save(test.xml) append sheet(ordered) pvalue


note: results saved to /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Estimati
> on/test.xml

. 
. capture log close

. 
end of do-file
