-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/ld-archer/Documents/E_FEM/trunk/FEM_Stata/Makedata/ELSA/rewe
> ight_ELSA_repl.log
  log type:  text
 opened on:  18 Nov 2019, 13:22:12

. 
. quietly include ../../../fem_env.do

. 
. local file : env scen

. 
. *use ../../../input_data/ELSA_repl_`file'.dta, clear
. use $outdata/ELSA_repl_`file'.dta, clear

. 
. * Merge the stock population with the projections by sex, age and year
. *merge m:1 male age year using ../../../input_data/pop_projections.dta, keep(
> matched)
. merge m:1 male age year using $outdata/pop_projections.dta, keep(matched)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             8,825  (_merge==3)
    -----------------------------------------

. 
. * Check the merge
. tab _merge

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
            matched (3) |      8,825      100.00      100.00
------------------------+-----------------------------------
                  Total |      8,825      100.00

. drop _merge

. 
. keep if inlist(age, 51, 52)
(0 observations deleted)

. 
. * Generate the weighting var from cross-sectional weight var 
. gen weight = .
(8,825 missing values generated)

. gen weight2 = .
(8,825 missing values generated)

. 
. * Nested for loops to calculate the denominator and in turn the weight value
. forvalues age = 51/52 {
  2.         forvalues male = 0/1 {
  3.                 forvalues year = 2012 (2) 2060 {
  4.                         sum cwtresp if age == `age' & male == `male' & yea
> r == `year'
  5.                         scalar denom = r(sum)
  6.                         replace weight = (cwtresp * v)/denom if age == `ag
> e' & male == `male' & year == `year'
  7.                 }
  8.         }
  9. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        101     1.53745     1.13894          0   5.228424
(101 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         60    2.663719    1.357526          0   6.092765
(60 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |        116    1.406255    1.138467          0   4.510633
(116 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cwtresp |         76    2.721296    1.421727          0   5.754531
(76 real changes made)

. 
. 
. * Reweighting by education
. *merge m:1 male rbyr educ using ../../../input_data/education_data.dta
. merge m:1 male rbyr educ using $outdata/education_data.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                           583
        from master                       583  (_merge==1)
        from using                          0  (_merge==2)

    matched                             8,242  (_merge==3)
    -----------------------------------------

. 
. * Check the merge
. tab _merge

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |        583        6.61        6.61
            matched (3) |      8,242       93.39      100.00
------------------------+-----------------------------------
                  Total |      8,825      100.00

. drop _merge

. 
. * Nested loops over birth year, gender and education level for reweighting
. forvalues rbyr = 1963/2009 {
  2.         forvalues male = 0/1 {
  3.                 forvalues educ = 1/3 {
  4.                         sum weight if rbyr == `rbyr' & male == `male' & ed
> uc == `educ'
  5.                         scalar denom2 = r(sum)
  6.                         replace weight2 = (weight * total)/denom2 if rbyr 
> == `rbyr' &  male == `male' & educ == `educ'
  7.                 }
  8.         }
  9. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3722.579    2836.743          0   8264.079
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3574.262    2766.483          0   9285.655
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2193.179    2882.927          0   6609.937
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4800.554    2464.657          0   8805.974
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    5126.813    2760.634          0    11205.9
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6775.021    3454.237          0   12269.34
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42     4864.95    2445.171          0   10960.45
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62     3328.34    2861.378          0   13502.47
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2860.429    2928.316          0   8777.456
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    5239.514    2688.915          0   10742.73
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    6012.003    3132.219          0   14848.38
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6907.858    4026.422          0   14662.52
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27     3826.75    2920.724          0   8544.391
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3682.419    2852.054          0   9600.617
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2255.387    2961.026          0   6651.409
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4884.626    2500.922          0   8819.043
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    5258.761    2840.556          0   11522.38
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6935.916    3562.163          0   12615.85
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4868.789    2450.974          0   11029.22
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    3334.487    2857.349          0    13364.9
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14     2874.18    2945.638          0   8832.527
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    5245.957    2692.581          0   10758.67
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    6022.184    3135.294          0   14844.91
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6934.498    4019.939          0   14659.09
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27     3785.59    2891.232          0   8457.331
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3643.007    2821.931          0   9502.796
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2229.463    2926.192          0   6539.482
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15     4856.66    2483.833          0   8694.262
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    5250.425    2841.374          0   11519.68
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6918.439    3567.186          0    12612.9
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4798.958    2413.967          0   10843.62
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    3285.057    2819.184          0   13240.79
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2827.717    2896.536          0   8683.897
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    5167.853    2653.566          0   10606.45
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5930.422    3080.523          0   14560.67
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8     6837.67    3940.347          0   14378.42
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3737.054    2856.191          0   8378.795
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3601.883    2791.406          0   9414.551
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2203.184    2890.287          0   6415.943
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4760.083    2434.115          0   8511.389
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34     5149.47    2786.895          0   11299.12
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6783.851    3499.691          0    12371.4
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4730.751    2374.871          0   10604.24
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    3233.374    2788.426          0   13262.81
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2771.227    2834.161          0   8492.196
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    5076.226    2602.089          0   10383.36
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5844.971    3068.828          0   14581.03
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6735.581    3945.958          0   14398.52
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3726.367     2849.57          0   8392.729
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3599.218    2791.009          0   9430.208
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2201.408    2886.704          0   6426.613
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4759.346    2433.099          0   8489.471
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    5152.221    2792.606          0   11314.91
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6788.966    3506.264          0    12388.7
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4578.017    2314.178          0   10486.56
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62     3142.14    2675.767          0   12280.64
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2724.712    2798.932          0   8397.952
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    5016.324    2585.332          0   10356.62
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5723.651    2920.035          0   13647.54
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6610.569    3694.788          0   13476.71
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27     3464.05    2652.491          0   7771.213
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3337.981    2587.969          0   8731.862
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2037.936    2672.246          0   5950.696
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4422.197    2258.526          0   7797.505
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    4820.079    2612.619          0   10590.52
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6335.148    3289.461          0   11595.56
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4263.897    2149.454          0    9698.83
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    2922.549    2498.423          0   11606.16
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2524.718    2589.679          0   7767.114
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    4623.925    2377.514          0   9512.463
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5297.574    2732.498          0   12850.33
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6123.548    3474.268          0   12689.48
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3284.839    2510.449          0   7344.397
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3161.696    2449.548          0   8252.285
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    1933.558     2537.16          0   5641.111
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4204.423     2150.29          0   7527.506
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    4547.098      2458.5          0   9971.888
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    5989.053    3087.826          0   10918.22
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4109.242    2072.047          0   9353.963
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    2816.951    2407.142          0   11168.14
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2434.467    2497.489          0   7490.934
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21     4465.87    2295.607          0   9183.082
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5115.214    2641.459          0   12444.67
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8     5899.95     3368.05          0   12288.91
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3187.589    2431.385          0   7067.218
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3057.468    2366.361          0   7940.842
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    1873.243    2461.634          0   5618.082
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4129.813    2119.196          0   7555.742
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    4419.067    2377.866          0   9657.098
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    5834.343    2978.207          0   10573.55
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4221.747    2114.868          0   9315.776
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    2876.843    2506.613          0    12199.5
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2444.857    2492.981          0   7460.354
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    4535.895    2319.407          0   9217.528
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48     5250.97    2816.741          0   13510.56
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8     6024.94    3667.084          0   13341.45
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3485.158     2652.89          0   7719.864
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3344.938    2588.841          0   8674.165
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2057.264    2707.217          0   6302.353
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4523.331    2327.707          0   8384.965
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    4800.683    2584.329          0   10484.23
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6357.581    3225.951          0   11479.18
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4619.755      2324.6          0   10450.42
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    3163.072    2712.695          0   12717.45
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2724.365    2791.303          0    8369.01
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    4981.682    2558.634          0   10229.13
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5705.162      2958.5          0   13998.18
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6548.165    3799.722          0   13822.97
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3606.372    2753.162          0   8047.625
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3469.057    2686.722          0   9042.443
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2123.938    2788.361          0   6259.863
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4598.613    2353.777          0   8285.136
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    4956.972    2677.706          0   10862.62
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6535.036    3359.552          0   11893.48
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4590.955    2309.754          0   10379.96
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    3143.043    2696.332          0   12651.25
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2706.367    2772.575          0   8312.587
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    4928.191    2529.529          0   10107.34
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5657.745    2945.288          0   13942.87
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6516.735    3775.025          0   13768.34
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3583.961    2736.613          0   8005.736
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3448.992    2671.521          0   8995.376
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2111.297    2771.333          0     6203.5
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4591.591    2351.453          0   8303.404
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    4939.583    2666.947          0    10819.7
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6515.803    3343.903          0   11846.49
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4577.973    2299.412          0    10286.5
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    3130.401    2695.591          0   12773.54
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2686.457    2748.764          0    8237.74
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    4956.821    2539.815          0   10129.63
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5709.814    3006.669          0   14313.45
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6568.695    3877.336          0   14134.29
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3623.338    2764.283          0   8083.122
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3485.728    2699.366          0   9082.328
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2136.026    2804.998          0   6328.267
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4719.681    2417.783          0   8551.781
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    5069.993    2738.926          0   11107.27
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6692.561    3431.516          0   12161.35
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4647.097    2337.123          0   10493.39
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    3180.687    2730.715          0   12839.27
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14     2736.88    2803.107          0   8403.422
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    5069.983    2607.254          0   10432.63
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5799.936    2988.132          0   14069.89
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6679.919    3811.775          0   13893.78
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3659.733    2790.238          0   8124.712
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3513.179    2719.253          0    9129.06
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2153.954    2830.646          0   6464.891
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4704.167     2419.62          0     8702.7
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    5006.217     2686.61          0   10918.27
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6616.981    3360.635          0   11954.41
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4718.552    2377.628          0   10719.94
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    3233.412    2766.093          0   12875.94
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2791.428     2862.53          0   8584.848
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    5171.648     2655.86          0   10616.74
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5924.602    3074.533          0   14551.44
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8     6801.51    3949.099          0   14369.31
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3660.544     2794.02          0   8147.916
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3517.019    2723.164          0   9155.131
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15     2153.39    2827.871          0    6382.63
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15     4844.41    2488.274          0   8905.575
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34     5170.14    2780.378          0   11291.96
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6831.181    3479.445          0   12363.56
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4708.906    2365.326          0   10583.53
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    3220.098    2772.372          0    13131.9
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2763.833    2828.083          0   8475.611
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    5307.701    2721.615          0   10864.24
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    6099.792      3195.1          0   15187.05
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    7004.414    4119.336          0   14996.96
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3714.079    2835.591          0   8309.889
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3577.293    2771.318          0   9337.127
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2190.603    2875.189          0   6425.586
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4951.631    2530.953          0   8817.036
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    5365.363    2908.747          0   11785.19
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    7067.867    3653.264          0    12903.6
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4662.044    2354.415          0   10654.76
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    3198.391    2727.033          0    12565.9
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2770.082    2844.168          0   8532.654
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    5229.083    2688.491          0   10756.23
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5988.823    3089.518          0   14541.53
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6913.184    3934.084          0   14359.52
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3569.645    2726.974          0   7951.723
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3430.062    2656.359          0   8934.687
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2098.181    2754.424          0   6178.569
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4800.628    2459.973          0    8714.31
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34     5157.11    2779.638          0   11284.27
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6802.599    3485.013          0   12355.14
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4487.741    2265.394          0   10245.16
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    3078.152    2626.097          0   12123.81
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2664.366    2734.993          0   8204.635
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21     5158.83    2655.398          0   10630.91
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5892.533    3022.321          0   14193.63
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6786.917    3846.594          0   14015.97
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3448.216    2633.077          0   7671.966
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3311.873    2564.382          0   8620.347
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2026.733    2661.292          0   5996.737
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4691.728    2404.947          0   8533.056
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    5036.699    2712.129          0   11014.29
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6643.368    3400.422          0   12059.55
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4404.284    2214.916          0   9943.654
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62     3014.41    2588.186          0   12171.99
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2593.599    2656.281          0   7963.177
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    5066.984    2603.228          0   10409.79
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5804.749    3005.377          0   14194.09
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6679.952    3846.198          0   14016.42
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3433.857    2624.573          0   7702.456
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3310.354    2565.616          0   8654.606
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2024.859    2656.231          0   5898.046
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15     4633.12    2368.575          0   8264.517
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34     5018.61      2716.8          0   11014.65
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10     6608.85    3413.201          0   12059.94
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4289.562    2160.777          0   9736.242
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    2938.912    2515.503          0   11727.71
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2535.906    2600.001          0   7797.075
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21     4905.42     2520.85          0   10082.19
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5622.248     2907.66          0   13707.16
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6487.372    3708.595          0   13535.59
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3311.559    2531.897          0   7421.314
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3190.681    2472.758          0   8338.711
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15     1950.78    2559.013          0   5682.766
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4473.959    2287.189          0    7979.99
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    4846.687    2623.455          0   10636.79
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6382.001    3296.161          0   11646.22
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4122.982    2078.285          0   9376.609
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    2825.865    2416.016          0   11226.76
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2440.957    2503.669          0    7509.07
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21     4726.38    2432.048          0   9735.083
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5405.515    2777.244          0    13040.9
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6240.125    3529.058          0   12877.67
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3173.927    2426.388          0   7104.313
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3056.355    2368.316          0   7982.523
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    1868.703    2451.648          0   5440.027
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4270.506     2184.44          0    7656.21
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    4616.382    2494.302          0   10119.77
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6080.077    3132.787          0   11080.14
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4007.646    2013.065          0   9007.188
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    2740.542     2359.53          0   11176.83
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2352.195    2406.864          0   7213.227
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    4562.805    2339.725          0   9340.093
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5249.329    2749.465          0   13051.16
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8     6047.95    3532.461          0    12887.8
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3193.545    2432.892          0   7072.715
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3063.115     2370.36          0   7947.019
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15      1880.1    2472.422          0   5703.445
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4352.137    2236.599          0   8020.314
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34     4637.18    2494.447          0   10127.73
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6131.124    3119.372          0   11088.85
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4206.991     2113.31          0   9457.323
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    2876.983    2476.662          0   11727.57
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2469.598    2527.107          0   7573.708
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    4779.294    2450.861          0   9784.276
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5491.032    2874.689          0   13662.21
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6303.546    3706.554          0    13491.2
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3359.187    2558.105          0   7421.229
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57     3218.73    2490.317          0   8338.614
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    1976.667     2600.79          0   6043.346
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    4580.232    2358.113          0   8507.123
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    4860.981    2610.246          0   10601.91
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6432.565    3261.098          0   11608.03
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4459.692    2240.013          0   10020.94
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    3049.533    2625.922          0      12443
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2617.088    2677.796          0   8025.069
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    5073.403    2600.708          0   10378.15
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    5831.481    3060.778          0   14568.37
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    6686.488    3955.589          0   14386.02
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         27    3556.938    2709.486          0   7873.954
(27 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         57    3411.061    2639.519          0   8847.304
(57 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15    2093.935    2753.915          0   6362.252
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         15     4863.49    2500.299          0   8977.443
(15 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         34    5177.241    2784.488          0   11305.09
(34 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    6847.075    3481.017          0   12377.94
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         42    4661.396    2345.901          0   10549.74
(42 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         62    3191.883     2736.62          0   12819.44
(62 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         14    2749.902    2817.745          0   8448.551
(14 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         21    5332.024    2739.055          0   10951.91
(21 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         48    6105.642    3163.091          0    14955.5
(48 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    7012.148    4057.958          0    14768.3
(8 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         20    3729.985    2875.125          0   8112.163
(20 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         46    3719.241     2696.69          0   9114.959
(46 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         11    2345.864    2810.833          0   6211.773
(11 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         10    4467.359    2711.242          0     7140.7
(10 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |         28    5792.013    2723.065          0    11605.5
(28 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      weight |          8    7297.819    3981.589          0   12706.86
(8 real changes made)

. 
. * Replace weight with weight2 (further adjusted by education) if weight2 is p
> resent
. replace weight = weight2 if !missing(weight2)
(6,325 real changes made)

. * No longer need weight2
. drop weight2

. 
. * Check distribution of education levels, should match distribution by year 
. * seen in education_data.dta
. tab rbyr educ [aw=weight] if inrange(rbyr, 1963, 1982), row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Harmonised Education Level
      rbyr | 1.Less th  2.Upper S  3.Tertiar |     Total
-----------+---------------------------------+----------
      1963 | 21.048521  78.236407  42.532666 | 141.81759 
           |     14.84      55.17      29.99 |    100.00 
-----------+---------------------------------+----------
      1964 | 20.494771  78.343859  43.023725 | 141.86235 
           |     14.45      55.23      30.33 |    100.00 
-----------+---------------------------------+----------
      1965 |19.9410219  78.451311  43.514783 | 141.90712 
           |     14.05      55.28      30.66 |    100.00 
-----------+---------------------------------+----------
      1966 | 19.387273  78.558763  44.005841 | 141.95188 
           |     13.66      55.34      31.00 |    100.00 
-----------+---------------------------------+----------
      1967 | 18.833523  78.666216  44.496901 | 141.99664 
           |     13.26      55.40      31.34 |    100.00 
-----------+---------------------------------+----------
      1968 | 18.279774  78.773668  44.987959 |  142.0414 
           |     12.87      55.46      31.67 |    100.00 
-----------+---------------------------------+----------
      1969 | 17.726024 78.8811197  45.479018 | 142.08616 
           |     12.48      55.52      32.01 |    100.00 
-----------+---------------------------------+----------
      1970 | 17.172275  78.988572  45.970077 |142.130924 
           |     12.08      55.57      32.34 |    100.00 
-----------+---------------------------------+----------
      1971 | 16.482149  76.380261   46.80464 | 139.66705 
           |     11.80      54.69      33.51 |    100.00 
-----------+---------------------------------+----------
      1972 | 15.792023  73.771949  47.639203 | 137.20318 
           |     11.51      53.77      34.72 |    100.00 
-----------+---------------------------------+----------
      1973 | 15.101898  71.163638 48.4737664 |  134.7393 
           |     11.21      52.82      35.98 |    100.00 
-----------+---------------------------------+----------
      1974 | 14.411772  68.555327   49.30833 | 132.27543 
           |     10.90      51.83      37.28 |    100.00 
-----------+---------------------------------+----------
      1975 | 13.721646  65.947016  50.142894 | 129.81156 
           |     10.57      50.80      38.63 |    100.00 
-----------+---------------------------------+----------
      1976 |13.3140459  65.394188  50.811482 | 129.51972 
           |     10.28      50.49      39.23 |    100.00 
-----------+---------------------------------+----------
      1977 | 12.906446 64.8413599 51.4800733 |129.227879 
           |      9.99      50.18      39.84 |    100.00 
-----------+---------------------------------+----------
      1978 | 12.498846  64.288532  52.148663 | 128.93604 
           |      9.69      49.86      40.45 |    100.00 
-----------+---------------------------------+----------
      1979 | 12.091246  63.735705  52.817254 |  128.6442 
           |      9.40      49.54      41.06 |    100.00 
-----------+---------------------------------+----------
      1980 | 11.683646  63.182877  53.485843 | 128.35237 
           |      9.10      49.23      41.67 |    100.00 
-----------+---------------------------------+----------
      1981 | 11.276046 62.6300492  54.154433 | 128.06053 
           |      8.81      48.91      42.29 |    100.00 
-----------+---------------------------------+----------
      1982 | 10.868445 62.0772216  54.823022 | 127.76869 
           |      8.51      48.59      42.91 |    100.00 
-----------+---------------------------------+----------
     Total | 313.03139  1,430.868  966.10057 |     2,710 
           |     11.55      52.80      35.65 |    100.00 

. 
. if "`file'" == "base" {
.         *saveold ../../../input_data/ELSA_repl.dta, replace v(12)
.         saveold $outdata/ELSA_repl.dta, replace v(12)
. }

. else {
.         *saveold ../../../input_data/ELSA_repl_`file'.dta, replace v(12)
.         saveold $outdata/ELSA_repl_`file'.dta, replace v(12)
(saving in Stata 12 format, which can be read by Stata 11 or 12)
file /home/ld-archer/Documents/E_FEM/trunk/input_data/ELSA_repl_smoken.dta save
> d
. }

. 
. capture log close 
